
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: AnimGraphRuntime
/// dependency: ControlRig
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: MFAnimationRuntime
/// dependency: SGFramework

/// Class /Game/ArtResource/Assets/Animation/AnimBlueprints/CA_Body_RBF_AnimBlueprint.CA_Body_RBF_AnimBlueprint_C
/// Size: 0x5ED8 (24280 bytes) (0x0002B8 - 0x006190) align 16 pad: 0x0000
class UCA_Body_RBF_AnimBlueprint_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver;                                   // 0x02F8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver0;                                  // 0x0518   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver1;                                  // 0x0738   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver2;                                  // 0x0958   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver3;                                  // 0x0B78   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver4;                                  // 0x0D98   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver5;                                  // 0x0FB8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver6;                                  // 0x11D8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver7;                                  // 0x13F8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver8;                                  // 0x1618   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver9;                                  // 0x1838   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver10;                                 // 0x1A58   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver11;                                 // 0x1C78   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver12;                                 // 0x1E98   (0x0220)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x20B8   (0x0118)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver13;                                 // 0x21D0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver14;                                 // 0x23F0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver15;                                 // 0x2610   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver16;                                 // 0x2830   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver17;                                 // 0x2A50   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver18;                                 // 0x2C70   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver19;                                 // 0x2E90   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver20;                                 // 0x30B0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver21;                                 // 0x32D0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver22;                                 // 0x34F0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver23;                                 // 0x3710   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver24;                                 // 0x3930   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver25;                                 // 0x3B50   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver26;                                 // 0x3D70   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver27;                                 // 0x3F90   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver28;                                 // 0x41B0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver29;                                 // 0x43D0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver30;                                 // 0x45F0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver31;                                 // 0x4810   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver32;                                 // 0x4A30   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver33;                                 // 0x4C50   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver34;                                 // 0x4E70   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver35;                                 // 0x5090   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver36;                                 // 0x52B0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver37;                                 // 0x54D0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver38;                                 // 0x56F0   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver39;                                 // 0x5910   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver40;                                 // 0x5B30   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver41;                                 // 0x5D50   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver42;                                 // 0x5F70   (0x0220)  


	/// Functions
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/CA_Body_RBF_AnimBlueprint.CA_Body_RBF_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/CA_Body_RBF_AnimBlueprint.CA_Body_RBF_AnimBlueprint_C.ExecuteUbergraph_CA_Body_RBF_AnimBlueprint
	// void ExecuteUbergraph_CA_Body_RBF_AnimBlueprint(int32_t EntryPoint);                                                     // [0x3a75280] Final                
};

/// Class /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Facial_Skeleton_AnimBlueprint.Uam_Facial_Skeleton_AnimBlueprint_C
/// Size: 0x0C94 (3220 bytes) (0x000B70 - 0x001804) align 16 pad: 0x0004
#pragma pack(push, 0x1)
class UUam_Facial_Skeleton_AnimBlueprint_C : public USGCharacterFacialAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B70   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0B78   (0x0030)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0BA8   (0x00C0)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0C68   (0x01D8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0E40   (0x0178)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0FB8   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend0;                            // 0x1000   (0x00C0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot1;                                        // 0x10C0   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend2;                            // 0x1108   (0x00C0)  
	FAnimNode_RefPose                                  AnimGraphNode_LocalRefPose;                                 // 0x11C8   (0x0018)  
	FAnimNode_ControlRig                               AnimGraphNode_ControlRig;                                   // 0x11E0   (0x0368)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh3;                            // 0x1548   (0x01D8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1720   (0x00C8)  
	bool                                               __CustomProperty_is_anim_input_7BA4030D4B78D25308BBBFB5F0AD7281; // 0x17E8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x17E9   (0x0003)  MISSED
	FVector                                            __CustomProperty_camera_pos_7BA4030D4B78D25308BBBFB5F0AD7281; // 0x17EC   (0x000C)  
	bool                                               __CustomProperty_is_aim_ctrl_7BA4030D4B78D25308BBBFB5F0AD7281; // 0x17F8   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x17F9   (0x0003)  MISSED
	FVector2D                                          __CustomProperty_aim_ctrl_value_7BA4030D4B78D25308BBBFB5F0AD7281; // 0x17FC   (0x0008)  


	/// Functions
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Facial_Skeleton_AnimBlueprint.Uam_Facial_Skeleton_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Facial_Skeleton_AnimBlueprint.Uam_Facial_Skeleton_AnimBlueprint_C.ExecuteUbergraph_Uam_Facial_Skeleton_AnimBlueprint
	// void ExecuteUbergraph_Uam_Facial_Skeleton_AnimBlueprint(int32_t EntryPoint);                                             // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Skeleton_HandIK_AnimBlueprint.Uam_Skeleton_HandIK_AnimBlueprint_C
/// Size: 0x1CA8 (7336 bytes) (0x000CA0 - 0x002948) align 16 pad: 0x0008
#pragma pack(push, 0x1)
class UUam_Skeleton_HandIK_AnimBlueprint_C : public USGCharacterHandIKAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0CA0   (0x0008)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0CA8   (0x0118)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0DC0   (0x0158)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0F18   (0x0008)  MISSED
	FAnimNode_Fabrik                                   AnimGraphNode_Fabrik;                                       // 0x0F20   (0x0190)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x10B0   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x10D8   (0x00C8)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose0;                               // 0x11A0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose1;                               // 0x11C8   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend2;                                 // 0x11F0   (0x00C8)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x12B8   (0x0158)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x1410   (0x0030)  
	FAnimNode_TwoBoneIK                                AnimGraphNode_TwoBoneIK;                                    // 0x1440   (0x01F0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1630   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose3;                              // 0x1650   (0x0158)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone;                                     // 0x17A8   (0x00F8)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone4;                                  // 0x18A0   (0x0158)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose5;                               // 0x19F8   (0x0028)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone6;                                    // 0x1A20   (0x00F8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1B18   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone7;                                  // 0x1B38   (0x0158)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone8;                                  // 0x1C90   (0x0158)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone9;                                  // 0x1DE8   (0x0158)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone10;                                 // 0x1F40   (0x0158)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone11;                                 // 0x2098   (0x0158)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone12;                                 // 0x21F0   (0x0158)  
	FAnimNode_AdjustArmStretch                         AnimGraphNode_AdjustArmStretch;                             // 0x2348   (0x0128)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone13;                                   // 0x2470   (0x00F8)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone14;                                   // 0x2568   (0x00F8)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone15;                                   // 0x2660   (0x00F8)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone16;                                   // 0x2758   (0x00F8)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone17;                                   // 0x2850   (0x00F8)  


	/// Functions
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Skeleton_HandIK_AnimBlueprint.Uam_Skeleton_HandIK_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink InputPose, bool InputParam, FPoseLink& AnimGraph);                                              // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Skeleton_HandIK_AnimBlueprint.Uam_Skeleton_HandIK_AnimBlueprint_C.ExecuteUbergraph_Uam_Skeleton_HandIK_AnimBlueprint
	// void ExecuteUbergraph_Uam_Skeleton_HandIK_AnimBlueprint(int32_t EntryPoint);                                             // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/ArtResource/Assets/Animation/ControlRig/CR_Aim_Head.CR_Aim_Head_C
/// Size: 0x001D (29 bytes) (0x000650 - 0x00066D) align 8 pad: 0x0005
#pragma pack(push, 0x1)
class UCR_Aim_Head_C : public UControlRig
{ 
public:
	bool                                               look_at_camera;                                             // 0x0650   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0651   (0x0003)  MISSED
	FVector2D                                          aim_ctrl_value;                                             // 0x0654   (0x0008)  
	bool                                               is_aim_ctrl;                                                // 0x065C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x065D   (0x0003)  MISSED
	FVector                                            camera_pos;                                                 // 0x0660   (0x000C)  
	bool                                               is_anim_input;                                              // 0x066C   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Skeleton_Preview_AnimBlueprint.Uam_Skeleton_Preview_AnimBlueprint_C
/// Size: 0x5558 (21848 bytes) (0x000DC0 - 0x006318) align 16 pad: 0x0008
#pragma pack(push, 0x1)
class UUam_Skeleton_Preview_AnimBlueprint_C : public USGCharacterPreviewAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0DC0   (0x0008)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone;                                     // 0x0DC8   (0x00F8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0EC0   (0x0178)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1038   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer0;                              // 0x1060   (0x0178)  
	FAnimNode_MakeDynamicAdditive                      AnimGraphNode_MakeDynamicAdditive;                          // 0x11D8   (0x0038)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1210   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend1;                                 // 0x12D8   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer2;                              // 0x13A0   (0x0178)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer3;                              // 0x1518   (0x0178)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1690   (0x00C0)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x1750   (0x00C8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1818   (0x0020)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone4;                                    // 0x1838   (0x00F8)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1930   (0x0020)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone5;                                    // 0x1950   (0x00F8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace6;                       // 0x1A48   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x1A68   (0x0158)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose7;                               // 0x1BC0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose8;                               // 0x1BE8   (0x0028)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x1C10   (0x0030)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace9;                       // 0x1C40   (0x0020)  
	FAnimNode_Constraint                               AnimGraphNode_Constraint;                                   // 0x1C60   (0x0110)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace10;                      // 0x1D70   (0x0020)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend11;                                // 0x1D90   (0x00C8)  
	FAnimNode_MakeDynamicAdditive                      AnimGraphNode_MakeDynamicAdditive12;                        // 0x1E58   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer13;                             // 0x1E90   (0x0178)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer14;                             // 0x2008   (0x0178)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend15;                                // 0x2180   (0x00C8)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace16;                      // 0x2248   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace17;                      // 0x2268   (0x0020)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone18;                                   // 0x2288   (0x00F8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend19;                                // 0x2380   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend20;                                // 0x2448   (0x00C8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend21;                           // 0x2510   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer22;                             // 0x25D0   (0x0178)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose23;                              // 0x2748   (0x0028)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace24;                      // 0x2770   (0x0020)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend25;                           // 0x2790   (0x00C0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose26;                              // 0x2850   (0x0028)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose27;                             // 0x2878   (0x0158)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x29D0   (0x0118)  
	FAnimNode_Root                                     AnimGraphNode_Root28;                                       // 0x2AE8   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x2B18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult29;                           // 0x2B40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult30;                           // 0x2B68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult31;                           // 0x2B90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult32;                           // 0x2BB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult33;                           // 0x2BE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult34;                           // 0x2C08   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult35;                           // 0x2C30   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult36;                           // 0x2C58   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult37;                           // 0x2C80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult38;                           // 0x2CA8   (0x0028)  
	FAnimNode_RefPose                                  AnimGraphNode_LocalRefPose;                                 // 0x2CD0   (0x0018)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x2CE8   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x2D18   (0x0140)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult39;                                // 0x2E58   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult40;                           // 0x2E88   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator41;                          // 0x2EB0   (0x0140)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult42;                                // 0x2FF0   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult43;                           // 0x3020   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend44;                                // 0x3048   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator45;                          // 0x3110   (0x0140)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer46;                             // 0x3250   (0x0178)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult47;                                // 0x33C8   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator48;                          // 0x33F8   (0x0140)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend49;                                // 0x3538   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer50;                             // 0x3600   (0x0178)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult51;                                // 0x3778   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult52;                           // 0x37A8   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x37D0   (0x00B0)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend53;                           // 0x3880   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator54;                          // 0x3940   (0x0140)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer55;                             // 0x3A80   (0x0178)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend56;                                // 0x3BF8   (0x00C8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace57;                      // 0x3CC0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x3CE0   (0x0158)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace58;                      // 0x3E38   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone59;                                 // 0x3E58   (0x0158)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone60;                                 // 0x3FB0   (0x0158)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x4108   (0x0208)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer61;                           // 0x4310   (0x0208)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend62;                                // 0x4518   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend63;                                // 0x45E0   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer64;                           // 0x46A8   (0x0208)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone65;                                 // 0x48B0   (0x0158)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace66;                      // 0x4A08   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace67;                      // 0x4A28   (0x0020)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend68;                           // 0x4A48   (0x00C0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace69;                      // 0x4B08   (0x0020)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend70;                                // 0x4B28   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive71;                              // 0x4BF0   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose72;                             // 0x4CB8   (0x0158)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose73;                              // 0x4E10   (0x0028)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer74;                           // 0x4E38   (0x0208)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive75;                              // 0x5040   (0x00C8)  
	FAnimNode_MakeDynamicAdditive                      AnimGraphNode_MakeDynamicAdditive76;                        // 0x5108   (0x0038)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive77;                              // 0x5140   (0x00C8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend78;                           // 0x5208   (0x00C0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose79;                              // 0x52C8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose80;                              // 0x52F0   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator81;                          // 0x5318   (0x0140)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator82;                          // 0x5458   (0x0140)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator83;                          // 0x5598   (0x0140)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend84;                                // 0x56D8   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer85;                           // 0x57A0   (0x0208)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend86;                                // 0x59A8   (0x00C8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x5A70   (0x00A0)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x5B10   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer87;                             // 0x5BC0   (0x0178)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer88;                             // 0x5D38   (0x0178)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x5EB0   (0x00A0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator89;                          // 0x5F50   (0x0140)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend90;                                // 0x6090   (0x00C8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x6158   (0x0048)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone91;                                 // 0x61A0   (0x0158)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace92;                      // 0x62F8   (0x0020)  


	/// Functions
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Skeleton_Preview_AnimBlueprint.Uam_Skeleton_Preview_AnimBlueprint_C.HandGripLyaer
	// void HandGripLyaer(FPoseLink InPose, FPoseLink& HandGripLyaer);                                                          // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Skeleton_Preview_AnimBlueprint.Uam_Skeleton_Preview_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Skeleton_Preview_AnimBlueprint.Uam_Skeleton_Preview_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Uam_Skeleton_Preview_AnimBlueprint_AnimGraphNode_LayeredBoneBlend_475C389D415300AD882C23A3738BB9A4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Uam_Skeleton_Preview_AnimBlueprint_AnimGraphNode_LayeredBoneBlend_475C389D415300AD882C23A3738BB9A4(); // [0x3a75280] BlueprintEvent       
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Skeleton_Preview_AnimBlueprint.Uam_Skeleton_Preview_AnimBlueprint_C.ExecuteUbergraph_Uam_Skeleton_Preview_AnimBlueprint
	// void ExecuteUbergraph_Uam_Skeleton_Preview_AnimBlueprint(int32_t EntryPoint);                                            // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/ArtResource/Assets/Equipment/Armor/Meshes/LODSplit/Armor_RBF_AnimBlueprint.Armor_RBF_AnimBlueprint_C
/// Size: 0x09D8 (2520 bytes) (0x0002B8 - 0x000C90) align 16 pad: 0x0000
class UArmor_RBF_AnimBlueprint_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver;                                   // 0x02F8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver0;                                  // 0x0518   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver1;                                  // 0x0738   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver2;                                  // 0x0958   (0x0220)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0B78   (0x0118)  


	/// Functions
	// Function /Game/ArtResource/Assets/Equipment/Armor/Meshes/LODSplit/Armor_RBF_AnimBlueprint.Armor_RBF_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Equipment/Armor/Meshes/LODSplit/Armor_RBF_AnimBlueprint.Armor_RBF_AnimBlueprint_C.ExecuteUbergraph_Armor_RBF_AnimBlueprint
	// void ExecuteUbergraph_Armor_RBF_AnimBlueprint(int32_t EntryPoint);                                                       // [0x3a75280] Final                
};

/// Class /Game/ArtResource/Assets/Avatar/Torso/Meshes/LODSplit/Torso_RBF_AnimBlueprint.Torso_RBF_AnimBlueprint_C
/// Size: 0x1258 (4696 bytes) (0x0002B8 - 0x001510) align 16 pad: 0x0000
class UTorso_RBF_AnimBlueprint_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver;                                   // 0x02F8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver0;                                  // 0x0518   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver1;                                  // 0x0738   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver2;                                  // 0x0958   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver3;                                  // 0x0B78   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver4;                                  // 0x0D98   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver5;                                  // 0x0FB8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver6;                                  // 0x11D8   (0x0220)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x13F8   (0x0118)  


	/// Functions
	// Function /Game/ArtResource/Assets/Avatar/Torso/Meshes/LODSplit/Torso_RBF_AnimBlueprint.Torso_RBF_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Avatar/Torso/Meshes/LODSplit/Torso_RBF_AnimBlueprint.Torso_RBF_AnimBlueprint_C.ExecuteUbergraph_Torso_RBF_AnimBlueprint
	// void ExecuteUbergraph_Torso_RBF_AnimBlueprint(int32_t EntryPoint);                                                       // [0x3a75280] Final                
};

/// Class /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Meta_Facial_AnimBlueprint.Uam_Meta_Facial_AnimBlueprint_C
/// Size: 0x087C (2172 bytes) (0x000B70 - 0x0013EC) align 16 pad: 0x000C
#pragma pack(push, 0x1)
class UUam_Meta_Facial_AnimBlueprint_C : public USGCharacterFacialAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B70   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0B78   (0x0030)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0BA8   (0x00C0)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0C68   (0x01D8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0E40   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend0;                            // 0x0E88   (0x00C0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot1;                                        // 0x0F48   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend2;                            // 0x0F90   (0x00C0)  
	FAnimNode_RefPose                                  AnimGraphNode_LocalRefPose;                                 // 0x1050   (0x0018)  
	FAnimNode_ControlRig                               AnimGraphNode_ControlRig;                                   // 0x1068   (0x0368)  
	bool                                               __CustomProperty_is_anim_input_26BABD694663450CE926709DBDE2280D; // 0x13D0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x13D1   (0x0003)  MISSED
	FVector                                            __CustomProperty_camera_pos_26BABD694663450CE926709DBDE2280D; // 0x13D4   (0x000C)  
	bool                                               __CustomProperty_is_aim_ctrl_26BABD694663450CE926709DBDE2280D; // 0x13E0   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x13E1   (0x0003)  MISSED
	FVector2D                                          __CustomProperty_aim_ctrl_value_26BABD694663450CE926709DBDE2280D; // 0x13E4   (0x0008)  


	/// Functions
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Meta_Facial_AnimBlueprint.Uam_Meta_Facial_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Meta_Facial_AnimBlueprint.Uam_Meta_Facial_AnimBlueprint_C.ExecuteUbergraph_Uam_Meta_Facial_AnimBlueprint
	// void ExecuteUbergraph_Uam_Meta_Facial_AnimBlueprint(int32_t EntryPoint);                                                 // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/ArtResource/Assets/Animation/ControlRig/CR_RigLogic_Head.CR_RigLogic_Head_C
/// Size: 0x0000 (0 bytes) (0x000650 - 0x000650) align 8 pad: 0x0000
class UCR_RigLogic_Head_C : public UControlRig
{ 
public:
};

/// Class /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Meta_Facial_PostProcess_AnimBP.Uam_Meta_Facial_PostProcess_AnimBP_C
/// Size: 0x04B8 (1208 bytes) (0x000B70 - 0x001028) align 16 pad: 0x0008
#pragma pack(push, 0x1)
class UUam_Meta_Facial_PostProcess_AnimBP_C : public USGCharacterFacialAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B70   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0B78   (0x0030)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0BA8   (0x0118)  
	FAnimNode_ControlRig                               AnimGraphNode_ControlRig;                                   // 0x0CC0   (0x0368)  


	/// Functions
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Meta_Facial_PostProcess_AnimBP.Uam_Meta_Facial_PostProcess_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Animation/AnimBlueprints/Uam_Meta_Facial_PostProcess_AnimBP.Uam_Meta_Facial_PostProcess_AnimBP_C.ExecuteUbergraph_Uam_Meta_Facial_PostProcess_AnimBP
	// void ExecuteUbergraph_Uam_Meta_Facial_PostProcess_AnimBP(int32_t EntryPoint);                                            // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/ArtResource/Assets/Equipment/ChestHanging/Meshes/LODSplit/ChestHanging_RBF_AnimBlueprint.ChestHanging_RBF_AnimBlueprint_C
/// Size: 0x09D8 (2520 bytes) (0x0002B8 - 0x000C90) align 16 pad: 0x0000
class UChestHanging_RBF_AnimBlueprint_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver;                                   // 0x02F8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver0;                                  // 0x0518   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver1;                                  // 0x0738   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver2;                                  // 0x0958   (0x0220)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0B78   (0x0118)  


	/// Functions
	// Function /Game/ArtResource/Assets/Equipment/ChestHanging/Meshes/LODSplit/ChestHanging_RBF_AnimBlueprint.ChestHanging_RBF_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Equipment/ChestHanging/Meshes/LODSplit/ChestHanging_RBF_AnimBlueprint.ChestHanging_RBF_AnimBlueprint_C.ExecuteUbergraph_ChestHanging_RBF_AnimBlueprint
	// void ExecuteUbergraph_ChestHanging_RBF_AnimBlueprint(int32_t EntryPoint);                                                // [0x3a75280] Final                
};

/// Class /Game/ArtResource/Assets/Equipment/Backpack/Meshes/LODSplit/Backpack_RBF_AnimBlueprint.Backpack_RBF_AnimBlueprint_C
/// Size: 0x0BF8 (3064 bytes) (0x0002B8 - 0x000EB0) align 16 pad: 0x0000
class UBackpack_RBF_AnimBlueprint_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver;                                   // 0x02F8   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver0;                                  // 0x0518   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver1;                                  // 0x0738   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver2;                                  // 0x0958   (0x0220)  
	FAnimNode_PoseDriver                               AnimGraphNode_PoseDriver3;                                  // 0x0B78   (0x0220)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0D98   (0x0118)  


	/// Functions
	// Function /Game/ArtResource/Assets/Equipment/Backpack/Meshes/LODSplit/Backpack_RBF_AnimBlueprint.Backpack_RBF_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x3a75280] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ArtResource/Assets/Equipment/Backpack/Meshes/LODSplit/Backpack_RBF_AnimBlueprint.Backpack_RBF_AnimBlueprint_C.ExecuteUbergraph_Backpack_RBF_AnimBlueprint
	// void ExecuteUbergraph_Backpack_RBF_AnimBlueprint(int32_t EntryPoint);                                                    // [0x3a75280] Final                
};

static_assert(sizeof(UCA_Body_RBF_AnimBlueprint_C) == 0x6190); // 24976 bytes (0x0002B8 - 0x006190)
