
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: UMG

/// Class /Script/GameletJsEnv.GameletDynamicDelegateProxy
/// Size: 0x0048 (72 bytes) (0x000028 - 0x000070) align 8 pad: 0x0000
class UGameletDynamicDelegateProxy : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x48];                                      // 0x0028   (0x0048)  MISSED


	/// Functions
	// Function /Script/GameletJsEnv.GameletDynamicDelegateProxy.Fire
	// void Fire();                                                                                                             // [0xd906a0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/GameletJsEnv.GameletExtensionMethods
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UGameletExtensionMethods : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/GameletJsEnv.GameletJSAnimGeneratedClass
/// Size: 0x0060 (96 bytes) (0x0005B0 - 0x000610) align 8 pad: 0x0000
class UGameletJSAnimGeneratedClass : public UAnimBlueprintGeneratedClass
{ 
public:
	unsigned char                                      UnknownData00_1[0x60];                                      // 0x05B0   (0x0060)  MISSED
};

/// Class /Script/GameletJsEnv.GameletJSGeneratedClass
/// Size: 0x0060 (96 bytes) (0x000328 - 0x000388) align 8 pad: 0x0000
class UGameletJSGeneratedClass : public UBlueprintGeneratedClass
{ 
public:
	unsigned char                                      UnknownData00_1[0x60];                                      // 0x0328   (0x0060)  MISSED
};

/// Class /Script/GameletJsEnv.GameletJSGeneratedFunction
/// Size: 0x0060 (96 bytes) (0x0000E0 - 0x000140) align 8 pad: 0x0000
class UGameletJSGeneratedFunction : public UFunction
{ 
public:
	unsigned char                                      UnknownData00_1[0x60];                                      // 0x00E0   (0x0060)  MISSED
};

/// Class /Script/GameletJsEnv.GameletJSWidgetGeneratedClass
/// Size: 0x0060 (96 bytes) (0x000368 - 0x0003C8) align 8 pad: 0x0000
class UGameletJSWidgetGeneratedClass : public UWidgetBlueprintGeneratedClass
{ 
public:
	unsigned char                                      UnknownData00_1[0x60];                                      // 0x0368   (0x0060)  MISSED
};

/// Class /Script/GameletJsEnv.GameletTypeScriptBlueprint
/// Size: 0x0000 (0 bytes) (0x0000A0 - 0x0000A0) align 8 pad: 0x0000
class UGameletTypeScriptBlueprint : public UBlueprint
{ 
public:
};

/// Class /Script/GameletJsEnv.GameletTypeScriptGeneratedClass
/// Size: 0x00A0 (160 bytes) (0x000328 - 0x0003C8) align 8 pad: 0x0000
class UGameletTypeScriptGeneratedClass : public UBlueprintGeneratedClass
{ 
public:
	unsigned char                                      UnknownData00_3[0x99];                                      // 0x0328   (0x0099)  MISSED
	bool                                               HasConstructor;                                             // 0x03C1   (0x0001)  
	unsigned char                                      UnknownData01_7[0x6];                                       // 0x03C2   (0x0006)  MISSED
};

/// Class /Script/GameletJsEnv.GameletTypeScriptObject
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UGameletTypeScriptObject : public UInterface
{ 
public:
};

/// Struct /Script/GameletJsEnv.GameletPropertyMetaRoot
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 pad: 0x0000
struct FGameletPropertyMetaRoot
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/GameletJsEnv.GameletArrayBuffer
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FGameletArrayBuffer
{ 
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0000   (0x0018)  MISSED
};

/// Struct /Script/GameletJsEnv.GameletJsObject
/// Size: 0x0060 (96 bytes) (0x000000 - 0x000060) align 8 pad: 0x0000
struct FGameletJsObject
{ 
	unsigned char                                      UnknownData00_2[0x60];                                      // 0x0000   (0x0060)  MISSED
};

static_assert(sizeof(UGameletDynamicDelegateProxy) == 0x0070); // 112 bytes (0x000028 - 0x000070)
static_assert(sizeof(UGameletExtensionMethods) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UGameletJSAnimGeneratedClass) == 0x0610); // 1552 bytes (0x0005B0 - 0x000610)
static_assert(sizeof(UGameletJSGeneratedClass) == 0x0388); // 904 bytes (0x000328 - 0x000388)
static_assert(sizeof(UGameletJSGeneratedFunction) == 0x0140); // 320 bytes (0x0000E0 - 0x000140)
static_assert(sizeof(UGameletJSWidgetGeneratedClass) == 0x03C8); // 968 bytes (0x000368 - 0x0003C8)
static_assert(sizeof(UGameletTypeScriptBlueprint) == 0x00A0); // 160 bytes (0x0000A0 - 0x0000A0)
static_assert(sizeof(UGameletTypeScriptGeneratedClass) == 0x03C8); // 968 bytes (0x000328 - 0x0003C8)
static_assert(sizeof(UGameletTypeScriptObject) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FGameletPropertyMetaRoot) == 0x0001); // 1 bytes (0x000000 - 0x000001)
static_assert(sizeof(FGameletArrayBuffer) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FGameletJsObject) == 0x0060); // 96 bytes (0x000000 - 0x000060)
