
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AkAudio
/// dependency: AnimationBudgetAllocator
/// dependency: AnimGraphRuntime
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: GameplayAbilities
/// dependency: GameplayTags
/// dependency: InputCore
/// dependency: LevelSequence
/// dependency: MediaAssets
/// dependency: MFMobileJoystick
/// dependency: MFPluginWrapper
/// dependency: OBJPool
/// dependency: Paper2D
/// dependency: SGFramework
/// dependency: Slate
/// dependency: SlateCore
/// dependency: UACommon
/// dependency: UADataTableModule
/// dependency: UAGame
/// dependency: UMG

/// Enum /Game/Global/UI/UMG/Common/TabItem/TabHeaderItemState.TabHeaderItemState
/// Size: 0x01 (1 bytes)
enum class TabHeaderItemState : uint8_t
{
	TabHeaderItemState__NewEnumerator0                                               = 0,
	TabHeaderItemState__NewEnumerator1                                               = 1
};

/// Class /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C
/// Size: 0x012C (300 bytes) (0x0002E0 - 0x00040C) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class ABP_BadgeCaptureActorSimple_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	class USpotLightComponent*                         RimLight02_Spot;                                            // 0x02E8   (0x0008)  
	class USpotLightComponent*                         RimLight01_Spot;                                            // 0x02F0   (0x0008)  
	class USpotLightComponent*                         KeyLight_Spot;                                              // 0x02F8   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0300   (0x0008)  
	class USceneCaptureComponent2D*                    SceneCaptureComponent2D;                                    // 0x0308   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0310   (0x0008)  
	SDK_UNDEFINED(80,2598) /* TMap<int32_t, ASGInventory*> */ __um(LoadedBadgeMap);                                // 0x0318   (0x0050)  
	SDK_UNDEFINED(80,2599) /* TMap<int32_t, UMaterialInstanceDynamic*> */ __um(DynamicMatMap);                     // 0x0368   (0x0050)  
	SDK_UNDEFINED(80,2600) /* TMap<int32_t, UMaterialInstance*> */ __um(OriginMatMap);                             // 0x03B8   (0x0050)  
	int32_t                                            badgeId;                                                    // 0x0408   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.PrintCurrentMat
	// void PrintCurrentMat();                                                                                                  // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.GetOriginMat
	// void GetOriginMat(class UMaterialInstance*& originaMat);                                                                 // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.GetDynamicMat
	// void GetDynamicMat(class UMaterialInstanceDynamic*& dynamicMat);                                                         // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.CacheOriginMat
	// void CacheOriginMat(class AActor* Actor, int32_t badgeId);                                                               // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.CacheDynamicMat
	// void CacheDynamicMat();                                                                                                  // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.CacheBadgeInventory
	// void CacheBadgeInventory(int32_t badgeId, class ASGInventory*& Inventory);                                               // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.UpdateStaticMesh
	// void UpdateStaticMesh(class AActor* Actor);                                                                              // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.SetRotation
	// void SetRotation(float rotationX, float rotationY, float rotationZ);                                                     // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.AddRotation
	// void AddRotation(float rotationX, float rotationY, float rotationZ);                                                     // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.ResetRotation
	// void ResetRotation();                                                                                                    // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.UpdateBadgeRTMesh
	// void UpdateBadgeRTMesh(int32_t badgeId, bool SetGray);                                                                   // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.SetCaptureEnable
	// void SetCaptureEnable(bool enable);                                                                                      // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_BadgeCaptureActorSimple.BP_BadgeCaptureActorSimple_C.ExecuteUbergraph_BP_BadgeCaptureActorSimple
	// void ExecuteUbergraph_BP_BadgeCaptureActorSimple(int32_t EntryPoint);                                                    // [0x3a75280] Final|HasDefaults    
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/WareHouse/ItemInspect/TouchTemp.TouchTemp_C
/// Size: 0x0008 (8 bytes) (0x000288 - 0x000290) align 8 pad: 0x0000
class UTouchTemp_C : public UUserWidget
{ 
public:
	class UImage*                                      Image;                                                      // 0x0288   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/WareHouse/ItemInspect/TouchTemp.TouchTemp_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/Blueprints/BP_CameraFocusComponent.BP_CameraFocusComponent_C
/// Size: 0x0074 (116 bytes) (0x0000F8 - 0x00016C) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UBP_CameraFocusComponent_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00F8   (0x0008)  
	bool                                               StartFocus;                                                 // 0x0100   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0101   (0x0003)  MISSED
	FVector                                            TargetFocusPos;                                             // 0x0104   (0x000C)  
	ESGBadgeAttach                                     CurFocusSocket;                                             // 0x0110   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0111   (0x0007)  MISSED
	SDK_UNDEFINED(80,2601) /* TMap<ESGBadgeAttach, FVector> */ __um(FocusSocketPosMap);                            // 0x0118   (0x0050)  
	float                                              FocuSpeed;                                                  // 0x0168   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/Blueprints/BP_CameraFocusComponent.BP_CameraFocusComponent_C.SwitchToCameraStateFocus
	// void SwitchToCameraStateFocus();                                                                                         // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraFocusComponent.BP_CameraFocusComponent_C.FocusOnItem
	// void FocusOnItem(ESGBadgeAttach FocusPos);                                                                               // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraFocusComponent.BP_CameraFocusComponent_C.UpdateCameraAnim
	// void UpdateCameraAnim(float DeltaTime);                                                                                  // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraFocusComponent.BP_CameraFocusComponent_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x3a75280] Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraFocusComponent.BP_CameraFocusComponent_C.ExecuteUbergraph_BP_CameraFocusComponent
	// void ExecuteUbergraph_BP_CameraFocusComponent(int32_t EntryPoint);                                                       // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/FrontEnd/Blueprints/BP_TeamprepareSkyLightController.BP_TeamprepareSkyLightController_C
/// Size: 0x0058 (88 bytes) (0x0002E0 - 0x000338) align 8 pad: 0x0000
class ABP_TeamprepareSkyLightController_C : public AActor
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02E0   (0x0008)  
	SDK_UNDEFINED(80,2602) /* TMap<FString, ASkyLight*> */ __um(SkylightMap);                                      // 0x02E8   (0x0050)  


	/// Functions
	// Function /Game/FrontEnd/Blueprints/BP_TeamprepareSkyLightController.BP_TeamprepareSkyLightController_C.SwitchSkyLight
	// void SwitchSkyLight(FString MapName);                                                                                    // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FrontEnd/Environment/Lobby/SeqTeamUp.SequenceDirector_C
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class USequenceDirector_C : public ULevelSequenceDirector
{ 
public:
};

/// Class /Game/FrontEnd/Blueprints/BP_FrontEndHUD.BP_FrontEndHUD_C
/// Size: 0x0008 (8 bytes) (0x0004E0 - 0x0004E8) align 8 pad: 0x0000
class ABP_FrontEndHUD_C : public ASGHUD
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x04E0   (0x0008)  
};

/// Class /Game/FrontEnd/Blueprints/BP_FrontEndPlayerController.BP_FrontEndPlayerController_C
/// Size: 0x0038 (56 bytes) (0x0008C8 - 0x000900) align 16 pad: 0x0000
class ABP_FrontEndPlayerController_C : public ASGPlayerController
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x08C8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x08D0   (0x0008)  
	class UUAPCUIModeComponent*                        UAPCUIMode;                                                 // 0x08D8   (0x0008)  
	class UCALobbyInputHandleComponent*                CALobbyInputHandle;                                         // 0x08E0   (0x0008)  
	class UUAPCServerCommandComponent*                 UAPCServerCommand;                                          // 0x08E8   (0x0008)  
	class USGPCFOVComponent*                           SGPCFOV;                                                    // 0x08F0   (0x0008)  
	class USGPCLobbyPreviewComponent*                  SGPCLobbyPreview;                                           // 0x08F8   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/Blueprints/BP_FrontEndPlayerController.BP_FrontEndPlayerController_C.InpActEvt_Android_Back_K2Node_InputKeyEvent
	// void InpActEvt_Android_Back_K2Node_InputKeyEvent(FKey Key);                                                              // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/Blueprints/BP_FrontEndPlayerController.BP_FrontEndPlayerController_C.ExecuteUbergraph_BP_FrontEndPlayerController
	// void ExecuteUbergraph_BP_FrontEndPlayerController(int32_t EntryPoint);                                                   // [0x3a75280] Final|HasDefaults    
};

/// Class /Game/FrontEnd/Blueprints/BP_FrontEndPlayerCameraManager.BP_FrontEndPlayerCameraManager_C
/// Size: 0x0000 (0 bytes) (0x002C30 - 0x002C30) align 16 pad: 0x0000
class ABP_FrontEndPlayerCameraManager_C : public APlayerCameraManager
{ 
public:
};

/// Class /Game/FrontEnd/Levels/FrontEndMap.FrontEndMap_C
/// Size: 0x0008 (8 bytes) (0x0002E8 - 0x0002F0) align 8 pad: 0x0000
class AFrontEndMap_C : public ALevelScriptActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E8   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/Levels/FrontEndMap.FrontEndMap_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Levels/FrontEndMap.FrontEndMap_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Levels/FrontEndMap.FrontEndMap_C.ExecuteUbergraph_FrontEndMap
	// void ExecuteUbergraph_FrontEndMap(int32_t EntryPoint);                                                                   // [0x3a75280] Final|HasDefaults    
};

/// Class /Game/FrontEnd/Blueprints/BP_CACineCameraAspectRatioComponent.BP_CACineCameraAspectRatioComponent_C
/// Size: 0x0000 (0 bytes) (0x0000F8 - 0x0000F8) align 8 pad: 0x0000
class UBP_CACineCameraAspectRatioComponent_C : public UActorComponent
{ 
public:


	/// Functions
	// Function /Game/FrontEnd/Blueprints/BP_CACineCameraAspectRatioComponent.BP_CACineCameraAspectRatioComponent_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C
/// Size: 0x0100 (256 bytes) (0x0000F8 - 0x0001F8) align 8 pad: 0x0000
class UBP_CameraAdvancedFocusComponent_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00F8   (0x0008)  
	bool                                               bStartFocus;                                                // 0x0100   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0101   (0x0007)  MISSED
	FString                                            StartFocusName;                                             // 0x0108   (0x0010)  
	FRotator                                           StartRotation;                                              // 0x0118   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0124   (0x0004)  MISSED
	FString                                            TargetFocusName;                                            // 0x0128   (0x0010)  
	FCACameraAdvancedFocus                             TargetFocus;                                                // 0x0138   (0x0018)  
	SDK_UNDEFINED(80,2603) /* TMap<FString, FCACameraAdvancedFocus> */ __um(FocusFocusMap);                        // 0x0150   (0x0050)  
	SDK_UNDEFINED(80,2604) /* TMap<FString, FCACameraChangeArray> */ __um(FocusSpeedMap);                          // 0x01A0   (0x0050)  
	float                                              CurFocuSpeed;                                               // 0x01F0   (0x0004)  
	float                                              CurTotalLength;                                             // 0x01F4   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.GetCameraFocus
	// void GetCameraFocus(FString FocusName, bool& bValid, FCACameraAdvancedFocus& CameraFocus);                               // [0x3a75280] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.FocusFront
	// void FocusFront();                                                                                                       // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.GetStartFocus
	// void GetStartFocus(bool& bStartFocus);                                                                                   // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.UpdateCameraAnim
	// void UpdateCameraAnim(float DeltaTime);                                                                                  // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.SwitchToCameraStateFocus
	// void SwitchToCameraStateFocus();                                                                                         // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.FocusOnItem
	// void FocusOnItem(FString TargetName, float CameraSpeed);                                                                 // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x3a75280] Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_CameraAdvancedFocusComponent.BP_CameraAdvancedFocusComponent_C.ExecuteUbergraph_BP_CameraAdvancedFocusComponent
	// void ExecuteUbergraph_BP_CameraAdvancedFocusComponent(int32_t EntryPoint);                                               // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/Blueprints/BP_FrontEndGameMode.BP_FrontEndGameMode_C
/// Size: 0x0008 (8 bytes) (0x000448 - 0x000450) align 8 pad: 0x0000
class ABP_FrontEndGameMode_C : public ASGGameMode
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0448   (0x0008)  
};

/// Class /Game/FrontEnd/Blueprints/BP_FrontEndSceneInteractionParams.BP_FrontEndSceneInteractionParams_C
/// Size: 0x0110 (272 bytes) (0x0002E0 - 0x0003F0) align 8 pad: 0x0000
class ABP_FrontEndSceneInteractionParams_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02E8   (0x0008)  
	FString                                            CurrentActiveLevel;                                         // 0x02F0   (0x0010)  
	FString                                            CurrentActivePanel;                                         // 0x0300   (0x0010)  
	TArray<class UMediaPlayer*>                        MedisPlayerArray;                                           // 0x0310   (0x0010)  
	class UMaterialInstance*                           AppearanceAvatarShearMatIns;                                // 0x0320   (0x0008)  
	class UMaterialInstance*                           AppearanceAvatarDefaultMatIns;                              // 0x0328   (0x0008)  
	TArray<class AActor*>                              SkyLightActors;                                             // 0x0330   (0x0010)  
	TArray<class AActor*>                              DirectionalLightActors;                                     // 0x0340   (0x0010)  
	SDK_UNDEFINED(80,2605) /* TMap<FName, float> */    __um(PostProcessParam);                                     // 0x0350   (0x0050)  
	SDK_UNDEFINED(80,2606) /* TMap<FString, APostProcessVolume*> */ __um(PostProcessVolumes);                      // 0x03A0   (0x0050)  


	/// Functions
	// Function /Game/FrontEnd/Blueprints/BP_FrontEndSceneInteractionParams.BP_FrontEndSceneInteractionParams_C.SetAppearanceBGToShare
	// void SetAppearanceBGToShare(bool flag, FName Tag);                                                                       // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_FrontEndSceneInteractionParams.BP_FrontEndSceneInteractionParams_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_FrontEndSceneInteractionParams.BP_FrontEndSceneInteractionParams_C.SetActiveLevelNameAndPanelName
	// void SetActiveLevelNameAndPanelName(FString LevelName, FString panelName);                                               // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_FrontEndSceneInteractionParams.BP_FrontEndSceneInteractionParams_C.ReCollectLightActors
	// void ReCollectLightActors();                                                                                             // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_FrontEndSceneInteractionParams.BP_FrontEndSceneInteractionParams_C.SetPostProcessVolumes
	// void SetPostProcessVolumes();                                                                                            // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_FrontEndSceneInteractionParams.BP_FrontEndSceneInteractionParams_C.ExecuteUbergraph_BP_FrontEndSceneInteractionParams
	// void ExecuteUbergraph_BP_FrontEndSceneInteractionParams(int32_t EntryPoint);                                             // [0x3a75280] Final|HasDefaults    
};

/// Class /Game/FrontEnd/Blueprints/BP_PostProcessTransController.BP_PostProcessTransController_C
/// Size: 0x0061 (97 bytes) (0x0002E0 - 0x000341) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class ABP_PostProcessTransController_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02E8   (0x0008)  
	float                                              TimeLine_Stary_OffsetLengthX_EBF04E494CB84408A5137A8A26FA6A4E; // 0x02F0   (0x0004)  
	float                                              TimeLine_Stary_BlackSence_EBF04E494CB84408A5137A8A26FA6A4E; // 0x02F4   (0x0004)  
	float                                              TimeLine_Stary_SigmaX_EBF04E494CB84408A5137A8A26FA6A4E;     // 0x02F8   (0x0004)  
	float                                              TimeLine_Stary_FrameIndex_EBF04E494CB84408A5137A8A26FA6A4E; // 0x02FC   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    TimeLine_Stary__Direction_EBF04E494CB84408A5137A8A26FA6A4E; // 0x0300   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0301   (0x0007)  MISSED
	class UTimelineComponent*                          TimeLine_Stary;                                             // 0x0308   (0x0008)  
	float                                              Timeline_End_OffsetLengthX_9E59434E424217054553099A36D39DDF; // 0x0310   (0x0004)  
	float                                              Timeline_End_BlackSence_9E59434E424217054553099A36D39DDF;   // 0x0314   (0x0004)  
	float                                              Timeline_End_SigmaX_9E59434E424217054553099A36D39DDF;       // 0x0318   (0x0004)  
	float                                              Timeline_End_FrameIndex_9E59434E424217054553099A36D39DDF;   // 0x031C   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_End__Direction_9E59434E424217054553099A36D39DDF;   // 0x0320   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0321   (0x0007)  MISSED
	class UTimelineComponent*                          Timeline_End;                                               // 0x0328   (0x0008)  
	class UMaterialInstance*                           transition_Inst;                                            // 0x0330   (0x0008)  
	class UMaterialInstanceDynamic*                    DynamicMatiInst;                                            // 0x0338   (0x0008)  
	bool                                               CanTrans;                                                   // 0x0340   (0x0001)  


	/// Functions
	// Function /Game/FrontEnd/Blueprints/BP_PostProcessTransController.BP_PostProcessTransController_C.TimeLine_Stary__FinishedFunc
	// void TimeLine_Stary__FinishedFunc();                                                                                     // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/Blueprints/BP_PostProcessTransController.BP_PostProcessTransController_C.TimeLine_Stary__UpdateFunc
	// void TimeLine_Stary__UpdateFunc();                                                                                       // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/Blueprints/BP_PostProcessTransController.BP_PostProcessTransController_C.Timeline_End__FinishedFunc
	// void Timeline_End__FinishedFunc();                                                                                       // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/Blueprints/BP_PostProcessTransController.BP_PostProcessTransController_C.Timeline_End__UpdateFunc
	// void Timeline_End__UpdateFunc();                                                                                         // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/Blueprints/BP_PostProcessTransController.BP_PostProcessTransController_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_PostProcessTransController.BP_PostProcessTransController_C.PlayTranslation
	// void PlayTranslation(bool IsReverse);                                                                                    // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Blueprints/BP_PostProcessTransController.BP_PostProcessTransController_C.ExecuteUbergraph_BP_PostProcessTransController
	// void ExecuteUbergraph_BP_PostProcessTransController(int32_t EntryPoint);                                                 // [0x3a75280] Final|HasDefaults    
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C
/// Size: 0x014C (332 bytes) (0x000288 - 0x0003D4) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UBP_LoadingEntLobby_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            EarthAnimation;                                             // 0x0290   (0x0008)  
	class UWidgetAnimation*                            LoopLoadingAnimation;                                       // 0x0298   (0x0008)  
	class UWidgetAnimation*                            CloseAnimationForce;                                        // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x02A8   (0x0008)  
	class UImage*                                      Ani_FX_Noise_01;                                            // 0x02B0   (0x0008)  
	class UImage*                                      Ani_FX_Noise_Line;                                          // 0x02B8   (0x0008)  
	class UImage*                                      Ani_FX_Noise_Line_02;                                       // 0x02C0   (0x0008)  
	class UImage*                                      Ani_FX_Noise_Line_gd;                                       // 0x02C8   (0x0008)  
	class UImage*                                      Ani_FX_Noise_SD;                                            // 0x02D0   (0x0008)  
	class UImage*                                      Ani_Loop;                                                   // 0x02D8   (0x0008)  
	class UImage*                                      Ani_Sin;                                                    // 0x02E0   (0x0008)  
	class UImage*                                      Ani_Sin_02;                                                 // 0x02E8   (0x0008)  
	class UImage*                                      bg;                                                         // 0x02F0   (0x0008)  
	class UDecorateBig_HD_C*                           Decorate_HD;                                                // 0x02F8   (0x0008)  
	class UImage*                                      FX;                                                         // 0x0300   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0308   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0310   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x0318   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x0320   (0x0008)  
	class UTextBlock*                                  LoadingTimeText;                                            // 0x0328   (0x0008)  
	class UCanvasPanel*                                NewPlayerTips;                                              // 0x0330   (0x0008)  
	class UTextBlock*                                  ProgressText;                                               // 0x0338   (0x0008)  
	class UTextBlock*                                  ProgressText3;                                              // 0x0340   (0x0008)  
	class UTextBlock*                                  TipsText;                                                   // 0x0348   (0x0008)  
	class UUATypeWriterText_HD_C*                      UATypeWriterText_HD;                                        // 0x0350   (0x0008)  
	class UTextBlock*                                  UpdateText;                                                 // 0x0358   (0x0008)  
	SDK_UNDEFINED(80,2607) /* TMap<int32_t, FString> */ __um(TextTipsList);                                        // 0x0360   (0x0050)  
	class USGPCFlowControlComponent*                   PCFlowComponent;                                            // 0x03B0   (0x0008)  
	class APlayerController*                           PlayerController;                                           // 0x03B8   (0x0008)  
	FName                                              PlayerFlowState;                                            // 0x03C0   (0x0008)  
	bool                                               BeginFlowState;                                             // 0x03C8   (0x0001)  
	bool                                               bPlayLoopAnim;                                              // 0x03C9   (0x0001)  
	bool                                               bBeginState;                                                // 0x03CA   (0x0001)  
	bool                                               bCloseState;                                                // 0x03CB   (0x0001)  
	bool                                               bCloseStateBegin;                                           // 0x03CC   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x03CD   (0x0003)  MISSED
	float                                              mTime;                                                      // 0x03D0   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.SequenceEvent__ENTRYPOINTBP_LoadingEntLobby_HD
	// void SequenceEvent__ENTRYPOINTBP_LoadingEntLobby_HD();                                                                   // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.GetPCFlowComponent
	// void GetPCFlowComponent();                                                                                               // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.CheckState
	// void CheckState();                                                                                                       // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.Startplayloop
	// void Startplayloop();                                                                                                    // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.Construct
	// void Construct();                                                                                                        // [0x2c6ec20] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.CloseWidget
	// void CloseWidget(bool Force);                                                                                            // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.SequenceEvent_BeginLoading
	// void SequenceEvent_BeginLoading();                                                                                       // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.RemoveAnimation
	// void RemoveAnimation();                                                                                                  // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.SequenceEvent_LoopLoading
	// void SequenceEvent_LoopLoading();                                                                                        // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/LoadingEntLobby/BP_LoadingEntLobby_HD.BP_LoadingEntLobby_HD_C.ExecuteUbergraph_BP_LoadingEntLobby_HD
	// void ExecuteUbergraph_BP_LoadingEntLobby_HD(int32_t EntryPoint);                                                         // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/FrontEnd/Levels/AvatarUILevel.AvatarUILevel_C
/// Size: 0x0010 (16 bytes) (0x0002E8 - 0x0002F8) align 8 pad: 0x0000
class AAvatarUILevel_C : public ALevelScriptActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E8   (0x0008)  
	class AActor*                                      None_ExecuteUbergraph_AvatarUILevel_RefProperty;            // 0x02F0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/Levels/AvatarUILevel.AvatarUILevel_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Levels/AvatarUILevel.AvatarUILevel_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Levels/AvatarUILevel.AvatarUILevel_C.ExecuteUbergraph_AvatarUILevel
	// void ExecuteUbergraph_AvatarUILevel(int32_t EntryPoint);                                                                 // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/Levels/TeamUpModelSelectLevel.TeamUpModelSelectLevel02_C
/// Size: 0x0010 (16 bytes) (0x0002E8 - 0x0002F8) align 8 pad: 0x0000
class ATeamUpModelSelectLevel02_C : public ALevelScriptActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E8   (0x0008)  
	class UMediaPlayer*                                MainUI_Backdrop;                                            // 0x02F0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/Levels/TeamUpModelSelectLevel.TeamUpModelSelectLevel02_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Levels/TeamUpModelSelectLevel.TeamUpModelSelectLevel02_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/Levels/TeamUpModelSelectLevel.TeamUpModelSelectLevel02_C.ExecuteUbergraph_TeamUpModelSelectLevel
	// void ExecuteUbergraph_TeamUpModelSelectLevel(int32_t EntryPoint);                                                        // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/Levels/InformationLevel.InformationLevel_C
/// Size: 0x0000 (0 bytes) (0x0002E8 - 0x0002E8) align 8 pad: 0x0000
class AInformationLevel_C : public ALevelScriptActor
{ 
public:
};

/// Class /Game/FrontEnd/Levels/TeamPrepare.TeamPrepare_C
/// Size: 0x0008 (8 bytes) (0x0002E8 - 0x0002F0) align 8 pad: 0x0000
class ATeamPrepare_C : public ALevelScriptActor
{ 
public:
	class ACameraActor*                                CameraActor;                                                // 0x02E8   (0x0008)  
};

/// Class /Game/FrontEnd/Environment/Lobby/AvatarUI_01.SequenceDirector_C
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class USequenceDirector_Cdup_0 : public ULevelSequenceDirector
{ 
public:
};

/// Class /Game/FrontEnd/Levels/WeaponBuild/ToBuildMode.SequenceDirector_C
/// Size: 0x0008 (8 bytes) (0x000030 - 0x000038) align 8 pad: 0x0000
class USequenceDirector_Cdup_1 : public ULevelSequenceDirector
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0030   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/Levels/WeaponBuild/ToBuildMode.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector
	// void SequenceEvent__ENTRYPOINTSequenceDirector(class ARenderViewEnv_HD_C* RenderViewEnv);                                // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Levels/WeaponBuild/ToBuildMode.SequenceDirector_C.RenderViewEnv_ToBuildFinished
	// void RenderViewEnv_ToBuildFinished(class ARenderViewEnv_HD_C* RenderViewEnv);                                            // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/Levels/WeaponBuild/ToBuildMode.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
	// void ExecuteUbergraph_SequenceDirector(int32_t EntryPoint);                                                              // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/WareHouse/ItemInspect/CAAssembleEnvironment_Uam.CAAssembleEnvironment_Uam_C
/// Size: 0x0058 (88 bytes) (0x0008D0 - 0x000928) align 16 pad: 0x0008
#pragma pack(push, 0x1)
class ACAAssembleEnvironment_Uam_C : public ACAAssembleEnvironment
{ 
public:
	class USkeletalMeshComponent*                      BaseMesh1;                                                  // 0x08D0   (0x0008)  
	class URectLightComponent*                         RectLight1;                                                 // 0x08D8   (0x0008)  
	class URectLightComponent*                         RectLight;                                                  // 0x08E0   (0x0008)  
	class USpotLightComponent*                         SpotLight4;                                                 // 0x08E8   (0x0008)  
	class USpotLightComponent*                         SpotLight3;                                                 // 0x08F0   (0x0008)  
	class USceneCaptureComponent2D*                    SceneCaptureComponent2D;                                    // 0x08F8   (0x0008)  
	class USceneComponent*                             Pivot;                                                      // 0x0900   (0x0008)  
	class USceneComponent*                             RotateBase;                                                 // 0x0908   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0910   (0x0008)  
	class USkeletalMeshComponent*                      BaseMesh;                                                   // 0x0918   (0x0008)  
	class USceneComponent*                             Scene;                                                      // 0x0920   (0x0008)  
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/Tooltips/ToolTipWidgetContent_Tip_HD.ToolTipWidgetContent_Tip_HD_C
/// Size: 0x0078 (120 bytes) (0x000288 - 0x000300) align 8 pad: 0x0000
class UToolTipWidgetContent_Tip_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UCanvasPanel*                                CanvasPanel_Movable;                                        // 0x0290   (0x0008)  
	class UHorizontalBox*                              HorizontalBox;                                              // 0x0298   (0x0008)  
	class UHorizontalBox*                              HorizontalBox_NormalTips;                                   // 0x02A0   (0x0008)  
	class UOverlay*                                    Overlay;                                                    // 0x02A8   (0x0008)  
	class URichTextBlock*                              RichTextBlock;                                              // 0x02B0   (0x0008)  
	class UShortcutKey_HD_C*                           ShortcutKey;                                                // 0x02B8   (0x0008)  
	class URichTextBlock*                              Text;                                                       // 0x02C0   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02C8   (0x0008)  
	class URichTextBlock*                              TextBlock0;                                                 // 0x02D0   (0x0008)  
	class UTextBlock*                                  TextBlock1;                                                 // 0x02D8   (0x0008)  
	class UTextBlock*                                  TextBlock_action;                                           // 0x02E0   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x02E8   (0x0008)  
	bool                                               VisiabilitySelf;                                            // 0x02F0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02F1   (0x0003)  MISSED
	float                                              ShowSelfDelayTime;                                          // 0x02F4   (0x0004)  
	bool                                               FollowingMouse;                                             // 0x02F8   (0x0001)  
	bool                                               UseWidgetSwitcher;                                          // 0x02F9   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x02FA   (0x0002)  MISSED
	int32_t                                            SwitcherIndex;                                              // 0x02FC   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Tooltips/ToolTipWidgetContent_Tip_HD.ToolTipWidgetContent_Tip_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/Tooltips/ToolTipWidgetContent_Tip_HD.ToolTipWidgetContent_Tip_HD_C.SetParamData
	// void SetParamData(FText Text1, FText Text2, bool Visiable, float ShowSelfDelayTime, FText ActionTip);                    // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Tooltips/ToolTipWidgetContent_Tip_HD.ToolTipWidgetContent_Tip_HD_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Tooltips/ToolTipWidgetContent_Tip_HD.ToolTipWidgetContent_Tip_HD_C.Construct
	// void Construct();                                                                                                        // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Tooltips/ToolTipWidgetContent_Tip_HD.ToolTipWidgetContent_Tip_HD_C.ExecuteUbergraph_ToolTipWidgetContent_Tip_HD
	// void ExecuteUbergraph_ToolTipWidgetContent_Tip_HD(int32_t EntryPoint);                                                   // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C
/// Size: 0x0C18 (3096 bytes) (0x0002B0 - 0x000EC8) align 8 pad: 0x0000
class UCellItemTemplate_HD_C : public UGeoSensitiveWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            Dropit;                                                     // 0x02B8   (0x0008)  
	class UWidgetAnimation*                            PickUp;                                                     // 0x02C0   (0x0008)  
	class UImage*                                      bg;                                                         // 0x02C8   (0x0008)  
	class UImage*                                      DefaultBorder;                                              // 0x02D0   (0x0008)  
	class UHorizontalBox*                              DurabilityBox;                                              // 0x02D8   (0x0008)  
	class URichTextBlock*                              DurabilityText_Left;                                        // 0x02E0   (0x0008)  
	class URichTextBlock*                              DurabilityText_Right;                                       // 0x02E8   (0x0008)  
	class URichTextBlock*                              DurabilityText_Split;                                       // 0x02F0   (0x0008)  
	class UNamedSlot*                                  ExtraContent;                                               // 0x02F8   (0x0008)  
	class UHorizontalBox*                              HorizontalBox_ItemName;                                     // 0x0300   (0x0008)  
	class UHorizontalBox*                              HorizontalBox_TopRight;                                     // 0x0308   (0x0008)  
	class UCAImage*                                    icon;                                                       // 0x0310   (0x0008)  
	class UScaleBox*                                   IconScaleBox;                                               // 0x0318   (0x0008)  
	class UImage*                                      Image_RelateBGFrame;                                        // 0x0320   (0x0008)  
	class UImage*                                      Image_WareHouseBG;                                          // 0x0328   (0x0008)  
	class UTextBlock*                                  ItemName;                                                   // 0x0330   (0x0008)  
	class UCanvasPanel*                                ParentCanvas;                                               // 0x0338   (0x0008)  
	class UCanvasPanel*                                SecondaryCanvas;                                            // 0x0340   (0x0008)  
	class UScaleBox*                                   ShadowScaleBox;                                             // 0x0348   (0x0008)  
	class UVerticalBox*                                VerticalBox_Down;                                           // 0x0350   (0x0008)  
	class UVerticalBox*                                VerticalBox_LeftDown;                                       // 0x0358   (0x0008)  
	class UVerticalBox*                                VerticalBox_LefUp;                                          // 0x0360   (0x0008)  
	bool                                               ShowItemName;                                               // 0x0368   (0x0001)  
	bool                                               ShowItemLongName;                                           // 0x0369   (0x0001)  
	bool                                               ShowSecondaryInfo;                                          // 0x036A   (0x0001)  
	bool                                               ShowAccessoryIcon;                                          // 0x036B   (0x0001)  
	bool                                               ShowInsuranceStatus;                                        // 0x036C   (0x0001)  
	bool                                               ShowBorder;                                                 // 0x036D   (0x0001)  
	bool                                               ShowDurability;                                             // 0x036E   (0x0001)  
	bool                                               ShowColor;                                                  // 0x036F   (0x0001)  
	bool                                               ShowStatusColor;                                            // 0x0370   (0x0001)  
	bool                                               ShowRotateStatus;                                           // 0x0371   (0x0001)  
	bool                                               ShowIconShadow;                                             // 0x0372   (0x0001)  
	bool                                               ShowCornor;                                                 // 0x0373   (0x0001)  
	bool                                               CustomSize;                                                 // 0x0374   (0x0001)  
	bool                                               SmallIconMode;                                              // 0x0375   (0x0001)  
	bool                                               UseBigIconPriority;                                         // 0x0376   (0x0001)  
	bool                                               ShowNestedAccessoryRender;                                  // 0x0377   (0x0001)  
	bool                                               HasSpecialPadding;                                          // 0x0378   (0x0001)  
	bool                                               UseOldRuleScale;                                            // 0x0379   (0x0001)  
	bool                                               ShowLockImage;                                              // 0x037A   (0x0001)  
	bool                                               ShowBlackIcon;                                              // 0x037B   (0x0001)  
	bool                                               ShowCantSellIcon;                                           // 0x037C   (0x0001)  
	bool                                               ShowFactionIcon;                                            // 0x037D   (0x0001)  
	bool                                               ShowDarkIcon;                                               // 0x037E   (0x0001)  
	bool                                               ShowBottomColor;                                            // 0x037F   (0x0001)  
	bool                                               ShowArmorLevel;                                             // 0x0380   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0381   (0x0007)  MISSED
	FSlateBrush                                        BGSlateBrush;                                               // 0x0388   (0x0090)  
	FLinearColor                                       Color_Gun;                                                  // 0x0418   (0x0010)  
	FLinearColor                                       Color_Accessory;                                            // 0x0428   (0x0010)  
	FLinearColor                                       Color_Magazine_Ammo;                                        // 0x0438   (0x0010)  
	FLinearColor                                       Color_Drug_Food;                                            // 0x0448   (0x0010)  
	FLinearColor                                       Color_Bags;                                                 // 0x0458   (0x0010)  
	FLinearColor                                       Color_Others;                                               // 0x0468   (0x0010)  
	FLinearColor                                       Color_Unusable;                                             // 0x0478   (0x0010)  
	FSlateColor                                        Color_Selected_Text;                                        // 0x0488   (0x0028)  
	FSlateColor                                        Color_Unselected_Text;                                      // 0x04B0   (0x0028)  
	FSlateColor                                        Color_UnuseTextColor;                                       // 0x04D8   (0x0028)  
	FSlateColor                                        Color_DurabilityColor;                                      // 0x0500   (0x0028)  
	FLinearColor                                       Color_UnOperable;                                           // 0x0528   (0x0010)  
	FLinearColor                                       Color_Currency;                                             // 0x0538   (0x0010)  
	FLinearColor                                       Color_Insert;                                               // 0x0548   (0x0010)  
	FLinearColor                                       Color_Empty;                                                // 0x0558   (0x0010)  
	FLinearColor                                       Color_RelateBGUnuse;                                        // 0x0568   (0x0010)  
	FLinearColor                                       Color_RelateBG;                                             // 0x0578   (0x0010)  
	FLinearColor                                       Color_Operable;                                             // 0x0588   (0x0010)  
	class UObject*                                     DefaultImage;                                               // 0x0598   (0x0008)  
	int32_t                                            Gun_Width_Padding;                                          // 0x05A0   (0x0004)  
	int32_t                                            Gun_Height_Padding;                                         // 0x05A4   (0x0004)  
	int32_t                                            Pistol_Accessory_Width_Padding;                             // 0x05A8   (0x0004)  
	int32_t                                            Pistol_Accessory_Height_Padding;                            // 0x05AC   (0x0004)  
	float                                              Other_Padding_Percent;                                      // 0x05B0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x05B4   (0x0004)  MISSED
	FSlateColor                                        DurabilityInfoColorMedicine;                                // 0x05B8   (0x0028)  
	FSlateFontInfo                                     SetItemName;                                                // 0x05E0   (0x0058)  
	FSlateColor                                        SetItemNameColor;                                           // 0x0638   (0x0028)  
	FSlateColor                                        SetSecondaryInfoColor;                                      // 0x0660   (0x0028)  
	FSlateFontInfo                                     SetSecondaryInfo;                                           // 0x0688   (0x0058)  
	FSlateFontInfo                                     SetNum;                                                     // 0x06E0   (0x0058)  
	FSlateColor                                        SetNumColor;                                                // 0x0738   (0x0028)  
	class UUserWidget*                                 DirExtendWidget;                                            // 0x0760   (0x0008)  
	class UUserWidget*                                 AssembleWidget;                                             // 0x0768   (0x0008)  
	class UImage*                                      OperateBGColor;                                             // 0x0770   (0x0008)  
	FSlateBrush                                        RelateBGBrush;                                              // 0x0778   (0x0090)  
	FSlateBrush                                        RelateIconBrush;                                            // 0x0808   (0x0090)  
	class UUserWidget*                                 HotKey;                                                     // 0x0898   (0x0008)  
	class UImage*                                      RelateIcon;                                                 // 0x08A0   (0x0008)  
	FMargin                                            RelateIconMargin;                                           // 0x08A8   (0x0010)  
	class UImage*                                      IconShadow;                                                 // 0x08B8   (0x0008)  
	class UImage*                                      Insurance_Border;                                           // 0x08C0   (0x0008)  
	class UImage*                                      Insurance_Icon;                                             // 0x08C8   (0x0008)  
	class UImage*                                      Selected_BG;                                                // 0x08D0   (0x0008)  
	class UUserWidget*                                 NewItemMark;                                                // 0x08D8   (0x0008)  
	FSlateBrush                                        CommitTaskFlagBrush;                                        // 0x08E0   (0x0090)  
	TArray<class UImage*>                              bottomLeftIcons;                                            // 0x0970   (0x0010)  
	class UClass*                                      ImageType;                                                  // 0x0980   (0x0008)  
	class UTextBlock*                                  SecondaryInfo;                                              // 0x0988   (0x0008)  
	FSlateBrush                                        ExpireTimeFlagBrush;                                        // 0x0990   (0x0090)  
	FSlateBrush                                        BlackIconBrush;                                             // 0x0A20   (0x0090)  
	FSlateBrush                                        EquipmentLockImgBrush;                                      // 0x0AB0   (0x0090)  
	FSlateBrush                                        ArmorIconBrush;                                             // 0x0B40   (0x0090)  
	class UTextBlock*                                  debugItemID;                                                // 0x0BD0   (0x0008)  
	class UUserWidget*                                 TwinkingWidget;                                             // 0x0BD8   (0x0008)  
	class UImage*                                      OperateIcon;                                                // 0x0BE0   (0x0008)  
	class UObject*                                     lastLoadedIcon;                                             // 0x0BE8   (0x0008)  
	FLinearColor                                       UnuseableColor;                                             // 0x0BF0   (0x0010)  
	class UImage*                                      RelateBG;                                                   // 0x0C00   (0x0008)  
	class UUserWidget*                                 NewInspectorText;                                           // 0x0C08   (0x0008)  
	bool                                               ShowNewInspector;                                           // 0x0C10   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0C11   (0x0007)  MISSED
	class UMaterialInstanceDynamic*                    dynamicMat;                                                 // 0x0C18   (0x0008)  
	int32_t                                            SpecialPadding;                                             // 0x0C20   (0x0004)  
	float                                              SpecialPaddingScale;                                        // 0x0C24   (0x0004)  
	class UClass*                                      ToolTipTextClass;                                           // 0x0C28   (0x0008)  
	FText                                              ToolTipWidgetText;                                          // 0x0C30   (0x0018)  
	bool                                               ShowToolTipsText;                                           // 0x0C48   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x0C49   (0x0003)  MISSED
	FVector2D                                          BottomLeftPosOffset;                                        // 0x0C4C   (0x0008)  
	FMargin                                            Override_SeconderyInfoPadding;                              // 0x0C54   (0x0010)  
	FMargin                                            BGOffset;                                                   // 0x0C64   (0x0010)  
	FMargin                                            Override_ItemName;                                          // 0x0C74   (0x0010)  
	FMargin                                            Override_Durability;                                        // 0x0C84   (0x0010)  
	FMargin                                            SecondaryInfo_offsets;                                      // 0x0C94   (0x0010)  
	bool                                               IsEquip;                                                    // 0x0CA4   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0CA5   (0x0003)  MISSED
	FVector2D                                          BlackIconOffset;                                            // 0x0CA8   (0x0008)  
	FSlateBrush                                        CantSellBrush;                                              // 0x0CB0   (0x0090)  
	FVector2D                                          ArmorIconOffset;                                            // 0x0D40   (0x0008)  
	FMargin                                            Override_ArmorSeconderyInfoPadding;                         // 0x0D48   (0x0010)  
	bool                                               OnlyShowDurabilityMaxText;                                  // 0x0D58   (0x0001)  
	unsigned char                                      UnknownData05_6[0x3];                                       // 0x0D59   (0x0003)  MISSED
	float                                              TooltipsDelayTime;                                          // 0x0D5C   (0x0004)  
	FAnchorData                                        DurabilityLayout;                                           // 0x0D60   (0x0028)  
	FSlateColor                                        Color_BbodyArmor;                                           // 0x0D88   (0x0028)  
	FSlateColor                                        Color_RelateBGCanPlaceContainer;                            // 0x0DB0   (0x0028)  
	class UImage*                                      CornorIcon;                                                 // 0x0DD8   (0x0008)  
	bool                                               CollapsedTwinking;                                          // 0x0DE0   (0x0001)  
	bool                                               ShowTaskIcon;                                               // 0x0DE1   (0x0001)  
	unsigned char                                      UnknownData06_6[0x6];                                       // 0x0DE2   (0x0006)  MISSED
	FString                                            ActionTips;                                                 // 0x0DE8   (0x0010)  
	FSlateFontInfo                                     LargeFont;                                                  // 0x0DF8   (0x0058)  
	FSlateFontInfo                                     SmallFont;                                                  // 0x0E50   (0x0058)  
	class UImage*                                      BottomColor;                                                // 0x0EA8   (0x0008)  
	float                                              BottomColorHight;                                           // 0x0EB0   (0x0004)  
	TEnumAsByte<EHorizontalAlignment>                  In_Horizontal_Alignment;                                    // 0x0EB4   (0x0001)  
	bool                                               UseBigDurabilityFont;                                       // 0x0EB5   (0x0001)  
	unsigned char                                      UnknownData07_6[0x2];                                       // 0x0EB6   (0x0002)  MISSED
	FMargin                                            HotKeyPadding;                                              // 0x0EB8   (0x0010)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachBottomColor
	// void AttachBottomColor();                                                                                                // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.GetCommonTips
	// void GetCommonTips(class UClass* TooltipClass, class UUserWidget*& userWideget);                                         // [0x2c6ec20] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.SetAsDrag
	// void SetAsDrag(bool isDrag);                                                                                             // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachCornorIcon
	// void AttachCornorIcon();                                                                                                 // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.SetWidgetLayout
	// void SetWidgetLayout(class UWidget* Widget, FVector2D Minimum, FVector2D Maximum, FVector2D Alignment);                  // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.SetToolTopWidgetText
	// void SetToolTopWidgetText(class UToolTipWidgetContent_Tip_HD_C*& AsToolTipWidgetContentTipHD);                           // [0x3a75280] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.UpdateIcon
	// void UpdateIcon(bool isInspector, class UObject* Tex);                                                                   // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.IsDefaultImage
	// bool IsDefaultImage();                                                                                                   // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.CreateNewInspectorText
	// void CreateNewInspectorText();                                                                                           // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.SetAsSmallIconMode
	// void SetAsSmallIconMode(bool status, float iconSizeScale);                                                               // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.RefreshSetData
	// void RefreshSetData(bool is_rotate, class UCanvasPanelSlot* CanvasSlot, float SizeX, float SizeY, FText ItemName, bool durabilityShowing, bool maxDurabilityShowing, FText theDurabilityTextLeft, FText theDurabilityTextSplit, FText theDurabilityTextRight, bool usable, FLinearColor BGColor, bool ShowNewInspector, bool& out_is_rotate); // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.ResetWidget
	// void ResetWidget(class UObject*& DefaultImage);                                                                          // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachOperateIcon
	// void AttachOperateIcon();                                                                                                // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachHotKey
	// void AttachHotKey();                                                                                                     // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachRelateIcon
	// void AttachRelateIcon();                                                                                                 // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachTwinking
	// void AttachTwinking();                                                                                                   // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachDebugItemID
	// void AttachDebugItemID();                                                                                                // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.CreateSecondaryInfoText
	// void CreateSecondaryInfoText();                                                                                          // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.SetBottomLeftWidgetPos
	// void SetBottomLeftWidgetPos(class UWidget* Widget, float Left, float Top, bool Condition, float Right, float Bottom);    // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.CreateBottomLeftIcon
	// void CreateBottomLeftIcon();                                                                                             // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachSelectedBG
	// void AttachSelectedBG();                                                                                                 // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachInsuranceIcon
	// void AttachInsuranceIcon(bool hasDurability);                                                                            // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachInsuranceBorder
	// void AttachInsuranceBorder();                                                                                            // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachShadowIcon
	// void AttachShadowIcon();                                                                                                 // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachAssembleItem
	// void AttachAssembleItem();                                                                                               // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachIcon
	// void AttachIcon(FString IconWidgetName, int32_t ZOrder);                                                                 // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachNewItemMark
	// void AttachNewItemMark(bool& Succeed);                                                                                   // [0x3a75280] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.AttachExtendDir
	// void AttachExtendDir();                                                                                                  // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.GetSelfSize
	// void GetSelfSize(FVector2D& Size);                                                                                       // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.InitTemplate
	// void InitTemplate();                                                                                                     // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.ConvertToVisbility
	// void ConvertToVisbility(bool Visable, ESlateVisibility& visbility);                                                      // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.BP_OnEntryReleased
	// void BP_OnEntryReleased();                                                                                               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.BP_OnItemExpansionChanged
	// void BP_OnItemExpansionChanged(bool bIsExpanded);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.BP_OnItemSelectionChanged
	// void BP_OnItemSelectionChanged(bool bIsSelected);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.Refresh
	// void Refresh();                                                                                                          // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/CellItemTemplate_HD.CellItemTemplate_HD_C.ExecuteUbergraph_CellItemTemplate_HD
	// void ExecuteUbergraph_CellItemTemplate_HD(int32_t EntryPoint);                                                           // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/WareHouse/Control/FrontEndDragItem_HD.FrontEndDragItem_HD_C
/// Size: 0x0050 (80 bytes) (0x000288 - 0x0002D8) align 8 pad: 0x0000
class UFrontEndDragItem_HD_C : public UUserWidget
{ 
public:
	class UCanvasPanel*                                CanvasPanel_Movable;                                        // 0x0288   (0x0008)  
	class UCellItemTemplate_HD_C*                      CellItemTemplate;                                           // 0x0290   (0x0008)  
	class UIncompatibleTips_HD_C*                      IncompatibleTips_HD;                                        // 0x0298   (0x0008)  
	class UCanvasPanel*                                PanelScale;                                                 // 0x02A0   (0x0008)  
	class UCanvasPanel*                                RollUp_Tips;                                                // 0x02A8   (0x0008)  
	class UCanvasPanel*                                RotateUp_Tips;                                              // 0x02B0   (0x0008)  
	class UCanvasPanel*                                Sell_Tips;                                                  // 0x02B8   (0x0008)  
	class UShortcutKeyWithIcon_HD_C*                   ShortcutKeyWithIcon_HD;                                     // 0x02C0   (0x0008)  
	class UTextBlock*                                  Text;                                                       // 0x02C8   (0x0008)  
	class UCanvasPanel*                                UnFold_Tips;                                                // 0x02D0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/WareHouse/Control/FrontEndDragItem_HD.FrontEndDragItem_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/Chat/ChatPanel/ShortcutChatPanel.ShortcutChatPanel_C
/// Size: 0x0018 (24 bytes) (0x000288 - 0x0002A0) align 8 pad: 0x0000
class UShortcutChatPanel_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UTextBlock*                                  Text;                                                       // 0x0290   (0x0008)  
	class UUAButton_C*                                 UAButton;                                                   // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/ShortcutChatPanel.ShortcutChatPanel_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/ShortcutChatPanel.ShortcutChatPanel_C.BP_OnEntryReleased
	// void BP_OnEntryReleased();                                                                                               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/ShortcutChatPanel.ShortcutChatPanel_C.BP_OnItemExpansionChanged
	// void BP_OnItemExpansionChanged(bool bIsExpanded);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/ShortcutChatPanel.ShortcutChatPanel_C.BP_OnItemSelectionChanged
	// void BP_OnItemSelectionChanged(bool bIsSelected);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/ShortcutChatPanel.ShortcutChatPanel_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/ShortcutChatPanel.ShortcutChatPanel_C.ExecuteUbergraph_ShortcutChatPanel
	// void ExecuteUbergraph_ShortcutChatPanel(int32_t EntryPoint);                                                             // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/Mall/MallPanel/MallAdvItem_HD.MallAdvItem_HD_C
/// Size: 0x0018 (24 bytes) (0x000288 - 0x0002A0) align 8 pad: 0x0000
class UMallAdvItem_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UButton*                                     Btn;                                                        // 0x0290   (0x0008)  
	class UImage*                                      MerchandiseTex;                                             // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Mall/MallPanel/MallAdvItem_HD.MallAdvItem_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/Mall/MallPanel/MallAdvItem_HD.MallAdvItem_HD_C.BP_OnEntryReleased
	// void BP_OnEntryReleased();                                                                                               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Mall/MallPanel/MallAdvItem_HD.MallAdvItem_HD_C.BP_OnItemExpansionChanged
	// void BP_OnItemExpansionChanged(bool bIsExpanded);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Mall/MallPanel/MallAdvItem_HD.MallAdvItem_HD_C.BP_OnItemSelectionChanged
	// void BP_OnItemSelectionChanged(bool bIsSelected);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Mall/MallPanel/MallAdvItem_HD.MallAdvItem_HD_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Mall/MallPanel/MallAdvItem_HD.MallAdvItem_HD_C.BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                                 // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/Mall/MallPanel/MallAdvItem_HD.MallAdvItem_HD_C.ExecuteUbergraph_MallAdvItem_HD
	// void ExecuteUbergraph_MallAdvItem_HD(int32_t EntryPoint);                                                                // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/NewEmall/NewEmall_tips.NewEmall_tips_C
/// Size: 0x0040 (64 bytes) (0x000288 - 0x0002C8) align 8 pad: 0x0000
class UNewEmall_tips_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            EndAnimation;                                               // 0x0290   (0x0008)  
	class UWidgetAnimation*                            Begin;                                                      // 0x0298   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02A0   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02A8   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x02B0   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x02B8   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/NewEmall/NewEmall_tips.NewEmall_tips_C.playAni
	// void playAni();                                                                                                          // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/NewEmall/NewEmall_tips.NewEmall_tips_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/NewEmall/NewEmall_tips.NewEmall_tips_C.ExecuteUbergraph_NewEmall_tips
	// void ExecuteUbergraph_NewEmall_tips(int32_t EntryPoint);                                                                 // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/F_Common/UnlockAnimation.UnlockAnimation_C
/// Size: 0x00FC (252 bytes) (0x000288 - 0x000384) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UUnlockAnimation_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            UnlockAnim;                                                 // 0x0290   (0x0008)  
	class UImage*                                      Ani_CricleD;                                                // 0x0298   (0x0008)  
	class UImage*                                      Ani_CricleD2;                                               // 0x02A0   (0x0008)  
	class UImage*                                      Ani_CricleD3;                                               // 0x02A8   (0x0008)  
	class UImage*                                      Ani_CricleD4;                                               // 0x02B0   (0x0008)  
	class UImage*                                      Ani_CricleE;                                                // 0x02B8   (0x0008)  
	class UImage*                                      Ani_CricleE2;                                               // 0x02C0   (0x0008)  
	class UImage*                                      Ani_CricleE3;                                               // 0x02C8   (0x0008)  
	class UImage*                                      Ani_CricleE4;                                               // 0x02D0   (0x0008)  
	class UImage*                                      Ani_Glow;                                                   // 0x02D8   (0x0008)  
	class UImage*                                      Ani_Glow0;                                                  // 0x02E0   (0x0008)  
	class UImage*                                      Ani_Glow1;                                                  // 0x02E8   (0x0008)  
	class UImage*                                      Ani_Glow2;                                                  // 0x02F0   (0x0008)  
	class UCanvasPanel*                                FX;                                                         // 0x02F8   (0x0008)  
	class UCanvasPanel*                                FX2;                                                        // 0x0300   (0x0008)  
	class UCanvasPanel*                                FX3;                                                        // 0x0308   (0x0008)  
	class UCanvasPanel*                                FX4;                                                        // 0x0310   (0x0008)  
	class UImage*                                      fxA;                                                        // 0x0318   (0x0008)  
	class UImage*                                      fxA2;                                                       // 0x0320   (0x0008)  
	class UImage*                                      fxA3;                                                       // 0x0328   (0x0008)  
	class UImage*                                      fxA4;                                                       // 0x0330   (0x0008)  
	class UImage*                                      fxB;                                                        // 0x0338   (0x0008)  
	class UImage*                                      fxB2;                                                       // 0x0340   (0x0008)  
	class UImage*                                      fxB3;                                                       // 0x0348   (0x0008)  
	class UImage*                                      fxB4;                                                       // 0x0350   (0x0008)  
	class UImage*                                      fxC;                                                        // 0x0358   (0x0008)  
	class UImage*                                      fxC2;                                                       // 0x0360   (0x0008)  
	class UImage*                                      fxC3;                                                       // 0x0368   (0x0008)  
	class UImage*                                      fxC4;                                                       // 0x0370   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0378   (0x0008)  
	int32_t                                            Index;                                                      // 0x0380   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/F_Common/UnlockAnimation.UnlockAnimation_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/F_Common/UnlockAnimation.UnlockAnimation_C.ExecuteUbergraph_UnlockAnimation
	// void ExecuteUbergraph_UnlockAnimation(int32_t EntryPoint);                                                               // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamUpTips_HD.TeamUpTips_HD_C
/// Size: 0x0008 (8 bytes) (0x000288 - 0x000290) align 8 pad: 0x0000
class UTeamUpTips_HD_C : public UUserWidget
{ 
public:
	class UImage*                                      Image;                                                      // 0x0288   (0x0008)  
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C
/// Size: 0x0140 (320 bytes) (0x000288 - 0x0003C8) align 8 pad: 0x0000
class UTeamSimpleInfo_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            UnlockAnim;                                                 // 0x0290   (0x0008)  
	class UWidgetAnimation*                            EnterAnimation;                                             // 0x0298   (0x0008)  
	class UWidgetAnimation*                            Press;                                                      // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            Normal;                                                     // 0x02A8   (0x0008)  
	class UWidgetAnimation*                            Hover;                                                      // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            EndAnimation;                                               // 0x02B8   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x02C0   (0x0008)  
	class UUAButton_C*                                 Btn_Jump;                                                   // 0x02C8   (0x0008)  
	class UUAButton_C*                                 Btn_QuitTeam;                                               // 0x02D0   (0x0008)  
	class UWidgetSwitcher*                             BtnSwitcher;                                                // 0x02D8   (0x0008)  
	class UUAButton_HD_C*                              Button_Battle;                                              // 0x02E0   (0x0008)  
	class UCanvasPanel*                                CanvasPanel;                                                // 0x02E8   (0x0008)  
	class UCanvasPanel*                                CanvasPanel0;                                               // 0x02F0   (0x0008)  
	class UCanvasPanel*                                CanvasPanel1;                                               // 0x02F8   (0x0008)  
	class UCanvasPanel*                                Enter_Gray;                                                 // 0x0300   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0308   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x0310   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x0318   (0x0008)  
	class UImage*                                      Image4;                                                     // 0x0320   (0x0008)  
	class UImage*                                      Image5;                                                     // 0x0328   (0x0008)  
	class UImage*                                      Image6;                                                     // 0x0330   (0x0008)  
	class UImage*                                      Image7;                                                     // 0x0338   (0x0008)  
	class UImage*                                      Image8;                                                     // 0x0340   (0x0008)  
	class UImage*                                      mapImage;                                                   // 0x0348   (0x0008)  
	class UTextBlock*                                  modeTxt;                                                    // 0x0350   (0x0008)  
	class UNonMandatoryClickForFrontEnd_HD_C*          NonMandatoryClickForFrontEnd;                               // 0x0358   (0x0008)  
	class UImage*                                      Number;                                                     // 0x0360   (0x0008)  
	class URedPoint_C*                                 RedPoint;                                                   // 0x0368   (0x0008)  
	class UTextBlock*                                  teamPlayer;                                                 // 0x0370   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0378   (0x0008)  
	class UTextBlock*                                  TextBlock9;                                                 // 0x0380   (0x0008)  
	class UTextBlock*                                  TextBlock10;                                                // 0x0388   (0x0008)  
	class UTextBlock*                                  TextBlock11;                                                // 0x0390   (0x0008)  
	class UTooltipHoverWidget_HD_C*                    TooltipHoverWidget_Gray;                                    // 0x0398   (0x0008)  
	class UUnlockAnimation_C*                          UnlockAnimation;                                            // 0x03A0   (0x0008)  
	FText                                              Set_Text;                                                   // 0x03A8   (0x0018)  
	class UAkAudioEvent*                               ClickSound;                                                 // 0x03C0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.SetGrayState
	// void SetGrayState(bool IsGrayState);                                                                                     // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.Construct
	// void Construct();                                                                                                        // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.BndEvt__Button_Battle_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	// void BndEvt__Button_Battle_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();                       // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.BndEvt__Button_Battle_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	// void BndEvt__Button_Battle_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();                      // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.BndEvt__Button_Battle_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	// void BndEvt__Button_Battle_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();                         // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.BndEvt__Button_Battle_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	// void BndEvt__Button_Battle_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();                         // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.PlayUnlockAnim
	// void PlayUnlockAnim();                                                                                                   // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.ClearGray
	// void ClearGray();                                                                                                        // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/TeamSimpleInfo.TeamSimpleInfo_C.ExecuteUbergraph_TeamSimpleInfo
	// void ExecuteUbergraph_TeamSimpleInfo(int32_t EntryPoint);                                                                // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/Task/TaskCommon_BriefTips.TaskCommon_BriefTips_C
/// Size: 0x0130 (304 bytes) (0x000288 - 0x0003B8) align 8 pad: 0x0000
class UTaskCommon_BriefTips_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0290   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0298   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x02A0   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x02A8   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x02B0   (0x0008)  
	class UImage*                                      Image4;                                                     // 0x02B8   (0x0008)  
	class UTextBlock*                                  TextBlock_Faction_Executing;                                // 0x02C0   (0x0008)  
	class UTextBlock*                                  TextBlock_Faction_Executing5;                               // 0x02C8   (0x0008)  
	class UTextBlock*                                  TextBlock_Faction_Finish;                                   // 0x02D0   (0x0008)  
	class UTextBlock*                                  TextBlock_Faction_Finish6;                                  // 0x02D8   (0x0008)  
	class UTextBlock*                                  TextBlock_Faction_NotAccepted;                              // 0x02E0   (0x0008)  
	class UTextBlock*                                  TextBlock_Faction_NotAccepted7;                             // 0x02E8   (0x0008)  
	class UTextBlock*                                  TextBlock_Main_Executing;                                   // 0x02F0   (0x0008)  
	class UTextBlock*                                  TextBlock_Main_Executing8;                                  // 0x02F8   (0x0008)  
	class UTextBlock*                                  TextBlock_Main_Finish;                                      // 0x0300   (0x0008)  
	class UTextBlock*                                  TextBlock_Main_Finish9;                                     // 0x0308   (0x0008)  
	class UTextBlock*                                  TextBlock_Main_NotAccepted;                                 // 0x0310   (0x0008)  
	class UTextBlock*                                  TextBlock_Main_NotAccepted10;                               // 0x0318   (0x0008)  
	class UTextBlock*                                  TextBlock_Week_Executing;                                   // 0x0320   (0x0008)  
	class UTextBlock*                                  TextBlock_Week_Executing11;                                 // 0x0328   (0x0008)  
	class UTextBlock*                                  TextBlock_Week_Finish;                                      // 0x0330   (0x0008)  
	class UTextBlock*                                  TextBlock_Week_Finish12;                                    // 0x0338   (0x0008)  
	class UTextBlock*                                  TextBlock_Week_NotAccepted;                                 // 0x0340   (0x0008)  
	class UTextBlock*                                  TextBlock_Week_NotAccepted13;                               // 0x0348   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0350   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_Main;                                        // 0x0358   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_Week;                                        // 0x0360   (0x0008)  
	FSlateColor                                        CountDownColorRed;                                          // 0x0368   (0x0028)  
	FSlateColor                                        CountDownColorWhite;                                        // 0x0390   (0x0028)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Task/TaskCommon_BriefTips.TaskCommon_BriefTips_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/Task/TaskCommon_BriefTips.TaskCommon_BriefTips_C.ExecuteUbergraph_TaskCommon_BriefTips
	// void ExecuteUbergraph_TaskCommon_BriefTips(int32_t EntryPoint);                                                          // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/TopRightBarPanel/TopRightBarPanel_HD.TopRightBarPanel_HD_C
/// Size: 0x02D8 (728 bytes) (0x000288 - 0x000560) align 8 pad: 0x0000
class UTopRightBarPanel_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            EndAnimation;                                               // 0x0290   (0x0008)  
	class UWidgetAnimation*                            LoopAnimation;                                              // 0x0298   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x02A0   (0x0008)  
	class UImage*                                      bg;                                                         // 0x02A8   (0x0008)  
	class UButton*                                     Btn_wificlick;                                              // 0x02B0   (0x0008)  
	class UButton*                                     Button_BG;                                                  // 0x02B8   (0x0008)  
	class UUAButton_HD_C*                              Button_Chat;                                                // 0x02C0   (0x0008)  
	class UButton*                                     Button_CloseFriend;                                         // 0x02C8   (0x0008)  
	class UUAButton_HD_C*                              Button_Emall;                                               // 0x02D0   (0x0008)  
	class UUAButton_HD_C*                              Button_EntHelp;                                             // 0x02D8   (0x0008)  
	class UUAButton_HD_C*                              Button_Friends;                                             // 0x02E0   (0x0008)  
	class UUAButton_C*                                 Button_Rank;                                                // 0x02E8   (0x0008)  
	class UUAButton_HD_C*                              Button_Setting;                                             // 0x02F0   (0x0008)  
	class UUAButton_C*                                 Button_Strategy;                                            // 0x02F8   (0x0008)  
	class UUAButton_C*                                 Button_TGALive;                                             // 0x0300   (0x0008)  
	class UCanvasPanel*                                Chat;                                                       // 0x0308   (0x0008)  
	class URedPoint_C*                                 ChatRedPoint;                                               // 0x0310   (0x0008)  
	class UCanvasPanel*                                Electric;                                                   // 0x0318   (0x0008)  
	class UCanvasPanel*                                Email;                                                      // 0x0320   (0x0008)  
	class URedPoint_C*                                 EmailHallRoomRedPoint;                                      // 0x0328   (0x0008)  
	class UCanvasPanel*                                EntHelp;                                                    // 0x0330   (0x0008)  
	class UCanvasPanel*                                FirstCharge;                                                // 0x0338   (0x0008)  
	class UbtnEnter_06_C*                              FirstChargeBtn;                                             // 0x0340   (0x0008)  
	class UTextBlock*                                  FriendNumTextBlock;                                         // 0x0348   (0x0008)  
	class UTextBlock*                                  FriendNumTextBlock0;                                        // 0x0350   (0x0008)  
	class UTextBlock*                                  FriendNumTextBlock1;                                        // 0x0358   (0x0008)  
	class UTextBlock*                                  FriendNumTextBlock2;                                        // 0x0360   (0x0008)  
	class URedPoint_C*                                 FriendRedPoint;                                             // 0x0368   (0x0008)  
	class UCanvasPanel*                                Friends;                                                    // 0x0370   (0x0008)  
	class UCanvasPanel*                                full;                                                       // 0x0378   (0x0008)  
	class UImage*                                      full_IMg;                                                   // 0x0380   (0x0008)  
	class UImage*                                      FullRedPointImage;                                          // 0x0388   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0390   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x0398   (0x0008)  
	class UImage*                                      Lighting;                                                   // 0x03A0   (0x0008)  
	class UHorizontalBox*                              NavigationSub;                                              // 0x03A8   (0x0008)  
	class UTextBlock*                                  netRtt;                                                     // 0x03B0   (0x0008)  
	class UNewEmall_tips_C*                            NewEmall_tips;                                              // 0x03B8   (0x0008)  
	class UOverlay*                                    PerformanceOverlay;                                         // 0x03C0   (0x0008)  
	class UImage*                                      PlaceHolder_Chat;                                           // 0x03C8   (0x0008)  
	class UImage*                                      PlaceHolder_Email;                                          // 0x03D0   (0x0008)  
	class UImage*                                      PlaceHolder_Help;                                           // 0x03D8   (0x0008)  
	class UImage*                                      PlaceHolder_Setting;                                        // 0x03E0   (0x0008)  
	class UPlatformPrivilegesItem_HD_C*                PlatformPrivilegesItem;                                     // 0x03E8   (0x0008)  
	class UVerticalBox*                                PlatformShow;                                               // 0x03F0   (0x0008)  
	class USizeBox*                                    Privilege;                                                  // 0x03F8   (0x0008)  
	class UImage*                                      Privilege_Image;                                            // 0x0400   (0x0008)  
	class UImage*                                      Privilege_Image4;                                           // 0x0408   (0x0008)  
	class UButton*                                     PrivilegeBtn;                                               // 0x0410   (0x0008)  
	class UProgressBar*                                ProgressBar;                                                // 0x0418   (0x0008)  
	class UCanvasPanel*                                Rank;                                                       // 0x0420   (0x0008)  
	class URedPoint_C*                                 RedPoint_FirstCharge;                                       // 0x0428   (0x0008)  
	class URichTextBlock*                              RichTextBlock_Delay;                                        // 0x0430   (0x0008)  
	class URichTextBlock*                              RichTextBlock_Frame;                                        // 0x0438   (0x0008)  
	class URichTextBlock*                              RichTextBlock_Loss;                                         // 0x0440   (0x0008)  
	class UCanvasPanel*                                Setting;                                                    // 0x0448   (0x0008)  
	class UImage*                                      sign1;                                                      // 0x0450   (0x0008)  
	class UImage*                                      sign11;                                                     // 0x0458   (0x0008)  
	class UImage*                                      sign2;                                                      // 0x0460   (0x0008)  
	class UImage*                                      sign22;                                                     // 0x0468   (0x0008)  
	class UImage*                                      sign3;                                                      // 0x0470   (0x0008)  
	class UImage*                                      sign33;                                                     // 0x0478   (0x0008)  
	class UCanvasPanel*                                Strategy;                                                   // 0x0480   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0488   (0x0008)  
	class UTextBlock*                                  TextBlock5;                                                 // 0x0490   (0x0008)  
	class UCanvasPanel*                                TGALive;                                                    // 0x0498   (0x0008)  
	class UTooltipHoverWidget_HD_C*                    TooltipHoverWidget;                                         // 0x04A0   (0x0008)  
	class UUA_Check_C*                                 UA_Check;                                                   // 0x04A8   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget;                                               // 0x04B0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget6;                                              // 0x04B8   (0x0008)  
	class UUAMoney_HD_C*                               UAMoney_Gold;                                               // 0x04C0   (0x0008)  
	class UUAMoney_HD_C*                               UAMoney_Money;                                              // 0x04C8   (0x0008)  
	class UUAMoney_HD_C*                               UAMoney_Point;                                              // 0x04D0   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_Chat;                                        // 0x04D8   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_Email;                                       // 0x04E0   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_Help;                                        // 0x04E8   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_Setting;                                     // 0x04F0   (0x0008)  
	class UCanvasPanel*                                wifi;                                                       // 0x04F8   (0x0008)  
	class UCanvasPanel*                                wifi7;                                                      // 0x0500   (0x0008)  
	class UImage*                                      wifi1;                                                      // 0x0508   (0x0008)  
	class UImage*                                      wifi11;                                                     // 0x0510   (0x0008)  
	class UImage*                                      wifi2;                                                      // 0x0518   (0x0008)  
	class UImage*                                      wifi22;                                                     // 0x0520   (0x0008)  
	class UImage*                                      wifi3;                                                      // 0x0528   (0x0008)  
	class UImage*                                      wifi33;                                                     // 0x0530   (0x0008)  
	class UImage*                                      wifi4;                                                      // 0x0538   (0x0008)  
	class UWidgetSwitcher*                             wifiSwitcher1;                                              // 0x0540   (0x0008)  
	class UWidgetSwitcher*                             wifiSwitcher2;                                              // 0x0548   (0x0008)  
	TArray<FSlateColor>                                NetColorArray;                                              // 0x0550   (0x0010)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/TopRightBarPanel/TopRightBarPanel_HD.TopRightBarPanel_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/MainUI/TopRightBarPanel/TopRightBarPanel_HD.TopRightBarPanel_HD_C.Construct
	// void Construct();                                                                                                        // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/TopRightBarPanel/TopRightBarPanel_HD.TopRightBarPanel_HD_C.BndEvt__Button_BG_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_BG_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                           // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/TopRightBarPanel/TopRightBarPanel_HD.TopRightBarPanel_HD_C.ExecuteUbergraph_TopRightBarPanel_HD
	// void ExecuteUbergraph_TopRightBarPanel_HD(int32_t EntryPoint);                                                           // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/TopRightBarPanel/TopRightBarPanel.TopRightBarPanel_C
/// Size: 0x0208 (520 bytes) (0x000288 - 0x000490) align 8 pad: 0x0000
class UTopRightBarPanel_C : public UUserWidget
{ 
public:
	class UWidgetAnimation*                            EndAnimation;                                               // 0x0288   (0x0008)  
	class UWidgetAnimation*                            LoopAnimation;                                              // 0x0290   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x0298   (0x0008)  
	class UImage*                                      bg;                                                         // 0x02A0   (0x0008)  
	class UButton*                                     Btn_wificlick;                                              // 0x02A8   (0x0008)  
	class UUAButton_C*                                 Button_Emall;                                               // 0x02B0   (0x0008)  
	class UUAButton_C*                                 Button_EntHelp;                                             // 0x02B8   (0x0008)  
	class UUAButton_C*                                 Button_Rank;                                                // 0x02C0   (0x0008)  
	class UUAButton_C*                                 Button_Setting;                                             // 0x02C8   (0x0008)  
	class UUAButton_C*                                 Button_Strategy;                                            // 0x02D0   (0x0008)  
	class UUAButton_C*                                 Button_TGALive;                                             // 0x02D8   (0x0008)  
	class UCanvasPanel*                                Electric;                                                   // 0x02E0   (0x0008)  
	class UCanvasPanel*                                Email;                                                      // 0x02E8   (0x0008)  
	class URedPoint_C*                                 EmailHallRoomRedPoint;                                      // 0x02F0   (0x0008)  
	class UCanvasPanel*                                EntHelp;                                                    // 0x02F8   (0x0008)  
	class UCanvasPanel*                                FirstCharge;                                                // 0x0300   (0x0008)  
	class UbtnEnter_06_C*                              FirstChargeBtn;                                             // 0x0308   (0x0008)  
	class UCanvasPanel*                                full;                                                       // 0x0310   (0x0008)  
	class UImage*                                      full_IMg;                                                   // 0x0318   (0x0008)  
	class UImage*                                      FullRedPointImage;                                          // 0x0320   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0328   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0330   (0x0008)  
	class UImage*                                      Lighting;                                                   // 0x0338   (0x0008)  
	class UTextBlock*                                  netRtt;                                                     // 0x0340   (0x0008)  
	class UNewEmall_tips_C*                            NewEmall_tips;                                              // 0x0348   (0x0008)  
	class UPlatformPrivilegesItem_C*                   PlatformPrivilegesItem;                                     // 0x0350   (0x0008)  
	class UVerticalBox*                                PlatformShow;                                               // 0x0358   (0x0008)  
	class USizeBox*                                    Privilege;                                                  // 0x0360   (0x0008)  
	class UImage*                                      Privilege_Image;                                            // 0x0368   (0x0008)  
	class UImage*                                      Privilege_Image1;                                           // 0x0370   (0x0008)  
	class UButton*                                     PrivilegeBtn;                                               // 0x0378   (0x0008)  
	class UProgressBar*                                ProgressBar;                                                // 0x0380   (0x0008)  
	class UCanvasPanel*                                Rank;                                                       // 0x0388   (0x0008)  
	class URedPoint_C*                                 RedPoint_FirstCharge;                                       // 0x0390   (0x0008)  
	class UCanvasPanel*                                Setting;                                                    // 0x0398   (0x0008)  
	class UImage*                                      shezhi;                                                     // 0x03A0   (0x0008)  
	class UImage*                                      sign1;                                                      // 0x03A8   (0x0008)  
	class UImage*                                      sign11;                                                     // 0x03B0   (0x0008)  
	class UImage*                                      sign2;                                                      // 0x03B8   (0x0008)  
	class UImage*                                      sign22;                                                     // 0x03C0   (0x0008)  
	class UImage*                                      sign3;                                                      // 0x03C8   (0x0008)  
	class UImage*                                      sign33;                                                     // 0x03D0   (0x0008)  
	class UCanvasPanel*                                Strategy;                                                   // 0x03D8   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x03E0   (0x0008)  
	class UCanvasPanel*                                TGALive;                                                    // 0x03E8   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget;                                               // 0x03F0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget2;                                              // 0x03F8   (0x0008)  
	class UUAMoney_C*                                  UAMoney_Gold;                                               // 0x0400   (0x0008)  
	class UUAMoney_C*                                  UAMoney_Money;                                              // 0x0408   (0x0008)  
	class UUAMoney_C*                                  UAMoney_Point;                                              // 0x0410   (0x0008)  
	class UCanvasPanel*                                wifi;                                                       // 0x0418   (0x0008)  
	class UCanvasPanel*                                wifi3;                                                      // 0x0420   (0x0008)  
	class UImage*                                      wifi1;                                                      // 0x0428   (0x0008)  
	class UImage*                                      wifi11;                                                     // 0x0430   (0x0008)  
	class UImage*                                      wifi2;                                                      // 0x0438   (0x0008)  
	class UImage*                                      wifi22;                                                     // 0x0440   (0x0008)  
	class UImage*                                      wifi34;                                                     // 0x0448   (0x0008)  
	class UImage*                                      wifi33;                                                     // 0x0450   (0x0008)  
	class UImage*                                      wifi4;                                                      // 0x0458   (0x0008)  
	class UOverlay*                                    wificanvas;                                                 // 0x0460   (0x0008)  
	class UWidgetSwitcher*                             wifiSwitcher1;                                              // 0x0468   (0x0008)  
	class UWidgetSwitcher*                             wifiSwitcher2;                                              // 0x0470   (0x0008)  
	class UImage*                                      youjian;                                                    // 0x0478   (0x0008)  
	TArray<FSlateColor>                                NetColorArray;                                              // 0x0480   (0x0010)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/TopRightBarPanel/TopRightBarPanel.TopRightBarPanel_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/ThemeActivityEntranceBtn_HD.ThemeActivityEntranceBtn_HD_C
/// Size: 0x0028 (40 bytes) (0x000288 - 0x0002B0) align 8 pad: 0x0000
class UThemeActivityEntranceBtn_HD_C : public UUserWidget
{ 
public:
	class UbtnEnter_02_C*                              BtnEnter;                                                   // 0x0288   (0x0008)  
	class URedPoint_C*                                 RedPoint;                                                   // 0x0290   (0x0008)  
	class UCanvasPanel*                                Secret_EnterPanel;                                          // 0x0298   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget;                                               // 0x02A0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget0;                                              // 0x02A8   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/ThemeActivityEntranceBtn_HD.ThemeActivityEntranceBtn_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/Advertisement/Common/RedTag.RedTag_C
/// Size: 0x0148 (328 bytes) (0x000288 - 0x0003D0) align 8 pad: 0x0000
class URedTag_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0290   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0298   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x02A0   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x02A8   (0x0008)  
	FSlateBrush                                        setBgTex;                                                   // 0x02B0   (0x0090)  
	FSlateBrush                                        SetTex;                                                     // 0x0340   (0x0090)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Advertisement/Common/RedTag.RedTag_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Advertisement/Common/RedTag.RedTag_C.ExecuteUbergraph_RedTag
	// void ExecuteUbergraph_RedTag(int32_t EntryPoint);                                                                        // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/FreshGuide/NonMandatoryClickForFrontEnd_HD.NonMandatoryClickForFrontEnd_HD_C
/// Size: 0x0094 (148 bytes) (0x000288 - 0x00031C) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UNonMandatoryClickForFrontEnd_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            UpTipsAnimLoop;                                             // 0x0290   (0x0008)  
	class UWidgetAnimation*                            LeftTipsAnimationLoop;                                      // 0x0298   (0x0008)  
	class UWidgetAnimation*                            startanimation;                                             // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            EndAnimation;                                               // 0x02A8   (0x0008)  
	class UWidgetAnimation*                            DownTipsAnimLoop;                                           // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            RightTipsAnimLoop;                                          // 0x02B8   (0x0008)  
	class UWidgetSwitcher*                             GuideDirType;                                               // 0x02C0   (0x0008)  
	class UImage*                                      Image_Bg;                                                   // 0x02C8   (0x0008)  
	class UImage*                                      Image_Icon;                                                 // 0x02D0   (0x0008)  
	class UTextBlock*                                  tips0;                                                      // 0x02D8   (0x0008)  
	class UTextBlock*                                  tips1;                                                      // 0x02E0   (0x0008)  
	class UTextBlock*                                  tips2;                                                      // 0x02E8   (0x0008)  
	class UTextBlock*                                  tips3;                                                      // 0x02F0   (0x0008)  
	class UTextBlock*                                  tips5;                                                      // 0x02F8   (0x0008)  
	FText                                              Tip;                                                        // 0x0300   (0x0018)  
	int32_t                                            Direction;                                                  // 0x0318   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/FreshGuide/NonMandatoryClickForFrontEnd_HD.NonMandatoryClickForFrontEnd_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/FreshGuide/NonMandatoryClickForFrontEnd_HD.NonMandatoryClickForFrontEnd_HD_C.SetTipText
	// void SetTipText(FText TipText);                                                                                          // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/FreshGuide/NonMandatoryClickForFrontEnd_HD.NonMandatoryClickForFrontEnd_HD_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/FreshGuide/NonMandatoryClickForFrontEnd_HD.NonMandatoryClickForFrontEnd_HD_C.SetDirection
	// void SetDirection(int32_t Direction);                                                                                    // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/FreshGuide/NonMandatoryClickForFrontEnd_HD.NonMandatoryClickForFrontEnd_HD_C.ExecuteUbergraph_NonMandatoryClickForFrontEnd_HD
	// void ExecuteUbergraph_NonMandatoryClickForFrontEnd_HD(int32_t EntryPoint);                                               // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/Mall/MallPanel/LoopScrollBox_HD.LoopScrollBox_HD_C
/// Size: 0x0068 (104 bytes) (0x000288 - 0x0002F0) align 8 pad: 0x0000
class ULoopScrollBox_HD_C : public UUserWidget
{ 
public:
	class UWidgetAnimation*                            NewAnimation;                                               // 0x0288   (0x0008)  
	class UMallAdvItem_HD_C*                           MallAdvItem;                                                // 0x0290   (0x0008)  
	class UScrollBox*                                  ScrollBoxRoot;                                              // 0x0298   (0x0008)  
	FSlateColor                                        TextColorSelect;                                            // 0x02A0   (0x0028)  
	FSlateColor                                        TextColorNoSelect;                                          // 0x02C8   (0x0028)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Mall/MallPanel/LoopScrollBox_HD.LoopScrollBox_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/Chat/ChatPanel/EnterChat_HD.EnterChat_HD_C
/// Size: 0x00C8 (200 bytes) (0x000288 - 0x000350) align 8 pad: 0x0000
class UEnterChat_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            LoopAnimation;                                              // 0x0290   (0x0008)  
	class UWidgetAnimation*                            EndAnimation;                                               // 0x0298   (0x0008)  
	class UWidgetAnimation*                            MessageAnimation;                                           // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x02A8   (0x0008)  
	class UButton*                                     barBtn;                                                     // 0x02B0   (0x0008)  
	class UButton*                                     Button;                                                     // 0x02B8   (0x0008)  
	class UWidgetSwitcher*                             Channel;                                                    // 0x02C0   (0x0008)  
	class UTextBlock*                                  countTex;                                                   // 0x02C8   (0x0008)  
	class UOverlay*                                    EnterchatOverlay;                                           // 0x02D0   (0x0008)  
	class UUAButton_HD_C*                              friendBtn;                                                  // 0x02D8   (0x0008)  
	class UTextBlock*                                  FriendNameText;                                             // 0x02E0   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02E8   (0x0008)  
	class UImage*                                      Image_Gray;                                                 // 0x02F0   (0x0008)  
	class UListView*                                   ListView;                                                   // 0x02F8   (0x0008)  
	class UCanvasPanel*                                msgTip;                                                     // 0x0300   (0x0008)  
	class UTextBlock*                                  OtherContent;                                               // 0x0308   (0x0008)  
	class UImage*                                      PressMask;                                                  // 0x0310   (0x0008)  
	class URedPoint_C*                                 RedPoint;                                                   // 0x0318   (0x0008)  
	class UTextBlock*                                  selfContent;                                                // 0x0320   (0x0008)  
	class UWidgetSwitcher*                             shortCutSwitcher1;                                          // 0x0328   (0x0008)  
	class UWidgetSwitcher*                             shortCutSwitcher2;                                          // 0x0330   (0x0008)  
	class UTextBlock*                                  Tex;                                                        // 0x0338   (0x0008)  
	class UEditableTextBox*                            tex_old;                                                    // 0x0340   (0x0008)  
	class UUAButton_C*                                 UAButton_Shortcut1;                                         // 0x0348   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/EnterChat_HD.EnterChat_HD_C.PlayEnterSound
	// void PlayEnterSound();                                                                                                   // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/EnterChat_HD.EnterChat_HD_C.Construct
	// void Construct();                                                                                                        // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/EnterChat_HD.EnterChat_HD_C.BndEvt__friendBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__friendBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                           // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/EnterChat_HD.EnterChat_HD_C.BndEvt__barBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__barBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();                              // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/EnterChat_HD.EnterChat_HD_C.BndEvt__Button_120_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_120_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();                          // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/Chat/ChatPanel/EnterChat_HD.EnterChat_HD_C.ExecuteUbergraph_EnterChat_HD
	// void ExecuteUbergraph_EnterChat_HD(int32_t EntryPoint);                                                                  // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/AvatarShow/DragAvatar_HD.DragAvatar_HD_C
/// Size: 0x000C (12 bytes) (0x000288 - 0x000294) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UDragAvatar_HD_C : public UUserWidget
{ 
public:
	class UCanvasPanel*                                __Root;                                                     // 0x0288   (0x0008)  
	float                                              CancelClickTime;                                            // 0x0290   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/AvatarShow/DragAvatar_HD.DragAvatar_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/Advertisement/Common/Default_LoopScrollBg.Default_LoopScrollBg_C
/// Size: 0x0008 (8 bytes) (0x000288 - 0x000290) align 8 pad: 0x0000
class UDefault_LoopScrollBg_C : public UUserWidget
{ 
public:
	class UButton*                                     Button;                                                     // 0x0288   (0x0008)  
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_07.btnEnter_07_C
/// Size: 0x0198 (408 bytes) (0x000288 - 0x000420) align 8 pad: 0x0000
class UbtnEnter_07_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x0290   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x0298   (0x0008)  
	class UButton*                                     Button_Enter;                                               // 0x02A0   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02A8   (0x0008)  
	class USizeBox*                                    SizeBox_Enter;                                              // 0x02B0   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02B8   (0x0008)  
	FSlateBrush                                        SetBG;                                                      // 0x02C0   (0x0090)  
	FSlateColor                                        SetText_Color_and_Opacity;                                  // 0x0350   (0x0028)  
	FText                                              SetName;                                                    // 0x0378   (0x0018)  
	FSlateBrush                                        setbuttonIcn;                                               // 0x0390   (0x0090)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_07.btnEnter_07_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_07.btnEnter_07_C.BndEvt__Button_Enter_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_Enter_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                        // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_07.btnEnter_07_C.ExecuteUbergraph_btnEnter_07
	// void ExecuteUbergraph_btnEnter_07(int32_t EntryPoint);                                                                   // [0x3a75280] Final|HasDefaults    
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_06.btnEnter_06_C
/// Size: 0x0110 (272 bytes) (0x000288 - 0x000398) align 8 pad: 0x0000
class UbtnEnter_06_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            LoopAnimation;                                              // 0x0290   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x0298   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x02A0   (0x0008)  
	class UUAButton_C*                                 Button_Enter;                                               // 0x02A8   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02B0   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02B8   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x02C0   (0x0008)  
	class UOverlay*                                    Ovelay_Enter;                                               // 0x02C8   (0x0008)  
	class URedPoint_C*                                 RedPoint;                                                   // 0x02D0   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02D8   (0x0008)  
	class UTextBlock*                                  TextBlock2;                                                 // 0x02E0   (0x0008)  
	class UTextBlock*                                  TextBlock3;                                                 // 0x02E8   (0x0008)  
	FSlateBrush                                        setIcon;                                                    // 0x02F0   (0x0090)  
	FText                                              SetText;                                                    // 0x0380   (0x0018)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_06.btnEnter_06_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_06.btnEnter_06_C.ExecuteUbergraph_btnEnter_06
	// void ExecuteUbergraph_btnEnter_06(int32_t EntryPoint);                                                                   // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_05.btnEnter_05_C
/// Size: 0x00B8 (184 bytes) (0x000288 - 0x000340) align 8 pad: 0x0000
class UbtnEnter_05_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x0290   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x0298   (0x0008)  
	class UButton*                                     Button_Enter;                                               // 0x02A0   (0x0008)  
	class UHorizontalBox*                              HorizontalBox;                                              // 0x02A8   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02B0   (0x0008)  
	class UImage*                                      LockImg;                                                    // 0x02B8   (0x0008)  
	class USizeBox*                                    SizeBox_Enter;                                              // 0x02C0   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02C8   (0x0008)  
	bool                                               IsGrayState;                                                // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x02D1   (0x0007)  MISSED
	FText                                              btnName;                                                    // 0x02D8   (0x0018)  
	FSlateColor                                        GrayColor;                                                  // 0x02F0   (0x0028)  
	FSlateColor                                        TextNormalColor;                                            // 0x0318   (0x0028)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_05.btnEnter_05_C.SetGrayState
	// void SetGrayState(bool isGray);                                                                                          // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_05.btnEnter_05_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_05.btnEnter_05_C.BndEvt__Button_Enter_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	// void BndEvt__Button_Enter_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();                        // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_05.btnEnter_05_C.BndEvt__Button_Enter_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	// void BndEvt__Button_Enter_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();                       // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_05.btnEnter_05_C.BndEvt__Button_Enter_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_Enter_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();                        // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_05.btnEnter_05_C.ExecuteUbergraph_btnEnter_05
	// void ExecuteUbergraph_btnEnter_05(int32_t EntryPoint);                                                                   // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_04.btnEnter_04_C
/// Size: 0x00D0 (208 bytes) (0x000288 - 0x000358) align 8 pad: 0x0000
class UbtnEnter_04_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x0290   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x0298   (0x0008)  
	class UButton*                                     Button_Enter;                                               // 0x02A0   (0x0008)  
	class UImage*                                      LockImg;                                                    // 0x02A8   (0x0008)  
	class USizeBox*                                    SizeBox_Enter;                                              // 0x02B0   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02B8   (0x0008)  
	bool                                               IsGrayState;                                                // 0x02C0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x02C1   (0x0007)  MISSED
	FSlateColor                                        TextPressColor;                                             // 0x02C8   (0x0028)  
	FSlateColor                                        TextNormalColor;                                            // 0x02F0   (0x0028)  
	FText                                              btnName;                                                    // 0x0318   (0x0018)  
	FSlateColor                                        GrayColor;                                                  // 0x0330   (0x0028)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_04.btnEnter_04_C.SetGrayState
	// void SetGrayState(bool IsGrayState);                                                                                     // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_04.btnEnter_04_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_04.btnEnter_04_C.BndEvt__Button_34_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	// void BndEvt__Button_34_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();                           // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_04.btnEnter_04_C.BndEvt__Button_34_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	// void BndEvt__Button_34_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();                          // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_04.btnEnter_04_C.BndEvt__Button_Enter_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_Enter_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();                        // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_04.btnEnter_04_C.ExecuteUbergraph_btnEnter_04
	// void ExecuteUbergraph_btnEnter_04(int32_t EntryPoint);                                                                   // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_03.btnEnter_03_C
/// Size: 0x0148 (328 bytes) (0x000288 - 0x0003D0) align 8 pad: 0x0000
class UbtnEnter_03_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x0290   (0x0008)  
	class UWidgetAnimation*                            LoopAnimation;                                              // 0x0298   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x02A8   (0x0008)  
	class UButton*                                     Button_FirstCharge;                                         // 0x02B0   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02B8   (0x0008)  
	class URedPointSimple_C*                           RedPoint_FirstCharge;                                       // 0x02C0   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02C8   (0x0008)  
	FSlateBrush                                        setIcon;                                                    // 0x02D0   (0x0090)  
	FText                                              SetText;                                                    // 0x0360   (0x0018)  
	float                                              Y;                                                          // 0x0378   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x037C   (0x0004)  MISSED
	FSlateColor                                        TextPressColor;                                             // 0x0380   (0x0028)  
	FSlateColor                                        TextReleaseColor;                                           // 0x03A8   (0x0028)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_03.btnEnter_03_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_03.btnEnter_03_C.BndEvt__Button_FirstCharge_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	// void BndEvt__Button_FirstCharge_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();                  // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_03.btnEnter_03_C.BndEvt__Button_FirstCharge_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	// void BndEvt__Button_FirstCharge_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();                 // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_03.btnEnter_03_C.BndEvt__Button_FirstCharge_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_FirstCharge_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();                  // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_03.btnEnter_03_C.ExecuteUbergraph_btnEnter_03
	// void ExecuteUbergraph_btnEnter_03(int32_t EntryPoint);                                                                   // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_02.btnEnter_02_C
/// Size: 0x018C (396 bytes) (0x000288 - 0x000414) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UbtnEnter_02_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x0290   (0x0008)  
	class UButton*                                     Button_Enter;                                               // 0x0298   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02A0   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02A8   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02B0   (0x0008)  
	FSlateBrush                                        setIcon;                                                    // 0x02B8   (0x0090)  
	FText                                              SetText;                                                    // 0x0348   (0x0018)  
	FSlateColor                                        setfontColor;                                               // 0x0360   (0x0028)  
	FSlateColor                                        pressFontColor;                                             // 0x0388   (0x0028)  
	FSlateFontInfo                                     SetFont;                                                    // 0x03B0   (0x0058)  
	bool                                               IsShowBG;                                                   // 0x0408   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0409   (0x0003)  MISSED
	FVector2D                                          setScalIcon;                                                // 0x040C   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_02.btnEnter_02_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_02.btnEnter_02_C.BndEvt__Button_Enter_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	// void BndEvt__Button_Enter_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();                        // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_02.btnEnter_02_C.BndEvt__Button_Enter_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature
	// void BndEvt__Button_Enter_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();                       // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_02.btnEnter_02_C.BndEvt__Button_Enter_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_Enter_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();                        // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_02.btnEnter_02_C.ExecuteUbergraph_btnEnter_02
	// void ExecuteUbergraph_btnEnter_02(int32_t EntryPoint);                                                                   // [0x3a75280] Final|HasDefaults    
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C
/// Size: 0x0742 (1858 bytes) (0x000288 - 0x0009CA) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class UbtnEnter_01_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            UnlockAnim;                                                 // 0x0290   (0x0008)  
	class UWidgetAnimation*                            Normal;                                                     // 0x0298   (0x0008)  
	class UWidgetAnimation*                            Press;                                                      // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            Hover;                                                      // 0x02A8   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x02B8   (0x0008)  
	class UCanvasPanel*                                _811Hover;                                                  // 0x02C0   (0x0008)  
	class UImage*                                      _811Normal;                                                 // 0x02C8   (0x0008)  
	class UImage*                                      _811Normal0;                                                // 0x02D0   (0x0008)  
	class UCanvasPanel*                                _811Press;                                                  // 0x02D8   (0x0008)  
	class UImage*                                      Ani_BgzUP;                                                  // 0x02E0   (0x0008)  
	class UImage*                                      Ani_Hover;                                                  // 0x02E8   (0x0008)  
	class UImage*                                      Ani_Hover_A;                                                // 0x02F0   (0x0008)  
	class UImage*                                      Ani_Hover_A1;                                               // 0x02F8   (0x0008)  
	class UImage*                                      Ani_Hover_A2;                                               // 0x0300   (0x0008)  
	class UImage*                                      Ani_Hover_B;                                                // 0x0308   (0x0008)  
	class UImage*                                      Ani_Hover_B3;                                               // 0x0310   (0x0008)  
	class UImage*                                      Ani_Hover_C;                                                // 0x0318   (0x0008)  
	class UImage*                                      Ani_Hover_C4;                                               // 0x0320   (0x0008)  
	class UImage*                                      Ani_Hover_D;                                                // 0x0328   (0x0008)  
	class UImage*                                      Ani_Hover_D5;                                               // 0x0330   (0x0008)  
	class UImage*                                      Ani_Hover_D_Noise;                                          // 0x0338   (0x0008)  
	class UImage*                                      Ani_Hover_D_Noise6;                                         // 0x0340   (0x0008)  
	class UImage*                                      Ani_z_01;                                                   // 0x0348   (0x0008)  
	class UImage*                                      Ani_z_02;                                                   // 0x0350   (0x0008)  
	class UImage*                                      Btn_Normal;                                                 // 0x0358   (0x0008)  
	class UImage*                                      Btn_Press;                                                  // 0x0360   (0x0008)  
	class UImage*                                      Btn_PressBg;                                                // 0x0368   (0x0008)  
	class UImage*                                      Btn_Suspension;                                             // 0x0370   (0x0008)  
	class UWidgetSwitcher*                             BtnSwitcher;                                                // 0x0378   (0x0008)  
	class UUAButton_HD_C*                              Button_Enter;                                               // 0x0380   (0x0008)  
	class UCanvasPanel*                                CanvasPanel;                                                // 0x0388   (0x0008)  
	class UCanvasPanel*                                CanvasPanel7;                                               // 0x0390   (0x0008)  
	class UCanvasPanel*                                CanvasPanel8;                                               // 0x0398   (0x0008)  
	class UCanvasPanel*                                CanvasPanel_Gray;                                           // 0x03A0   (0x0008)  
	class UCanvasPanel*                                Enter_Gray;                                                 // 0x03A8   (0x0008)  
	class UImage*                                      FX_01;                                                      // 0x03B0   (0x0008)  
	class UImage*                                      Image;                                                      // 0x03B8   (0x0008)  
	class UImage*                                      Image9;                                                     // 0x03C0   (0x0008)  
	class UImage*                                      Image10;                                                    // 0x03C8   (0x0008)  
	class UImage*                                      Image11;                                                    // 0x03D0   (0x0008)  
	class UImage*                                      Image12;                                                    // 0x03D8   (0x0008)  
	class UImage*                                      Image13;                                                    // 0x03E0   (0x0008)  
	class UImage*                                      Image14;                                                    // 0x03E8   (0x0008)  
	class UImage*                                      Image15;                                                    // 0x03F0   (0x0008)  
	class UImage*                                      Image16;                                                    // 0x03F8   (0x0008)  
	class UImage*                                      Image17;                                                    // 0x0400   (0x0008)  
	class UImage*                                      Image18;                                                    // 0x0408   (0x0008)  
	class UImage*                                      Image19;                                                    // 0x0410   (0x0008)  
	class UImage*                                      Image20;                                                    // 0x0418   (0x0008)  
	class UImage*                                      Image21;                                                    // 0x0420   (0x0008)  
	class UImage*                                      Image22;                                                    // 0x0428   (0x0008)  
	class UImage*                                      Image23;                                                    // 0x0430   (0x0008)  
	class UImage*                                      Image24;                                                    // 0x0438   (0x0008)  
	class UImage*                                      Image25;                                                    // 0x0440   (0x0008)  
	class UImage*                                      Image26;                                                    // 0x0448   (0x0008)  
	class UImage*                                      Image27;                                                    // 0x0450   (0x0008)  
	class UImage*                                      Image28;                                                    // 0x0458   (0x0008)  
	class UImage*                                      Image29;                                                    // 0x0460   (0x0008)  
	class UImage*                                      Image30;                                                    // 0x0468   (0x0008)  
	class UImage*                                      Image31;                                                    // 0x0470   (0x0008)  
	class UImage*                                      Image32;                                                    // 0x0478   (0x0008)  
	class UImage*                                      Image33;                                                    // 0x0480   (0x0008)  
	class UImage*                                      Image34;                                                    // 0x0488   (0x0008)  
	class UCanvasPanel*                                MainUI;                                                     // 0x0490   (0x0008)  
	class UImage*                                      MainUI35;                                                   // 0x0498   (0x0008)  
	class UCanvasPanel*                                MainUI36;                                                   // 0x04A0   (0x0008)  
	class UCanvasPanel*                                MainUI37;                                                   // 0x04A8   (0x0008)  
	class UCanvasPanel*                                MainUI38;                                                   // 0x04B0   (0x0008)  
	class UImage*                                      MainUI39;                                                   // 0x04B8   (0x0008)  
	class UImage*                                      MainUI40;                                                   // 0x04C0   (0x0008)  
	class UImage*                                      MainUI41;                                                   // 0x04C8   (0x0008)  
	class UNamedSlot*                                  NamedSlot;                                                  // 0x04D0   (0x0008)  
	class UTextBlock*                                  NextHover;                                                  // 0x04D8   (0x0008)  
	class UTextBlock*                                  NextNormal;                                                 // 0x04E0   (0x0008)  
	class UTextBlock*                                  NextPress;                                                  // 0x04E8   (0x0008)  
	class UTextBlock*                                  NextPress2;                                                 // 0x04F0   (0x0008)  
	class URedPoint_C*                                 RedPoint_Businessman;                                       // 0x04F8   (0x0008)  
	class URedPoint_C*                                 RedPoint_Businessman42;                                     // 0x0500   (0x0008)  
	class URedPoint_C*                                 RedPoint_Businessman43;                                     // 0x0508   (0x0008)  
	class URedPoint_C*                                 RedPoint_Businessman44;                                     // 0x0510   (0x0008)  
	class USizeBox*                                    SizeBox;                                                    // 0x0518   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0520   (0x0008)  
	class UTextBlock*                                  TextBlock45;                                                // 0x0528   (0x0008)  
	class UTextBlock*                                  TextBlock46;                                                // 0x0530   (0x0008)  
	class UTextBlock*                                  TextBlock47;                                                // 0x0538   (0x0008)  
	class UTextBlock*                                  TextBlock48;                                                // 0x0540   (0x0008)  
	class UTooltipHoverWidget_HD_C*                    TooltipHoverWidget_Gray;                                    // 0x0548   (0x0008)  
	class UCanvasPanel*                                tradingPanel;                                               // 0x0550   (0x0008)  
	class UUnlockAnimation_C*                          UnlockAnimation;                                            // 0x0558   (0x0008)  
	FSlateBrush                                        setIcon;                                                    // 0x0560   (0x0090)  
	FText                                              set_Main_Text;                                              // 0x05F0   (0x0018)  
	FSlateBrush                                        set__Normal;                                                // 0x0608   (0x0090)  
	FSlateBrush                                        set_Businessman;                                            // 0x0698   (0x0090)  
	FSlateBrush                                        Set_Prees_Bg;                                               // 0x0728   (0x0090)  
	FMargin                                            Set_press_Offset;                                           // 0x07B8   (0x0010)  
	FSlateBrush                                        Set_Suspension;                                             // 0x07C8   (0x0090)  
	class UImage*                                      Set_Prees_Bg_1;                                             // 0x0858   (0x0008)  
	FSlateBrush                                        Set_Btn_PressBg;                                            // 0x0860   (0x0090)  
	class UMaterialInstance*                           HoverMaterialIns;                                           // 0x08F0   (0x0008)  
	FVector2D                                          InBrushImageSize;                                           // 0x08F8   (0x0008)  
	bool                                               bHoverAnim;                                                 // 0x0900   (0x0001)  
	bool                                               bPressAnim;                                                 // 0x0901   (0x0001)  
	bool                                               bShowAdornment;                                             // 0x0902   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0903   (0x0001)  MISSED
	FMargin                                            set_Btn_PressBg_Offset;                                     // 0x0904   (0x0010)  
	bool                                               Show_Btn_Bg;                                                // 0x0914   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0915   (0x0003)  MISSED
	FSlateBrush                                        Hover_Red;                                                  // 0x0918   (0x0090)  
	bool                                               Show_Btn_Bg49;                                              // 0x09A8   (0x0001)  
	bool                                               Set_811Btn;                                                 // 0x09A9   (0x0001)  
	unsigned char                                      UnknownData02_6[0x6];                                       // 0x09AA   (0x0006)  MISSED
	FText                                              set_Next_Text;                                              // 0x09B0   (0x0018)  
	bool                                               Set_Main_UI;                                                // 0x09C8   (0x0001)  
	bool                                               Is_Gray_State;                                              // 0x09C9   (0x0001)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C.SequenceEvent__ENTRYPOINTbtnEnter_01_HD
	// void SequenceEvent__ENTRYPOINTbtnEnter_01_HD();                                                                          // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C.SetGrayState
	// void SetGrayState(bool IsGrayState);                                                                                     // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C.PlayUnlockAnim
	// void PlayUnlockAnim();                                                                                                   // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C.Construct
	// void Construct();                                                                                                        // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C.OnHovered_Event
	// void OnHovered_Event();                                                                                                  // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C.OnPressed_Event
	// void OnPressed_Event();                                                                                                  // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/Common/btnEnter_01_HD.btnEnter_01_HD_C.ExecuteUbergraph_btnEnter_01_HD
	// void ExecuteUbergraph_btnEnter_01_HD(int32_t EntryPoint);                                                                // [0x3a75280] Final|HasDefaults    
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C
/// Size: 0x0898 (2200 bytes) (0x000288 - 0x000B20) align 8 pad: 0x0000
class UMainUIPanel_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            TipsAnimation_02;                                           // 0x0290   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation_Enter;                                        // 0x0298   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation_02;                                           // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            SCAVAnimation;                                              // 0x02A8   (0x0008)  
	class UWidgetAnimation*                            PMCAnimation;                                               // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            TipsAnimation;                                              // 0x02B8   (0x0008)  
	class UWidgetAnimation*                            BlackUI;                                                    // 0x02C0   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation_AnyKeyPress;                                  // 0x02C8   (0x0008)  
	class UWidgetAnimation*                            Pressanykey;                                                // 0x02D0   (0x0008)  
	class UWidgetAnimation*                            Enter;                                                      // 0x02D8   (0x0008)  
	class UWidgetAnimation*                            Normal;                                                     // 0x02E0   (0x0008)  
	class UWidgetAnimation*                            Press;                                                      // 0x02E8   (0x0008)  
	class UWidgetAnimation*                            Hover;                                                      // 0x02F0   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x02F8   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x0300   (0x0008)  
	class UCanvasPanel*                                Achievement_Enter_Panel;                                    // 0x0308   (0x0008)  
	class UCanvasPanel*                                Activity;                                                   // 0x0310   (0x0008)  
	class USizeBox*                                    Activity_Enter_Panel;                                       // 0x0318   (0x0008)  
	class UImage*                                      Ani_D_Select;                                               // 0x0320   (0x0008)  
	class UImage*                                      Ani_D_Select0;                                              // 0x0328   (0x0008)  
	class UImage*                                      Ani_SCAV_Sel_D;                                             // 0x0330   (0x0008)  
	class UCanvasPanel*                                AuctionHouseEnterPanel;                                     // 0x0338   (0x0008)  
	class UCanvasPanel*                                BattleEnterPanel;                                           // 0x0340   (0x0008)  
	class UHorizontalBox*                              BottomLeftMenu;                                             // 0x0348   (0x0008)  
	class UbtnEnter_04_C*                              BtnEnter_Achievement;                                       // 0x0350   (0x0008)  
	class UUAButton_HD_C*                              BtnEnter_Activity;                                          // 0x0358   (0x0008)  
	class UbtnEnter_01_HD_C*                           BtnEnter_AuctionHouse;                                      // 0x0360   (0x0008)  
	class UbtnEnter_01_HD_C*                           BtnEnter_Character;                                         // 0x0368   (0x0008)  
	class UbtnEnter_04_C*                              BtnEnter_Clan;                                              // 0x0370   (0x0008)  
	class UbtnEnter_06_C*                              BtnEnter_FirstCharge;                                       // 0x0378   (0x0008)  
	class UbtnEnter_02_C*                              BtnEnter_GiftBag;                                           // 0x0380   (0x0008)  
	class UbtnEnter_07_C*                              BtnEnter_Mall;                                              // 0x0388   (0x0008)  
	class UbtnEnter_04_C*                              BtnEnter_Mentor;                                            // 0x0390   (0x0008)  
	class UUAButtonTablItem_HD_C*                      BtnEnter_Question;                                          // 0x0398   (0x0008)  
	class UbtnEnter_05_C*                              BtnEnter_SeasonBP;                                          // 0x03A0   (0x0008)  
	class UbtnEnter_04_C*                              BtnEnter_Task;                                              // 0x03A8   (0x0008)  
	class UbtnEnter_01_HD_C*                           BtnEnter_Trading;                                           // 0x03B0   (0x0008)  
	class UbtnEnter_01_HD_C*                           BtnEnter_WeaponBuild;                                       // 0x03B8   (0x0008)  
	class UTeamSimpleInfo_C*                           Button_BackTeam;                                            // 0x03C0   (0x0008)  
	class UTeamSimpleInfo_C*                           Button_Battle;                                              // 0x03C8   (0x0008)  
	class UUAButton_HD_C*                              Button_Battle_Temp;                                         // 0x03D0   (0x0008)  
	class UUAButton_HD_C*                              Button_PersonalInfo;                                        // 0x03D8   (0x0008)  
	class UButton*                                     Button_PMC;                                                 // 0x03E0   (0x0008)  
	class UButton*                                     Button_SCAV;                                                // 0x03E8   (0x0008)  
	class UUAButtonNewGray_HD_C*                       Button_SwitchSelect;                                        // 0x03F0   (0x0008)  
	class UCanvasPanel*                                Canvas_BGDecoration;                                        // 0x03F8   (0x0008)  
	class UOverlay*                                    CanvasPanel_More;                                           // 0x0400   (0x0008)  
	class UCanvasPanel*                                Clan_Enter_Panel;                                           // 0x0408   (0x0008)  
	class UDecorateBig_HD_C*                           Decorate_HD;                                                // 0x0410   (0x0008)  
	class UDecorateLong_HD_C*                          DecorateLong_HD;                                            // 0x0418   (0x0008)  
	class UCanvasPanel*                                DecoratePanel;                                              // 0x0420   (0x0008)  
	class UDefault_LoopScrollBg_C*                     Default_LoopScrollBg;                                       // 0x0428   (0x0008)  
	class UCanvasPanel*                                DisableTips;                                                // 0x0430   (0x0008)  
	class UDragAvatar_HD_C*                            DragAvatar;                                                 // 0x0438   (0x0008)  
	class UCanvasPanel*                                DragAvatarPanel;                                            // 0x0440   (0x0008)  
	class UEnterChat_HD_C*                             EnterChat_HD;                                               // 0x0448   (0x0008)  
	class UCanvasPanel*                                FirstCharge_EnterPanel;                                     // 0x0450   (0x0008)  
	class URichTextBlock*                              FreeCouponCDTime;                                           // 0x0458   (0x0008)  
	class UCanvasPanel*                                GiftBag_EnterPanel;                                         // 0x0460   (0x0008)  
	class UImage*                                      Hei;                                                        // 0x0468   (0x0008)  
	class UHorizontalBox*                              HorizontalBox;                                              // 0x0470   (0x0008)  
	class UCanvasPanel*                                HoverTips;                                                  // 0x0478   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0480   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x0488   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x0490   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x0498   (0x0008)  
	class UImage*                                      Image4;                                                     // 0x04A0   (0x0008)  
	class UImage*                                      Image5;                                                     // 0x04A8   (0x0008)  
	class UImage*                                      Image6;                                                     // 0x04B0   (0x0008)  
	class UImage*                                      Image7;                                                     // 0x04B8   (0x0008)  
	class UImage*                                      Image8;                                                     // 0x04C0   (0x0008)  
	class UImage*                                      Image9;                                                     // 0x04C8   (0x0008)  
	class UImage*                                      Image10;                                                    // 0x04D0   (0x0008)  
	class UImage*                                      Image11;                                                    // 0x04D8   (0x0008)  
	class UImage*                                      Image12;                                                    // 0x04E0   (0x0008)  
	class UImage*                                      Image13;                                                    // 0x04E8   (0x0008)  
	class UImage*                                      Image14;                                                    // 0x04F0   (0x0008)  
	class UImage*                                      Image15;                                                    // 0x04F8   (0x0008)  
	class UImage*                                      Image16;                                                    // 0x0500   (0x0008)  
	class UImage*                                      Image17;                                                    // 0x0508   (0x0008)  
	class UImage*                                      Image18;                                                    // 0x0510   (0x0008)  
	class UImage*                                      Image19;                                                    // 0x0518   (0x0008)  
	class UImage*                                      Image20;                                                    // 0x0520   (0x0008)  
	class UImage*                                      Image21;                                                    // 0x0528   (0x0008)  
	class UImage*                                      Image22;                                                    // 0x0530   (0x0008)  
	class UImage*                                      Image23;                                                    // 0x0538   (0x0008)  
	class UImage*                                      Image24;                                                    // 0x0540   (0x0008)  
	class UImage*                                      Image25;                                                    // 0x0548   (0x0008)  
	class UImage*                                      Image26;                                                    // 0x0550   (0x0008)  
	class UImage*                                      Image27;                                                    // 0x0558   (0x0008)  
	class UImage*                                      Image28;                                                    // 0x0560   (0x0008)  
	class UImage*                                      Image29;                                                    // 0x0568   (0x0008)  
	class UImage*                                      Image30;                                                    // 0x0570   (0x0008)  
	class UImage*                                      Image31;                                                    // 0x0578   (0x0008)  
	class UImage*                                      Image32;                                                    // 0x0580   (0x0008)  
	class UImage*                                      Image33;                                                    // 0x0588   (0x0008)  
	class UImage*                                      Image34;                                                    // 0x0590   (0x0008)  
	class UImage*                                      Image35;                                                    // 0x0598   (0x0008)  
	class UImage*                                      Image36;                                                    // 0x05A0   (0x0008)  
	class UImage*                                      Image37;                                                    // 0x05A8   (0x0008)  
	class UImage*                                      Image38;                                                    // 0x05B0   (0x0008)  
	class UImage*                                      Image39;                                                    // 0x05B8   (0x0008)  
	class UImage*                                      Image40;                                                    // 0x05C0   (0x0008)  
	class UImage*                                      Image41;                                                    // 0x05C8   (0x0008)  
	class UImage*                                      Image_BlackBG;                                              // 0x05D0   (0x0008)  
	class UImage*                                      Image_BlackBG42;                                            // 0x05D8   (0x0008)  
	class UImage*                                      Image_BlackBG43;                                            // 0x05E0   (0x0008)  
	class UImage*                                      Image_BlackBG44;                                            // 0x05E8   (0x0008)  
	class UImage*                                      img_cutbg;                                                  // 0x05F0   (0x0008)  
	class UImage*                                      Img_Disable_Freeze;                                         // 0x05F8   (0x0008)  
	class UImage*                                      Img_Disable_Lock;                                           // 0x0600   (0x0008)  
	class UImage*                                      Img_Disable_Recycle;                                        // 0x0608   (0x0008)  
	class UImage*                                      img_erweima;                                                // 0x0610   (0x0008)  
	class UCanvasPanel*                                LeftMenuPanel;                                              // 0x0618   (0x0008)  
	class UImage*                                      Line;                                                       // 0x0620   (0x0008)  
	class UImage*                                      Logo;                                                       // 0x0628   (0x0008)  
	class UButton*                                     LookPrivilegeBtn;                                           // 0x0630   (0x0008)  
	class UOverlay*                                    LoopScrollArea;                                             // 0x0638   (0x0008)  
	class ULoopScrollBox_HD_C*                         LoopScrollBox;                                              // 0x0640   (0x0008)  
	class UOverlay*                                    Loopscrollbox_root;                                         // 0x0648   (0x0008)  
	class USizeBox*                                    Mall_Enter_Panel;                                           // 0x0650   (0x0008)  
	class UCanvasPanel*                                Mentor_Enter_Panel;                                         // 0x0658   (0x0008)  
	class UNamedSlot*                                  MoreBtnWidgetSlot;                                          // 0x0660   (0x0008)  
	class UNonMandatoryClickForFrontEnd_HD_C*          NonMandatoryClickForFrontEnd;                               // 0x0668   (0x0008)  
	class UNonMandatoryClickForFrontEnd_HD_C*          NonMandatoryClickForFrontEnd45;                             // 0x0670   (0x0008)  
	class UNonMandatoryClickForFrontEnd_HD_C*          NonMandatoryClickForFrontEnd_HD;                            // 0x0678   (0x0008)  
	class UCanvasPanel*                                PandoraPanel;                                               // 0x0680   (0x0008)  
	class UCanvasPanel*                                ParentCanvas;                                               // 0x0688   (0x0008)  
	class UCanvasPanel*                                PlatformIconPanel;                                          // 0x0690   (0x0008)  
	class UPlatformPrivilegesItem_HD_C*                PlatformPrivilegesItem;                                     // 0x0698   (0x0008)  
	class UPlayerAvatarIcon_HD_C*                      PlayerAvatarIcon;                                           // 0x06A0   (0x0008)  
	class UTextBlock*                                  PlayerName;                                                 // 0x06A8   (0x0008)  
	class UCanvasPanel*                                PMC_Tips;                                                   // 0x06B0   (0x0008)  
	class UWidgetSwitcher*                             PrivilegeBtnSwticher;                                       // 0x06B8   (0x0008)  
	class UProgressBar*                                progressExp;                                                // 0x06C0   (0x0008)  
	class UbtnEnter_03_C*                              QQBtn;                                                      // 0x06C8   (0x0008)  
	class USizeBox*                                    Question_EnterPanel;                                        // 0x06D0   (0x0008)  
	class UUAButton_C*                                 Ranked_Battle;                                              // 0x06D8   (0x0008)  
	class URedPoint_C*                                 RedPoint_Achievement;                                       // 0x06E0   (0x0008)  
	class URedPoint_C*                                 RedPoint_Activity;                                          // 0x06E8   (0x0008)  
	class URedPoint_C*                                 RedPoint_Clan;                                              // 0x06F0   (0x0008)  
	class URedPoint_C*                                 RedPoint_FirstCharge;                                       // 0x06F8   (0x0008)  
	class URedPoint_C*                                 RedPoint_GiftBag;                                           // 0x0700   (0x0008)  
	class URedPoint_C*                                 RedPoint_Mentor;                                            // 0x0708   (0x0008)  
	class URedPoint_HD_C*                              RedPoint_MoreBtn;                                           // 0x0710   (0x0008)  
	class URedPoint_C*                                 RedPoint_Question;                                          // 0x0718   (0x0008)  
	class URedPoint_C*                                 RedPoint_Role;                                              // 0x0720   (0x0008)  
	class URedPoint_C*                                 RedPoint_SeasonBP;                                          // 0x0728   (0x0008)  
	class URedPoint_C*                                 RedPoint_Task;                                              // 0x0730   (0x0008)  
	class URedPoint_C*                                 RedPoint_Task46;                                            // 0x0738   (0x0008)  
	class URedPoint_C*                                 RedPoint_TaskBtn;                                           // 0x0740   (0x0008)  
	class URedPoint_C*                                 RedPoint_Trading;                                           // 0x0748   (0x0008)  
	class URedPoint_C*                                 RedPoint_Wechatwelfare;                                     // 0x0750   (0x0008)  
	class URedTag_C*                                   RedTag;                                                     // 0x0758   (0x0008)  
	class URedTag_C*                                   RedTag47;                                                   // 0x0760   (0x0008)  
	class URedTag_C*                                   RedTag48;                                                   // 0x0768   (0x0008)  
	class URedTag_C*                                   RedTag49;                                                   // 0x0770   (0x0008)  
	class URedTag_C*                                   RedTag50;                                                   // 0x0778   (0x0008)  
	class UOverlay*                                    RightMenu;                                                  // 0x0780   (0x0008)  
	class UCanvasPanel*                                RootPanel;                                                  // 0x0788   (0x0008)  
	class UHorizontalBox*                              SCAV_Lock;                                                  // 0x0790   (0x0008)  
	class UCanvasPanel*                                SCAV_Msg;                                                   // 0x0798   (0x0008)  
	class UVerticalBox*                                SCAV_Tips;                                                  // 0x07A0   (0x0008)  
	class UCanvasPanel*                                SeasonBP_Enter_Panel;                                       // 0x07A8   (0x0008)  
	class UButton*                                     shequ02;                                                    // 0x07B0   (0x0008)  
	class UButton*                                     shequ0251;                                                  // 0x07B8   (0x0008)  
	class USizeBox*                                    SizeBox;                                                    // 0x07C0   (0x0008)  
	class UOverlay*                                    SliderShow;                                                 // 0x07C8   (0x0008)  
	class USubtitleMessage_C*                          SubtitleMessage;                                            // 0x07D0   (0x0008)  
	class UTaskCommon_BriefTips_C*                     TaskCommon_BriefTips;                                       // 0x07D8   (0x0008)  
	class UCanvasPanel*                                TaskPanel;                                                  // 0x07E0   (0x0008)  
	class UTeamUpTips_HD_C*                            TeamUpTips;                                                 // 0x07E8   (0x0008)  
	class UTextBlock*                                  Text_Disable_FreezeTime;                                    // 0x07F0   (0x0008)  
	class UTextBlock*                                  Text_Disable_Status;                                        // 0x07F8   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0800   (0x0008)  
	class UTextBlock*                                  textExpPercent;                                             // 0x0808   (0x0008)  
	class UTextBlock*                                  TextLevel;                                                  // 0x0810   (0x0008)  
	class UTextBlock*                                  TextLevel52;                                                // 0x0818   (0x0008)  
	class UThemeActivityEntranceBtn_HD_C*              ThemeActivityEntranceTemplate;                              // 0x0820   (0x0008)  
	class UImage*                                      TopNavigationBG;                                            // 0x0828   (0x0008)  
	class UCanvasPanel*                                TopPanel;                                                   // 0x0830   (0x0008)  
	class UTopRightBarPanel_HD_C*                      TopRightBar;                                                // 0x0838   (0x0008)  
	class UCanvasPanel*                                TradingEnterPanel;                                          // 0x0840   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget;                                               // 0x0848   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget53;                                             // 0x0850   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget54;                                             // 0x0858   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget55;                                             // 0x0860   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget56;                                             // 0x0868   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget57;                                             // 0x0870   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget58;                                             // 0x0878   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget59;                                             // 0x0880   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget60;                                             // 0x0888   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget61;                                             // 0x0890   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget62;                                             // 0x0898   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget63;                                             // 0x08A0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget64;                                             // 0x08A8   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget65;                                             // 0x08B0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_Achieevement;                                  // 0x08B8   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_AuctionHouse;                                  // 0x08C0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_Character;                                     // 0x08C8   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_Clan;                                          // 0x08D0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_Clan66;                                        // 0x08D8   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_Mall;                                          // 0x08E0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_Mentor;                                        // 0x08E8   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_QQBtn;                                         // 0x08F0   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_RedPoint_Wechatwelfare;                        // 0x08F8   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_SeasonBP;                                      // 0x0900   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_SeasonBP67;                                    // 0x0908   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_Trading;                                       // 0x0910   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_WeaponBuild;                                   // 0x0918   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_WechatBtn;                                     // 0x0920   (0x0008)  
	class UUAAnimWidget_C*                             UAAnimWidget_WechatWelfareBtn;                              // 0x0928   (0x0008)  
	class UUAButtonTablItem_HD_C*                      UAButton_More;                                              // 0x0930   (0x0008)  
	class UUAMoney_C*                                  UAMoney;                                                    // 0x0938   (0x0008)  
	class UUAPanel_HD_C*                               UAPanel;                                                    // 0x0940   (0x0008)  
	class UUAButtonTablItem_HD_C*                      UAPanelAvatar;                                              // 0x0948   (0x0008)  
	class UUAButtonTablItem_HD_C*                      UAPanelBigMap;                                              // 0x0950   (0x0008)  
	class UUAButtonTablItem_HD_C*                      UAPanelRanking;                                             // 0x0958   (0x0008)  
	class UUAButtonTablItem_HD_C*                      UAPanelShowRoom;                                            // 0x0960   (0x0008)  
	class UUAButtonTablItem_HD_C*                      UAPanelTaskBtn;                                             // 0x0968   (0x0008)  
	class UCanvasPanel*                                WeaponBuildEnterPanel;                                      // 0x0970   (0x0008)  
	class UbtnEnter_03_C*                              WechatBtn;                                                  // 0x0978   (0x0008)  
	class UbtnEnter_03_C*                              WechatWelfareBtn;                                           // 0x0980   (0x0008)  
	class UCanvasPanel*                                WechatWelfareCanvasPanel;                                   // 0x0988   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0990   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_IsCreateTeam;                                // 0x0998   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_PMC;                                         // 0x09A0   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_SCAV;                                        // 0x09A8   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_Scav_Msg;                                    // 0x09B0   (0x0008)  
	class UWrapBox*                                    WrapBox;                                                    // 0x09B8   (0x0008)  
	class UUserWidget*                                 MoreBtnWidget;                                              // 0x09C0   (0x0008)  
	class UUserWidget*                                 PromptPanel;                                                // 0x09C8   (0x0008)  
	FSlateBrush                                        Split_01;                                                   // 0x09D0   (0x0090)  
	FSlateBrush                                        Split_02;                                                   // 0x0A60   (0x0090)  
	class UUserWidget*                                 OBPatch;                                                    // 0x0AF0   (0x0008)  
	class UUserWidget*                                 OBRoomList;                                                 // 0x0AF8   (0x0008)  
	class UUAPanel_HD_C*                               UAPanel68;                                                  // 0x0B00   (0x0008)  
	FVector                                            PMCBtnOffset;                                               // 0x0B08   (0x000C)  
	FVector                                            SCAVBtnOffset;                                              // 0x0B14   (0x000C)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.SequenceEvent__ENTRYPOINTMainUIPanel_HD
	// void SequenceEvent__ENTRYPOINTMainUIPanel_HD();                                                                          // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.StayTunedToast
	// void StayTunedToast();                                                                                                   // [0x2c6ec20] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.OnMouseButtonDown
	// FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent);                                          // [0x3a75280] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.AttachNonMandatory
	// void AttachNonMandatory();                                                                                               // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.AttachMoreBtnWidget
	// void AttachMoreBtnWidget();                                                                                              // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.SequenceEvent
	// void SequenceEvent();                                                                                                    // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.UnlockPanel
	// void UnlockPanel();                                                                                                      // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.Construct
	// void Construct();                                                                                                        // [0x2c6ec20] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.OnClicked_Event
	// void OnClicked_Event();                                                                                                  // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.BndEvt__Button_PersonalInfo_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	// void BndEvt__Button_PersonalInfo_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();                   // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.BndEvt__Button_PersonalInfo_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	// void BndEvt__Button_PersonalInfo_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();                   // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.BndEvt__Button_PersonalInfo_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
	// void BndEvt__Button_PersonalInfo_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();                 // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/MainUI/MainUIPanel/MainUIPanel_HD.MainUIPanel_HD_C.ExecuteUbergraph_MainUIPanel_HD
	// void ExecuteUbergraph_MainUIPanel_HD(int32_t EntryPoint);                                                                // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/Advertisement/AdvertisementFacePaintPanel/AdvertisementFacePaintPanel.AdvertisementFacePaintPanel_C
/// Size: 0x0038 (56 bytes) (0x000288 - 0x0002C0) align 8 pad: 0x0000
class UAdvertisementFacePaintPanel_C : public UUserWidget
{ 
public:
	class UButton*                                     btnClose;                                                   // 0x0288   (0x0008)  
	class UButton*                                     BtnImage;                                                   // 0x0290   (0x0008)  
	class UCanvasPanel*                                CanvasPanel_image;                                          // 0x0298   (0x0008)  
	class UCanvasPanel*                                CanvasPanel_mask;                                           // 0x02A0   (0x0008)  
	class UImage*                                      Image_mask;                                                 // 0x02A8   (0x0008)  
	class UImage*                                      ShowImage;                                                  // 0x02B0   (0x0008)  
	class UUAPanel_C*                                  UAPanel;                                                    // 0x02B8   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Advertisement/AdvertisementFacePaintPanel/AdvertisementFacePaintPanel.AdvertisementFacePaintPanel_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/FightStylePanel_HD.FightStylePanel_HD_C
/// Size: 0x0020 (32 bytes) (0x000288 - 0x0002A8) align 8 pad: 0x0000
class UFightStylePanel_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UImage*                                      selectIcon;                                                 // 0x0290   (0x0008)  
	class UTextBlock*                                  StyleText;                                                  // 0x0298   (0x0008)  
	class UUAButton_HD_C*                              UAButton;                                                   // 0x02A0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/FightStylePanel_HD.FightStylePanel_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/FightStylePanel_HD.FightStylePanel_HD_C.BP_OnEntryReleased
	// void BP_OnEntryReleased();                                                                                               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/FightStylePanel_HD.FightStylePanel_HD_C.BP_OnItemExpansionChanged
	// void BP_OnItemExpansionChanged(bool bIsExpanded);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/FightStylePanel_HD.FightStylePanel_HD_C.BP_OnItemSelectionChanged
	// void BP_OnItemSelectionChanged(bool bIsSelected);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/FightStylePanel_HD.FightStylePanel_HD_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/FightStylePanel_HD.FightStylePanel_HD_C.ExecuteUbergraph_FightStylePanel_HD
	// void ExecuteUbergraph_FightStylePanel_HD(int32_t EntryPoint);                                                            // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/ChooseStyle_HD.ChooseStyle_HD_C
/// Size: 0x0038 (56 bytes) (0x000288 - 0x0002C0) align 8 pad: 0x0000
class UChooseStyle_HD_C : public UUserWidget
{ 
public:
	class UImage*                                      Image;                                                      // 0x0288   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0290   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x0298   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x02A0   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x02A8   (0x0008)  
	class UImage*                                      Image4;                                                     // 0x02B0   (0x0008)  
	class UListView*                                   StyleListView;                                              // 0x02B8   (0x0008)  
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/MaterialsItem.MaterialsItem_C
/// Size: 0x0088 (136 bytes) (0x000288 - 0x000310) align 8 pad: 0x0000
class UMaterialsItem_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UTextBlock*                                  Content;                                                    // 0x0290   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0298   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02A0   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02A8   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x02B0   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_BG;                                          // 0x02B8   (0x0008)  
	FSlateColor                                        Color_Red;                                                  // 0x02C0   (0x0028)  
	FSlateColor                                        Color_Yellow;                                               // 0x02E8   (0x0028)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/MaterialsItem.MaterialsItem_C.BP_OnEntryReleased
	// void BP_OnEntryReleased();                                                                                               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/MaterialsItem.MaterialsItem_C.BP_OnItemExpansionChanged
	// void BP_OnItemExpansionChanged(bool bIsExpanded);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/MaterialsItem.MaterialsItem_C.BP_OnItemSelectionChanged
	// void BP_OnItemSelectionChanged(bool bIsSelected);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/MaterialsItem.MaterialsItem_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/MaterialsItem.MaterialsItem_C.ExecuteUbergraph_MaterialsItem
	// void ExecuteUbergraph_MaterialsItem(int32_t EntryPoint);                                                                 // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpTeamSelectPanel/TeamupStateinfoItem_HD.TeamupStateinfoItem_HD_C
/// Size: 0x00C8 (200 bytes) (0x000288 - 0x000350) align 8 pad: 0x0000
class UTeamupStateinfoItem_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0290   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0298   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x02A0   (0x0008)  
	FSlateBrush                                        setIcon;                                                    // 0x02A8   (0x0090)  
	FText                                              SetText;                                                    // 0x0338   (0x0018)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpTeamSelectPanel/TeamupStateinfoItem_HD.TeamupStateinfoItem_HD_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpTeamSelectPanel/TeamupStateinfoItem_HD.TeamupStateinfoItem_HD_C.ExecuteUbergraph_TeamupStateinfoItem_HD
	// void ExecuteUbergraph_TeamupStateinfoItem_HD(int32_t EntryPoint);                                                        // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpTeamSelectPanel/TeamupStateinfo_HD.TeamupStateinfo_HD_C
/// Size: 0x0048 (72 bytes) (0x000288 - 0x0002D0) align 8 pad: 0x0000
class UTeamupStateinfo_HD_C : public UUserWidget
{ 
public:
	class UImage*                                      Image;                                                      // 0x0288   (0x0008)  
	class UTeamupStateinfoItem_HD_C*                   TeamupStateinfoItem;                                        // 0x0290   (0x0008)  
	class UTeamupStateinfoItem_HD_C*                   TeamupStateinfoItem0;                                       // 0x0298   (0x0008)  
	class UTeamupStateinfoItem_HD_C*                   TeamupStateinfoItem1;                                       // 0x02A0   (0x0008)  
	class UTeamupStateinfoItem_HD_C*                   TeamupStateinfoItem2;                                       // 0x02A8   (0x0008)  
	class UTeamupStateinfoItem_HD_C*                   TeamupStateinfoItem3;                                       // 0x02B0   (0x0008)  
	class UTeamupStateinfoItem_HD_C*                   TeamupStateinfoItem4;                                       // 0x02B8   (0x0008)  
	class UTeamupStateinfoItem_HD_C*                   TeamupStateinfoItem5;                                       // 0x02C0   (0x0008)  
	class UTeamupStateinfoItem_HD_C*                   TeamupStateinfoItem6;                                       // 0x02C8   (0x0008)  
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpTeamSelectPanel/PlayerRightClickMenu_Item.PlayerRightClickMenu_Item_C
/// Size: 0x0008 (8 bytes) (0x000288 - 0x000290) align 8 pad: 0x0000
class UPlayerRightClickMenu_Item_C : public UUserWidget
{ 
public:
	class UUAButton_HD_C*                              Btn;                                                        // 0x0288   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpTeamSelectPanel/PlayerRightClickMenu_Item.PlayerRightClickMenu_Item_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpTeamSelectPanel/PlayerRightClickMenu.PlayerRightClickMenu_C
/// Size: 0x0050 (80 bytes) (0x000288 - 0x0002D8) align 8 pad: 0x0000
class UPlayerRightClickMenu_C : public UUserWidget
{ 
public:
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item;                                  // 0x0288   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item0;                                 // 0x0290   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item1;                                 // 0x0298   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item2;                                 // 0x02A0   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item3;                                 // 0x02A8   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item4;                                 // 0x02B0   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item5;                                 // 0x02B8   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item6;                                 // 0x02C0   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item7;                                 // 0x02C8   (0x0008)  
	class UPlayerRightClickMenu_Item_C*                PlayerRightClickMenu_Item8;                                 // 0x02D0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpTeamSelectPanel/PlayerRightClickMenu.PlayerRightClickMenu_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/StatusButtonPanel.StatusButtonPanel_C
/// Size: 0x00E0 (224 bytes) (0x000288 - 0x000368) align 8 pad: 0x0000
class UStatusButtonPanel_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            LoopAnimation;                                              // 0x0290   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x0298   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x02A0   (0x0008)  
	class UButton*                                     Button;                                                     // 0x02A8   (0x0008)  
	class UImage*                                      EffectImg;                                                  // 0x02B0   (0x0008)  
	class UImage*                                      EffectImg0;                                                 // 0x02B8   (0x0008)  
	class UImage*                                      EffectImg1;                                                 // 0x02C0   (0x0008)  
	class UCanvasPanel*                                EquipIconArea;                                              // 0x02C8   (0x0008)  
	class UWidgetSwitcher*                             EquipIconSwitcher;                                          // 0x02D0   (0x0008)  
	class UCanvasPanel*                                HealthIconArea;                                             // 0x02D8   (0x0008)  
	class UWidgetSwitcher*                             HealthIconSwitcher;                                         // 0x02E0   (0x0008)  
	class UListView*                                   ListView_Status;                                            // 0x02E8   (0x0008)  
	class UImage*                                      ShineImg;                                                   // 0x02F0   (0x0008)  
	class UImage*                                      ShineImg2;                                                  // 0x02F8   (0x0008)  
	class UImage*                                      ShineImg3;                                                  // 0x0300   (0x0008)  
	class UButton*                                     Status_Btn;                                                 // 0x0308   (0x0008)  
	class UTooltipHoverWidget_HD_C*                    TooltipHoverWidget;                                         // 0x0310   (0x0008)  
	class UTooltipHoverWidget_HD_C*                    TooltipHoverWidget4;                                        // 0x0318   (0x0008)  
	class UTooltipHoverWidget_HD_C*                    TooltipHoverWidget5;                                        // 0x0320   (0x0008)  
	class UUAButton_HD_C*                              UAButton_HD;                                                // 0x0328   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0330   (0x0008)  
	TArray<FString>                                    IgnoreNameList;                                             // 0x0338   (0x0010)  
	FLinearColor                                       Color_Yellow;                                               // 0x0348   (0x0010)  
	FLinearColor                                       Color_Red;                                                  // 0x0358   (0x0010)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/StatusButtonPanel.StatusButtonPanel_C.BndEvt__Status_Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Status_Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                          // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/StatusButtonPanel.StatusButtonPanel_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();                              // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/StatusButtonPanel.StatusButtonPanel_C.ExecuteUbergraph_StatusButtonPanel
	// void ExecuteUbergraph_StatusButtonPanel(int32_t EntryPoint);                                                             // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/TeamUpMatchingId.TeamUpMatchingId_C
/// Size: 0x00B8 (184 bytes) (0x000288 - 0x000340) align 8 pad: 0x0000
class UTeamUpMatchingId_C : public UUserWidget
{ 
public:
	class UImage*                                      banIcon;                                                    // 0x0288   (0x0008)  
	class UButton*                                     Button;                                                     // 0x0290   (0x0008)  
	class UButton*                                     Button_Mic;                                                 // 0x0298   (0x0008)  
	class UImage*                                      DisconnectIcon;                                             // 0x02A0   (0x0008)  
	class UWidgetSwitcher*                             iconswitcher;                                               // 0x02A8   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02B0   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02B8   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x02C0   (0x0008)  
	class UButton*                                     Image_MicBan;                                               // 0x02C8   (0x0008)  
	class UButton*                                     Image_MicOff;                                               // 0x02D0   (0x0008)  
	class UButton*                                     Image_MicOff2;                                              // 0x02D8   (0x0008)  
	class UButton*                                     Image_MicOn;                                                // 0x02E0   (0x0008)  
	class UButton*                                     Image_MicOn3;                                               // 0x02E8   (0x0008)  
	class UImage*                                      InBattleIcon;                                               // 0x02F0   (0x0008)  
	class UImage*                                      leaderIcon;                                                 // 0x02F8   (0x0008)  
	class UWidgetSwitcher*                             MicOnOff;                                                   // 0x0300   (0x0008)  
	class UTextBlock*                                  NameText;                                                   // 0x0308   (0x0008)  
	class UImage*                                      readyIcon;                                                  // 0x0310   (0x0008)  
	class UCanvasPanel*                                speaking;                                                   // 0x0318   (0x0008)  
	class UUAButton_HD_C*                              UAButton_HD;                                                // 0x0320   (0x0008)  
	class UvoiceWave_HD_C*                             voiceWave_HD;                                               // 0x0328   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0330   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_SelfMicOnOff;                                // 0x0338   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/TeamUpMatchingId.TeamUpMatchingId_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/TeamUpMatchingId.TeamUpMatchingId_C.SetNameText
	// void SetNameText(FString NameStr);                                                                                       // [0x3a75280] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/ChatContentTips_HD.ChatContentTips_HD_C
/// Size: 0x0008 (8 bytes) (0x000288 - 0x000290) align 8 pad: 0x0000
class UChatContentTips_HD_C : public UUserWidget
{ 
public:
	class UTextBlock*                                  TextBlock;                                                  // 0x0288   (0x0008)  
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpPlatformPanel/TeamNameplateSub_HD.TeamNameplateSub_HD_C
/// Size: 0x0100 (256 bytes) (0x000288 - 0x000388) align 8 pad: 0x0000
class UTeamNameplateSub_HD_C : public UUserWidget
{ 
public:
	class UWidgetAnimation*                            MoveAnimation;                                              // 0x0288   (0x0008)  
	class UChatContentTips_HD_C*                       ChatContentTips;                                            // 0x0290   (0x0008)  
	class UChatContentTips_HD_C*                       ChatContentTips0;                                           // 0x0298   (0x0008)  
	class UChatContentTips_HD_C*                       ChatContentTips1;                                           // 0x02A0   (0x0008)  
	class UChatContentTips_HD_C*                       ChatContentTips2;                                           // 0x02A8   (0x0008)  
	class UChatContentTips_HD_C*                       ChatContentTips_HD;                                         // 0x02B0   (0x0008)  
	class UButton*                                     Mask;                                                       // 0x02B8   (0x0008)  
	class UTeamUpMatchingId_C*                         TeamUpMatchingId;                                           // 0x02C0   (0x0008)  
	class UTeamUpMatchingId_C*                         TeamUpMatchingId3;                                          // 0x02C8   (0x0008)  
	class UTeamUpMatchingId_C*                         TeamUpMatchingId4;                                          // 0x02D0   (0x0008)  
	class UTeamUpMatchingId_C*                         TeamUpMatchingId5;                                          // 0x02D8   (0x0008)  
	SDK_UNDEFINED(80,2608) /* TMap<FString, TWeakObjectPtr<UClass*>> */ __um(MapNameToClass);                      // 0x02E0   (0x0050)  
	SDK_UNDEFINED(80,2609) /* TMap<FString, UUserWidget*> */ __um(NameToWidgetInstance);                           // 0x0330   (0x0050)  
	int32_t                                            LeaderIconSlotInterval_Self;                                // 0x0380   (0x0004)  
	int32_t                                            LeaderIconSlotInterval;                                     // 0x0384   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpPlatformPanel/TeamNameplateSub_HD.TeamNameplateSub_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpPlatformPanel/TeamNameplateSub_HD.TeamNameplateSub_HD_C.LoadAndCreateWidget
	// class UUserWidget* LoadAndCreateWidget(FString SoftClassName);                                                           // [0x3a75280] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/TeamTargetItem.TeamTargetItem_C
/// Size: 0x0030 (48 bytes) (0x000288 - 0x0002B8) align 8 pad: 0x0000
class UTeamTargetItem_C : public UUserWidget
{ 
public:
	class UImage*                                      Image;                                                      // 0x0288   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0290   (0x0008)  
	class UImage*                                      Image_frame;                                                // 0x0298   (0x0008)  
	class UImage*                                      Select;                                                     // 0x02A0   (0x0008)  
	class UUAButton_C*                                 TeamTargetBtn;                                              // 0x02A8   (0x0008)  
	class UCanvasPanel*                                teamTargetItem;                                             // 0x02B0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/TeamTargetItem.TeamTargetItem_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/Weather.Weather_C
/// Size: 0x0110 (272 bytes) (0x000288 - 0x000398) align 8 pad: 0x0000
class UWeather_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0290   (0x0008)  
	class UTextBlock*                                  Text_MapTime;                                               // 0x0298   (0x0008)  
	class UTextBlock*                                  WeatherDesc;                                                // 0x02A0   (0x0008)  
	class UImage*                                      weatherIcon;                                                // 0x02A8   (0x0008)  
	FSlateBrush                                        Set_Icon;                                                   // 0x02B0   (0x0090)  
	FText                                              SetTime;                                                    // 0x0340   (0x0018)  
	FText                                              SetWeatherTex;                                              // 0x0358   (0x0018)  
	FSlateColor                                        In_Color_and_Opacity;                                       // 0x0370   (0x0028)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/Weather.Weather_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/Weather.Weather_C.ExecuteUbergraph_Weather
	// void ExecuteUbergraph_Weather(int32_t EntryPoint);                                                                       // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/PlayerInfo_HD.PlayerInfo_HD_C
/// Size: 0x01C8 (456 bytes) (0x000288 - 0x000450) align 8 pad: 0x0000
class UPlayerInfo_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x0290   (0x0008)  
	class UWidgetAnimation*                            InitAnimation;                                              // 0x0298   (0x0008)  
	class UImage*                                      banIcon;                                                    // 0x02A0   (0x0008)  
	class UImage*                                      bg_dark;                                                    // 0x02A8   (0x0008)  
	class UButton*                                     Btn_PlayerInformation;                                      // 0x02B0   (0x0008)  
	class UButton*                                     Button_Mic;                                                 // 0x02B8   (0x0008)  
	class UCanvasPanel*                                CanvasPanel;                                                // 0x02C0   (0x0008)  
	class UChooseStyle_HD_C*                           ChooseStyle;                                                // 0x02C8   (0x0008)  
	class UImage*                                      DisconnectIcon;                                             // 0x02D0   (0x0008)  
	class UWidgetSwitcher*                             iconswitcher;                                               // 0x02D8   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02E0   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02E8   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x02F0   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x02F8   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x0300   (0x0008)  
	class UImage*                                      Image4;                                                     // 0x0308   (0x0008)  
	class UImage*                                      Image_MicBan;                                               // 0x0310   (0x0008)  
	class UImage*                                      Image_MicOff;                                               // 0x0318   (0x0008)  
	class UImage*                                      Image_MicOff5;                                              // 0x0320   (0x0008)  
	class UImage*                                      Image_MicOn;                                                // 0x0328   (0x0008)  
	class UImage*                                      Image_MicOn6;                                               // 0x0330   (0x0008)  
	class UImage*                                      InBattleIcon;                                               // 0x0338   (0x0008)  
	class UImage*                                      leaderIcon;                                                 // 0x0340   (0x0008)  
	class UTextBlock*                                  levelTxt;                                                   // 0x0348   (0x0008)  
	class UTextBlock*                                  levelTxt7;                                                  // 0x0350   (0x0008)  
	class UOverlay*                                    MicLimitedTips;                                             // 0x0358   (0x0008)  
	class UWidgetSwitcher*                             MicOnOff;                                                   // 0x0360   (0x0008)  
	class UButton*                                     NoIcon;                                                     // 0x0368   (0x0008)  
	class UPlayerAvatarIcon_C*                         PlayerAvatar;                                               // 0x0370   (0x0008)  
	class UCanvasPanel*                                PlayerInfo;                                                 // 0x0378   (0x0008)  
	class UTextBlock*                                  PlayerName;                                                 // 0x0380   (0x0008)  
	class UPlayerRightClickMenu_C*                     PlayerRightClickMenu;                                       // 0x0388   (0x0008)  
	class UImage*                                      PlayerStyleBG;                                              // 0x0390   (0x0008)  
	class UButton*                                     PlayerStyleButton;                                          // 0x0398   (0x0008)  
	class UTextBlock*                                  PlayeStylerInfo;                                            // 0x03A0   (0x0008)  
	class UPrivilegeIcon_C*                            PrivilegeIcon;                                              // 0x03A8   (0x0008)  
	class UImage*                                      ProcessBarBG;                                               // 0x03B0   (0x0008)  
	class UProgressBar*                                ProgressBarBlood;                                           // 0x03B8   (0x0008)  
	class URankingStarItem_Min_C*                      RankingStarItem;                                            // 0x03C0   (0x0008)  
	class UTextBlock*                                  rankname;                                                   // 0x03C8   (0x0008)  
	class UImage*                                      readyIcon;                                                  // 0x03D0   (0x0008)  
	class UCanvasPanel*                                speaking;                                                   // 0x03D8   (0x0008)  
	class UStatusButtonPanel_C*                        StatusButtonPanel;                                          // 0x03E0   (0x0008)  
	class UButton*                                     StyleCancelBtn;                                             // 0x03E8   (0x0008)  
	class UImage*                                      styleTag;                                                   // 0x03F0   (0x0008)  
	class UImage*                                      styleTag8;                                                  // 0x03F8   (0x0008)  
	class UTeamupStateinfo_HD_C*                       TeamupStateinfo;                                            // 0x0400   (0x0008)  
	class UCanvasPanel*                                TeamupStateinfoCanvas;                                      // 0x0408   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0410   (0x0008)  
	class UUAButton_C*                                 UAButton;                                                   // 0x0418   (0x0008)  
	class UUAButton_HD_C*                              UAButton_HD;                                                // 0x0420   (0x0008)  
	class UvoiceWave_HD_C*                             voiceWave_HD;                                               // 0x0428   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0430   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher9;                                            // 0x0438   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher10;                                           // 0x0440   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_SelfMicOnOff;                                // 0x0448   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/PlayerInfo_HD.PlayerInfo_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/PlayerInfo_HD.PlayerInfo_HD_C.GetPlayerRightClickBP
	// void GetPlayerRightClickBP(class UClass*& PlayerRigntClickBP);                                                           // [0x3a75280] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/PlayerInfo_HD.PlayerInfo_HD_C.BndEvt__PlayerStyleButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__PlayerStyleButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                   // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamCommon/PlayerInfo_HD.PlayerInfo_HD_C.ExecuteUbergraph_PlayerInfo_HD
	// void ExecuteUbergraph_PlayerInfo_HD(int32_t EntryPoint);                                                                 // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamupInviteList/Inviteinfo.Inviteinfo_C
/// Size: 0x0028 (40 bytes) (0x000288 - 0x0002B0) align 8 pad: 0x0000
class UInviteinfo_C : public UUserWidget
{ 
public:
	class UUAButton_C*                                 Btn_In;                                                     // 0x0288   (0x0008)  
	class UCanvasPanel*                                newTip;                                                     // 0x0290   (0x0008)  
	class UTextBlock*                                  newTipTex;                                                  // 0x0298   (0x0008)  
	class UPlayerAvatarIcon_C*                         PlayerAvatar;                                               // 0x02A0   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/DragTeamAvatar_HD.DragTeamAvatar_HD_C
/// Size: 0x0018 (24 bytes) (0x000288 - 0x0002A0) align 8 pad: 0x0000
class UDragTeamAvatar_HD_C : public UUserWidget
{ 
public:
	class UCanvasPanel*                                __Root;                                                     // 0x0288   (0x0008)  
	SDK_UNDEFINED(16,2610) /* TArray<TEnumAsByte<EObjectTypeQuery>> */ __um(ObjectTypes);                          // 0x0290   (0x0010)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpMatchingPanel/DragTeamAvatar_HD.DragTeamAvatar_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C
/// Size: 0x03B4 (948 bytes) (0x000288 - 0x00063C) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UTeamUpMatchingPanel_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            Hover01;                                                    // 0x0290   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation_01;                                          // 0x0298   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation_01;                                           // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x02A8   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x02B0   (0x0008)  
	class UCanvasPanel*                                AboveTeamInfoSubPanel;                                      // 0x02B8   (0x0008)  
	class UHorizontalBox*                              Box_Tips;                                                   // 0x02C0   (0x0008)  
	class UUAButton_HD_C*                              Btn_ClosePopPanel;                                          // 0x02C8   (0x0008)  
	class UUAButton_HD_C*                              Btn_setting;                                                // 0x02D0   (0x0008)  
	class UTeamSimpleInfo_C*                           Button_Already;                                             // 0x02D8   (0x0008)  
	class UButton*                                     Button_CloseTipsPanel;                                      // 0x02E0   (0x0008)  
	class UTeamSimpleInfo_C*                           Button_Match;                                               // 0x02E8   (0x0008)  
	class UButton*                                     Button_Rank;                                                // 0x02F0   (0x0008)  
	class UTeamSimpleInfo_C*                           Button_Ready;                                               // 0x02F8   (0x0008)  
	class UTeamSimpleInfo_C*                           Button_Recycle;                                             // 0x0300   (0x0008)  
	class UUAButton_HD_C*                              Button_TeamUpAssistant;                                     // 0x0308   (0x0008)  
	class UButton*                                     Button_Tips;                                                // 0x0310   (0x0008)  
	class UCanvasPanel*                                Canvas_Cost;                                                // 0x0318   (0x0008)  
	class UCanvasPanel*                                CanvasPanel;                                                // 0x0320   (0x0008)  
	class UCanvasPanel*                                CanvasPanel_ModifyTeamBtn;                                  // 0x0328   (0x0008)  
	class UCanvasPanel*                                CanvasPanelRight;                                           // 0x0330   (0x0008)  
	class UUAButton_HD_C*                              CreateTeam;                                                 // 0x0338   (0x0008)  
	class UTextBlock*                                  CurTeamMode;                                                // 0x0340   (0x0008)  
	class UDragTeamAvatar_HD_C*                        DragTeamAvatar;                                             // 0x0348   (0x0008)  
	class UUAButton_HD_C*                              Exit_btn;                                                   // 0x0350   (0x0008)  
	class UImage*                                      Film_VFX;                                                   // 0x0358   (0x0008)  
	class UUAButton_C*                                 Gift_btn;                                                   // 0x0360   (0x0008)  
	class USizeBox*                                    GiftSizeBox;                                                // 0x0368   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0370   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0378   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x0380   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x0388   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x0390   (0x0008)  
	class UImage*                                      Image4;                                                     // 0x0398   (0x0008)  
	class UImage*                                      Image5;                                                     // 0x03A0   (0x0008)  
	class UImage*                                      Image6;                                                     // 0x03A8   (0x0008)  
	class UImage*                                      Image7;                                                     // 0x03B0   (0x0008)  
	class UImage*                                      Image8;                                                     // 0x03B8   (0x0008)  
	class UImage*                                      Image9;                                                     // 0x03C0   (0x0008)  
	class UImage*                                      Image10;                                                    // 0x03C8   (0x0008)  
	class UImage*                                      Image11;                                                    // 0x03D0   (0x0008)  
	class UCanvasPanel*                                Information_Team;                                           // 0x03D8   (0x0008)  
	class UUAButton_HD_C*                              Invite_Btn_HD;                                              // 0x03E0   (0x0008)  
	class UInviteinfo_C*                               Inviteinfo;                                                 // 0x03E8   (0x0008)  
	class UInviteinfo_C*                               Inviteinfo12;                                               // 0x03F0   (0x0008)  
	class UImage*                                      Line;                                                       // 0x03F8   (0x0008)  
	class UImage*                                      Logo;                                                       // 0x0400   (0x0008)  
	class UImage*                                      mapImage;                                                   // 0x0408   (0x0008)  
	class UImage*                                      mapImage13;                                                 // 0x0410   (0x0008)  
	class UImage*                                      mapImage14;                                                 // 0x0418   (0x0008)  
	class UUAButton_HD_C*                              ModifyTeamBtn;                                              // 0x0420   (0x0008)  
	class UUA_Check_C*                                 needTeamMate;                                               // 0x0428   (0x0008)  
	class UWidgetSwitcher*                             NeedTeamMateSwitcher;                                       // 0x0430   (0x0008)  
	class UPlayerInfo_HD_C*                            PlayerInfo_A;                                               // 0x0438   (0x0008)  
	class UPlayerInfo_HD_C*                            PlayerInfo_B;                                               // 0x0440   (0x0008)  
	class UPlayerInfo_HD_C*                            PlayerInfo_C;                                               // 0x0448   (0x0008)  
	class UPlayerInfo_HD_C*                            PlayerInfo_D;                                               // 0x0450   (0x0008)  
	class UHorizontalBox*                              PlayerNumber;                                               // 0x0458   (0x0008)  
	class USizeBox*                                    QualifyingIcon;                                             // 0x0460   (0x0008)  
	class USizeBox*                                    QualifyingIcon15;                                           // 0x0468   (0x0008)  
	class UUA_Check_C*                                 QualifyingTeamMate;                                         // 0x0470   (0x0008)  
	class UCanvasPanel*                                QualifyingTIps;                                             // 0x0478   (0x0008)  
	class URedPoint_C*                                 RedPoint_TaskBtn;                                           // 0x0480   (0x0008)  
	class UCanvasPanel*                                RootPanel;                                                  // 0x0488   (0x0008)  
	class UCanvasPanel*                                ScavCDCanvas;                                               // 0x0490   (0x0008)  
	class UWidgetSwitcher*                             ScavCDingBtnName;                                           // 0x0498   (0x0008)  
	class UTextBlock*                                  ScavCDTxt;                                                  // 0x04A0   (0x0008)  
	class UTextBlock*                                  ScavCDTxt16;                                                // 0x04A8   (0x0008)  
	class USizeBox*                                    SizeBox_ButtonBattle;                                       // 0x04B0   (0x0008)  
	class UTaskCommon_BriefTips_C*                     TaskCommon_BriefTips;                                       // 0x04B8   (0x0008)  
	class UWidgetSwitcher*                             TeamMessageInviteSwitcher;                                  // 0x04C0   (0x0008)  
	class UCanvasPanel*                                TeamMessagePanel;                                           // 0x04C8   (0x0008)  
	class UVerticalBox*                                TeamMsg_VerticalBox;                                        // 0x04D0   (0x0008)  
	class UTeamNameplateSub_HD_C*                      TeamNameplateSub_HD;                                        // 0x04D8   (0x0008)  
	class UTextBlock*                                  Text_MapName;                                               // 0x04E0   (0x0008)  
	class UTextBlock*                                  Text_PoolPlayerCount;                                       // 0x04E8   (0x0008)  
	class UTextBlock*                                  Text_TeamPlayerCount;                                       // 0x04F0   (0x0008)  
	class UTextBlock*                                  Text_Threshold;                                             // 0x04F8   (0x0008)  
	class UTextBlock*                                  Text_TicketNum;                                             // 0x0500   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0508   (0x0008)  
	class UTextBlock*                                  TextBlock17;                                                // 0x0510   (0x0008)  
	class UTextBlock*                                  TextBlock18;                                                // 0x0518   (0x0008)  
	class UImage*                                      tickImage;                                                  // 0x0520   (0x0008)  
	class UTips_HD_C*                                  Tips_HD;                                                    // 0x0528   (0x0008)  
	class UUAPanel_HD_C*                               UAPanel;                                                    // 0x0530   (0x0008)  
	class UUAButtonTablItem_HD_C*                      UAPanelBigMap;                                              // 0x0538   (0x0008)  
	class UUAButtonTablItem_HD_C*                      UAPanelTaskBtn;                                             // 0x0540   (0x0008)  
	class UUASpiegelImage_C*                           UASpiegelImage;                                             // 0x0548   (0x0008)  
	class UCanvasPanel*                                UnderTeamInfoSubPanel;                                      // 0x0550   (0x0008)  
	class UHorizontalBox*                              Value;                                                      // 0x0558   (0x0008)  
	class UWeather_C*                                  Weather;                                                    // 0x0560   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_ButtonBattle;                                // 0x0568   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher_Ratio;                                       // 0x0570   (0x0008)  
	SDK_UNDEFINED(40,2611) /* TWeakObjectPtr<UClass*> */ __um(TeamTargetSubItem);                                  // 0x0578   (0x0028)  
	SDK_UNDEFINED(16,2612) /* FMulticastInlineDelegate */ __um(NewEventDispatcher);                                // 0x05A0   (0x0010)  
	SDK_UNDEFINED(80,2613) /* TMap<FString, TWeakObjectPtr<UClass*>> */ __um(MapNameToClass);                      // 0x05B0   (0x0050)  
	FVector                                            PlayerInfo_A_Offset;                                        // 0x0600   (0x000C)  
	FVector                                            PlayerInfo_B_Offset;                                        // 0x060C   (0x000C)  
	FVector                                            PlayerInfo_C_Offset;                                        // 0x0618   (0x000C)  
	FVector                                            PlayerInfo_D_Offset;                                        // 0x0624   (0x000C)  
	FVector                                            PlayerInfo_XY_Offset;                                       // 0x0630   (0x000C)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.SequenceEvent__ENTRYPOINTTeamUpMatchingPanel_HD
	// void SequenceEvent__ENTRYPOINTTeamUpMatchingPanel_HD();                                                                  // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.LoadCreateWidget
	// class UUserWidget* LoadCreateWidget(FString SoftClassName);                                                              // [0x3a75280] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.UAPanelClose
	// void UAPanelClose(class UUAPanel_C* UAPanel);                                                                            // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.SequenceEvent
	// void SequenceEvent();                                                                                                    // [0x3a75280] BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.Construct
	// void Construct();                                                                                                        // [0x3a75280] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.BndEvt__Button_Rank_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_Rank_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                         // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.BndEvt__Button_Tips_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_Tips_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();                         // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.BndEvt__Button_CloseTipsPanel_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_CloseTipsPanel_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();               // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.ExecuteUbergraph_TeamUpMatchingPanel_HD
	// void ExecuteUbergraph_TeamUpMatchingPanel_HD(int32_t EntryPoint);                                                        // [0x3a75280] Final                
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpMatchingPanel/TeamUpMatchingPanel_HD.TeamUpMatchingPanel_HD_C.NewEventDispatcher_0__DelegateSignature
	// void NewEventDispatcher_0__DelegateSignature();                                                                          // [0x3a75280] Public|Delegate|BlueprintCallable|BlueprintEvent 
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTag_HD.TeamUpModelSelectTag_HD_C
/// Size: 0x0010 (16 bytes) (0x000288 - 0x000298) align 8 pad: 0x0000
class UTeamUpModelSelectTag_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UTextBlock*                                  TagText;                                                    // 0x0290   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTag_HD.TeamUpModelSelectTag_HD_C.BP_OnEntryReleased
	// void BP_OnEntryReleased();                                                                                               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTag_HD.TeamUpModelSelectTag_HD_C.BP_OnItemExpansionChanged
	// void BP_OnItemExpansionChanged(bool bIsExpanded);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTag_HD.TeamUpModelSelectTag_HD_C.BP_OnItemSelectionChanged
	// void BP_OnItemSelectionChanged(bool bIsSelected);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTag_HD.TeamUpModelSelectTag_HD_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTag_HD.TeamUpModelSelectTag_HD_C.ExecuteUbergraph_TeamUpModelSelectTag_HD
	// void ExecuteUbergraph_TeamUpModelSelectTag_HD(int32_t EntryPoint);                                                       // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTab_HD.TeamUpModelSelectTab_HD_C
/// Size: 0x0071 (113 bytes) (0x000288 - 0x0002F9) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class UTeamUpModelSelectTab_HD_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            ListInitAnimation;                                          // 0x0290   (0x0008)  
	class UWidgetAnimation*                            UnlockAnim;                                                 // 0x0298   (0x0008)  
	class UWidgetAnimation*                            UnselectedAnimation;                                        // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            HoverAnimation;                                             // 0x02A8   (0x0008)  
	class UImage*                                      bg;                                                         // 0x02B0   (0x0008)  
	class UButton*                                     ButtonItem;                                                 // 0x02B8   (0x0008)  
	class UWidgetSwitcher*                             Switcher_Status;                                            // 0x02C0   (0x0008)  
	class UTextBlock*                                  Text_DefaultSelected;                                       // 0x02C8   (0x0008)  
	class UTextBlock*                                  Text_FloatingSelection;                                     // 0x02D0   (0x0008)  
	class UTextBlock*                                  Text_lock;                                                  // 0x02D8   (0x0008)  
	class UTextBlock*                                  Text_Normal;                                                // 0x02E0   (0x0008)  
	class UTooltipHoverWidget_HD_C*                    TooltipHoverWidget_Gray;                                    // 0x02E8   (0x0008)  
	class UUnlockAnimation_C*                          UnlockAnimation;                                            // 0x02F0   (0x0008)  
	bool                                               bLock;                                                      // 0x02F8   (0x0001)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTab_HD.TeamUpModelSelectTab_HD_C.SetGrayState
	// void SetGrayState(bool isGray);                                                                                          // [0x3a75280] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTab_HD.TeamUpModelSelectTab_HD_C.BP_OnEntryReleased
	// void BP_OnEntryReleased();                                                                                               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTab_HD.TeamUpModelSelectTab_HD_C.BP_OnItemExpansionChanged
	// void BP_OnItemExpansionChanged(bool bIsExpanded);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTab_HD.TeamUpModelSelectTab_HD_C.BP_OnItemSelectionChanged
	// void BP_OnItemSelectionChanged(bool bIsSelected);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTab_HD.TeamUpModelSelectTab_HD_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTab_HD.TeamUpModelSelectTab_HD_C.BndEvt__ButtonItem_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__ButtonItem_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                          // [0x3a75280] BlueprintEvent       
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/TeamUpModelSelectTab_HD.TeamUpModelSelectTab_HD_C.ExecuteUbergraph_TeamUpModelSelectTab_HD
	// void ExecuteUbergraph_TeamUpModelSelectTab_HD(int32_t EntryPoint);                                                       // [0x3a75280] Final                
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/MouseWheelPanel_HD.MouseWheelPanel_HD_C
/// Size: 0x0008 (8 bytes) (0x000288 - 0x000290) align 8 pad: 0x0000
class UMouseWheelPanel_HD_C : public UUserWidget
{ 
public:
	class UCanvasPanel*                                __Root;                                                     // 0x0288   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/MouseWheelPanel_HD.MouseWheelPanel_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpModelSelectPanel/ModeSimpleItem.ModeSimpleItem_C
/// Size: 0x0008 (8 bytes) (0x000288 - 0x000290) align 8 pad: 0x0000
class UModeSimpleItem_C : public UUserWidget
{ 
public:
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0288   (0x0008)  
};

/// Class /Game/FrontEnd/UI/UMG/Teamup/TeamUpModelSelectPanel/TeamUpModelSelect_HD.TeamUpModelSelect_HD_C
/// Size: 0x00F4 (244 bytes) (0x000288 - 0x00037C) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UTeamUpModelSelect_HD_C : public UUserWidget
{ 
public:
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x0288   (0x0008)  
	class UWidgetAnimation*                            UATabHeaderCloseAnimation;                                  // 0x0290   (0x0008)  
	class UWidgetAnimation*                            UATabHeaderAnimation;                                       // 0x0298   (0x0008)  
	class UWidgetAnimation*                            SelectAnimation;                                            // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x02A8   (0x0008)  
	class UWidgetAnimation*                            OpenAnimation_Enter;                                        // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            UnselectedAnimation;                                        // 0x02B8   (0x0008)  
	class UWidgetAnimation*                            HoverAnimation;                                             // 0x02C0   (0x0008)  
	class UImage*                                      bg;                                                         // 0x02C8   (0x0008)  
	class UImage*                                      Bg_top;                                                     // 0x02D0   (0x0008)  
	class UImage*                                      Black;                                                      // 0x02D8   (0x0008)  
	class UButton*                                     Button;                                                     // 0x02E0   (0x0008)  
	class UImage*                                      Line;                                                       // 0x02E8   (0x0008)  
	class UImage*                                      Logo;                                                       // 0x02F0   (0x0008)  
	class UModeSimpleItem_C*                           ModeSimpleItem;                                             // 0x02F8   (0x0008)  
	class UModeSimpleItem_C*                           ModeSimpleItem0;                                            // 0x0300   (0x0008)  
	class UModeSimpleItem_C*                           ModeSimpleItem1;                                            // 0x0308   (0x0008)  
	class UMouseWheelPanel_HD_C*                       MouseWheelPanel_HD;                                         // 0x0310   (0x0008)  
	class UUAListView*                                 Tag;                                                        // 0x0318   (0x0008)  
	class UTextBlock*                                  Text_Title;                                                 // 0x0320   (0x0008)  
	class UTextBlock*                                  Tips;                                                       // 0x0328   (0x0008)  
	class UTextBlock*                                  Tips2;                                                      // 0x0330   (0x0008)  
	class UUAListView*                                 UAListView_ModeItem;                                        // 0x0338   (0x0008)  
	class UUAPanel_HD_C*                               UAPanel;                                                    // 0x0340   (0x0008)  
	class UUASimpleTabHeaderItem_C*                    UASimpleTabHeaderItem;                                      // 0x0348   (0x0008)  
	class UUASimpleTabHeaderItem_C*                    UASimpleTabHeaderItem3;                                     // 0x0350   (0x0008)  
	class UUASimpleTabHeaderItem_C*                    UASimpleTabHeaderItem4;                                     // 0x0358   (0x0008)  
	class UUATabHeader_C*                              UATabHeader;                                                // 0x0360   (0x0008)  
	class UVerticalBox*                                VerticalBox;                                                // 0x0368   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0370   (0x0008)  
	float                                              DelayWheel;                                                 // 0x0378   (0x0004)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/Teamup/TeamUpModelSelectPanel/TeamUpModelSelect_HD.TeamUpModelSelect_HD_C.GetModuleName
	// FString GetModuleName();                                                                                                 // [0x3a75280] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};
#pragma pack(pop)

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpSelectMapPanel/TramUpSelectMapWeatherItem.TramUpSelectMapWeatherItem_C
/// Size: 0x0040 (64 bytes) (0x000288 - 0x0002C8) align 8 pad: 0x0000
class UTramUpSelectMapWeatherItem_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            CloseAnimation;                                             // 0x0290   (0x0008)  
	class UWidgetAnimation*                            SelectAnimation;                                            // 0x0298   (0x0008)  
	class UWidgetAnimation*                            ListInitAnimation;                                          // 0x02A0   (0x0008)  
	class UImage*                                      IconWeather;                                                // 0x02A8   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02B0   (0x0008)  
	class UTextBlock*                                  timerDesc;                                                  // 0x02B8   (0x0008)  
	class UImage*                                      Weather;                                                    // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpSelectMapPanel/TramUpSelectMapWeatherItem.TramUpSelectMapWeatherItem_C.BP_OnEntryReleased
	// void BP_OnEntryReleased();                                                                                               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpSelectMapPanel/TramUpSelectMapWeatherItem.TramUpSelectMapWeatherItem_C.BP_OnItemExpansionChanged
	// void BP_OnItemExpansionChanged(bool bIsExpanded);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpSelectMapPanel/TramUpSelectMapWeatherItem.TramUpSelectMapWeatherItem_C.BP_OnItemSelectionChanged
	// void BP_OnItemSelectionChanged(bool bIsSelected);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpSelectMapPanel/TramUpSelectMapWeatherItem.TramUpSelectMapWeatherItem_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Game/FrontEnd/UI/UMG/TeamUp/TeamUpSelectMapPanel/TramUpSelectMapWeatherItem.TramUpSelectMapWeatherItem_C.ExecuteUbergraph_TramUpSelectMapWeatherItem
	// void ExecuteUbergraph_TramUpSelectMapWeatherItem(int32_t EntryPoint);                                                    // [0x3a75280] Final                
};

/// Class /Game/FrontEnd/UI/UMG/TeamUp/TeamUpSelectMapPanel/ActivityCarousel.ActivityCarousel_C
/// Size: 0x0040 (64 bytes) (0x000288 - 0x0002C8) align 8 pad: 0x0000
class UActivityCarousel_C : public UUserWidget
{ 
public:
	class UWidgetAnimation*                            OpenAnimation;                                              // 0x0288   (0x0008)  
	class UWidgetAnimation*                            ScrollEffectAni;                                            // 0x0290   (0x0008)  
	class UCanvasPanel*                                activityIcon;                                               // 0x0298   (0x0008)  
	class UTextBlock*                                  HuntText1;                                                  // 0x02A0   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02A8   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02B0   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x02B8   (0x0008)  
	class UProgressBar*                                ProgressBar;                                                // 0x02C0   (0x0008)  
};

/// Class /Game/FrontEnd/UI/UMG/FreshGuide/NonMandatoryClickForFrontEnd.NonMandatoryClickForFrontEnd_C
/// Size: 0x007C (124 bytes) (0x000288 - 0x000304) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UNonMandatoryClickForFrontEnd_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UWidgetAnimation*                            UpTipsAnimLoop;                                             // 0x0290   (0x0008)  
	class UWidgetAnimation*                            LeftTipsAnimationLoop;                                      // 0x0298   (0x0008)  
	class UWidgetAnimation*                            startanimation;                                             // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            EndAnimation;                                               // 0x02A8   (0x0008)  
	class UWidgetAnimation*                            DownTipsAnimLoop;                                           // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            RightTipsAnimLoop;                                          // 0x02B8   (0x0008)  
	class UWidgetSwitcher*                             GuideDirType;                                               // 0x02C0   (0x0008)  
	class UTextBlock*                                  tips0;                                                      // 0x02C8   (0x0008)  
	class UTextBlock*                                  tips1;                                                      // 0x02D0   (0x0008)  
	class UTextBlock*                                  tips2;                                                      // 0x02D8   (0x0008)  
	class UTextBlock*                                  tips3;                                                      // 0x02E0   (0x0008)  
	FText                                              Tip;                                                        // 0x02E8   (0x0018)  
	int32_t                                            Direction;                                                  // 0x0300   (0x0004)  


	/// Functions
