
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AIActionPointGeneratorRuntime
/// dependency: AIModule
/// dependency: AkAudio
/// dependency: CoreUObject
/// dependency: CoverGenerator
/// dependency: Engine
/// dependency: NavigationSystem

/// Enum /Script/MFNPCAI.EGraphAStarResult
/// Size: 0x01 (1 bytes)
enum class EGraphAStarResult : uint8_t
{
	EGraphAStarResult__WaitToSearch                                                  = 0,
	EGraphAStarResult__SearchFail                                                    = 1,
	EGraphAStarResult__SearchInProgress                                              = 2,
	EGraphAStarResult__SearchAborted                                                 = 3,
	EGraphAStarResult__SearchDone                                                    = 4,
	EGraphAStarResult__SearchSuccess                                                 = 5,
	EGraphAStarResult__GoalUnreachable                                               = 6,
	EGraphAStarResult__InfiniteLoop                                                  = 7,
	EGraphAStarResult__NotFound                                                      = 8,
	EGraphAStarResult__RequestNotFound                                               = 9
};

/// Enum /Script/MFNPCAI.ENPCAIGoDirectlyResult
/// Size: 0x01 (1 bytes)
enum class ENPCAIGoDirectlyResult : uint8_t
{
	ENPCAIGoDirectlyResult__Success                                                  = 0,
	ENPCAIGoDirectlyResult__ReachBoundary                                            = 1,
	ENPCAIGoDirectlyResult__AIPawnNotFound                                           = 2
};

/// Enum /Script/MFNPCAI.ENPCAIPerceptibleTile
/// Size: 0x01 (1 bytes)
enum class ENPCAIPerceptibleTile : uint8_t
{
	ENPCAIPerceptibleTile__None                                                      = 0,
	ENPCAIPerceptibleTile__Bomb                                                      = 1,
	ENPCAIPerceptibleTile__Stun                                                      = 2,
	ENPCAIPerceptibleTile__Smoke                                                     = 3,
	ENPCAIPerceptibleTile__Molotov                                                   = 4,
	ENPCAIPerceptibleTile__C4                                                        = 5,
	ENPCAIPerceptibleTile__Flash                                                     = 6,
	ENPCAIPerceptibleTile__FootSounder                                               = 7,
	ENPCAIPerceptibleTile__TearGas                                                   = 8,
	ENPCAIPerceptibleTile__OffensiveGrenade                                          = 9,
	ENPCAIPerceptibleTile__TripMine                                                  = 10,
	ENPCAIPerceptibleTile__ClaymoreMine                                              = 11,
	ENPCAIPerceptibleTile__SignalDetonator                                           = 12,
	ENPCAIPerceptibleTile__CustomIndex                                               = 13,
	ENPCAIPerceptibleTile__DefaultArea                                               = 14,
	ENPCAIPerceptibleTile__AvoidanceArea                                             = 15,
	ENPCAIPerceptibleTile__ObstacleArea                                              = 16,
	ENPCAIPerceptibleTile__ParadropArea                                              = 17,
	ENPCAIPerceptibleTile__Unknown                                                   = 18,
	ENPCAIPerceptibleTile__Max                                                       = 19
};

/// Enum /Script/MFNPCAI.EAISceneEventState
/// Size: 0x01 (1 bytes)
enum class EAISceneEventState : uint8_t
{
	EAISceneEventState__Trigger                                                      = 0,
	EAISceneEventState__Completed                                                    = 1,
	EAISceneEventState__Expired                                                      = 2,
	EAISceneEventState__Removed                                                      = 3
};

/// Enum /Script/MFNPCAI.EAIAimingType
/// Size: 0x01 (1 bytes)
enum class EAIAimingType : uint8_t
{
	Normal                                                                           = 0,
	Regular                                                                          = 1
};

/// Enum /Script/MFNPCAI.EAIAimStatus
/// Size: 0x04 (4 bytes)
enum class EAIAimStatus : uint32_t
{
	EAIAimStatus__Aiming                                                             = 0,
	EAIAimStatus__NoTarget                                                           = 1,
	EAIAimStatus__AimComplete                                                        = 2
};

/// Enum /Script/MFNPCAI.ENPCAIAsyncTaskType
/// Size: 0x01 (1 bytes)
enum class ENPCAIAsyncTaskType : uint8_t
{
	ENPCAIAsyncTaskType__None                                                        = 0,
	ENPCAIAsyncTaskType__FindAmbushAgainstPoint                                      = 1,
	ENPCAIAsyncTaskType__PeekPoint                                                   = 2,
	ENPCAIAsyncTaskType__FindPathByKeyRoute                                          = 3,
	ENPCAIAsyncTaskType__QueryRoundEnvironment                                       = 4
};

/// Enum /Script/MFNPCAI.ENPCPlaceForCheckType
/// Size: 0x01 (1 bytes)
enum class ENPCPlaceForCheckType : uint8_t
{
	ENPCPlaceForCheckType__Simple                                                    = 0,
	ENPCPlaceForCheckType__Danger                                                    = 1,
	ENPCPlaceForCheckType__Suspicious                                                = 2,
	ENPCPlaceForCheckType__Fatal                                                     = 3,
	ENPCPlaceForCheckType__GrenadeHit_Near                                           = 4,
	ENPCPlaceForCheckType__GrenadeHit_Far                                            = 5,
	ENPCPlaceForCheckType__GrenadeComeing                                            = 6,
	ENPCPlaceForCheckType__FarFootStep                                               = 7,
	ENPCPlaceForCheckType__CloseFootStep                                             = 8,
	ENPCPlaceForCheckType__FarGunFire                                                = 9,
	ENPCPlaceForCheckType__CloseGunFire                                              = 10,
	ENPCPlaceForCheckType__GrenadeHolding                                            = 11,
	ENPCPlaceForCheckType__Fuzzy                                                     = 12
};

/// Enum /Script/MFNPCAI.EAIProfileEditState
/// Size: 0x01 (1 bytes)
enum class EAIProfileEditState : uint8_t
{
	EAIProfileEditState__None                                                        = 0,
	EAIProfileEditState__ChoosingProperty                                            = 1,
	EAIProfileEditState__EditingProperty                                             = 2,
	EAIProfileEditState__Comparing                                                   = 3
};

/// Enum /Script/MFNPCAI.EAIProfileCoverType
/// Size: 0x01 (1 bytes)
enum class EAIProfileCoverType : uint8_t
{
	EAIProfileCoverType__CoverType_None                                              = 0,
	EAIProfileCoverType__CoverType_int32                                             = 1,
	EAIProfileCoverType__CoverType_int64                                             = 2,
	EAIProfileCoverType__CoverType_float                                             = 3,
	EAIProfileCoverType__CoverType_bool                                              = 4,
	EAIProfileCoverType__CoverType_Byte                                              = 5,
	EAIProfileCoverType__CoverType_Enum                                              = 6,
	EAIProfileCoverType__CoverType_Set                                               = 7,
	EAIProfileCoverType__CoverType_Array                                             = 8,
	EAIProfileCoverType__CoverType_Map                                               = 9,
	EAIProfileCoverType__CoverType_Vector                                            = 10,
	EAIProfileCoverType__CoverType_AIMindGoalEnemyAngleMultiple                      = 11,
	EAIProfileCoverType__CoverType_AIBodyBulkAimingChoice                            = 12,
	EAIProfileCoverType__CoverType_AISenseSightNormal                                = 13,
	EAIProfileCoverType__CoverType_String                                            = 14,
	EAIProfileCoverType__CoverType_Object                                            = 15,
	EAIProfileCoverType__CoverType_SoftClassPtr                                      = 16
};

/// Enum /Script/MFNPCAI.EAIGroupRequestFireTarget
/// Size: 0x01 (1 bytes)
enum class EAIGroupRequestFireTarget : uint8_t
{
	EAIGroupRequestFireTarget__Fire_Enemy                                            = 0,
	EAIGroupRequestFireTarget__Fire_Point                                            = 1
};

/// Enum /Script/MFNPCAI.EAIStateWarnPlayerRequest
/// Size: 0x01 (1 bytes)
enum class EAIStateWarnPlayerRequest : uint8_t
{
	EAIStateWarnPlayerRequest__Goto                                                  = 0,
	EAIStateWarnPlayerRequest__Say                                                   = 1,
	EAIStateWarnPlayerRequest__Wait                                                  = 2,
	EAIStateWarnPlayerRequest__Shoot                                                 = 3,
	EAIStateWarnPlayerRequest__Stay                                                  = 4
};

/// Enum /Script/MFNPCAI.ENPCAIMovementKind
/// Size: 0x01 (1 bytes)
enum class ENPCAIMovementKind : uint8_t
{
	ENPCAIMovementKind__GotoPoint                                                    = 0,
	ENPCAIMovementKind__GoDirectly                                                   = 1,
	ENPCAIMovementKind__GoAccordingToWayPoints                                       = 2
};

/// Enum /Script/MFNPCAI.ENPCAIMoveResult
/// Size: 0x01 (1 bytes)
enum class ENPCAIMoveResult : uint8_t
{
	ENPCAIMoveResult__None                                                           = 0,
	ENPCAIMoveResult__WaitPerform                                                    = 1,
	ENPCAIMoveResult__Succeeded                                                      = 2,
	ENPCAIMoveResult__Failed                                                         = 3,
	ENPCAIMoveResult__Aborted                                                        = 4,
	ENPCAIMoveResult__InProgress                                                     = 5
};

/// Enum /Script/MFNPCAI.EGetLinkUsageCountStatus
/// Size: 0x01 (1 bytes)
enum class EGetLinkUsageCountStatus : uint8_t
{
	EGetLinkUsageCountStatus__Success                                                = 0,
	EGetLinkUsageCountStatus__GetNavMeshManagerFailed                                = 1,
	EGetLinkUsageCountStatus__GetSourceRegionIndexFailed                             = 2,
	EGetLinkUsageCountStatus__GetTargetRegionIndexFailed                             = 3,
	EGetLinkUsageCountStatus__RegionIndexNotValidNodeIndex                           = 4,
	EGetLinkUsageCountStatus__RegionIndexNotValidAdjacencyIndex                      = 5,
	EGetLinkUsageCountStatus__Unreachable                                            = 6
};

/// Enum /Script/MFNPCAI.ENavSkeletonPointGetterFlag
/// Size: 0x01 (1 bytes)
enum class ENavSkeletonPointGetterFlag : uint8_t
{
	ENavSkeletonPointGetterFlag__None                                                = 0,
	ENavSkeletonPointGetterFlag__LinkId                                              = 1,
	ENavSkeletonPointGetterFlag__NeighbourIndices                                    = 2,
	ENavSkeletonPointGetterFlag__VisibleIndices                                      = 3,
	ENavSkeletonPointGetterFlag__All                                                 = 255
};

/// Enum /Script/MFNPCAI.ENavSkeletonDivergenceMethod
/// Size: 0x01 (1 bytes)
enum class ENavSkeletonDivergenceMethod : uint8_t
{
	ENavSkeletonDivergenceMethod__Laplacian                                          = 0,
	ENavSkeletonDivergenceMethod__GradientFlux                                       = 1,
	ENavSkeletonDivergenceMethod__Neighbour                                          = 2
};

/// Enum /Script/MFNPCAI.ENavSkeletonSamplePointKind
/// Size: 0x01 (1 bytes)
enum class ENavSkeletonSamplePointKind : uint8_t
{
	ENavSkeletonSamplePointKind__None                                                = 0,
	ENavSkeletonSamplePointKind__Isolate                                             = 1,
	ENavSkeletonSamplePointKind__Endpoint                                            = 2,
	ENavSkeletonSamplePointKind__Normal                                              = 3,
	ENavSkeletonSamplePointKind__KeptNormal                                          = 4,
	ENavSkeletonSamplePointKind__DoorLink                                            = 5,
	ENavSkeletonSamplePointKind__Junction                                            = 6
};

/// Enum /Script/MFNPCAI.ENavSkeletonSamplePointDropReason
/// Size: 0x01 (1 bytes)
enum class ENavSkeletonSamplePointDropReason : uint8_t
{
	ENavSkeletonSamplePointDropReason__None                                          = 0,
	ENavSkeletonSamplePointDropReason__CannotBeSkeletonPoint                         = 1,
	ENavSkeletonSamplePointDropReason__FindDistanceToWallFailed                      = 2,
	ENavSkeletonSamplePointDropReason__TooCloseToWall                                = 3,
	ENavSkeletonSamplePointDropReason__InvalidWallHitNormal                          = 4,
	ENavSkeletonSamplePointDropReason__MismatchedNeighbours                          = 5,
	ENavSkeletonSamplePointDropReason__InvalidGradientSize                           = 6,
	ENavSkeletonSamplePointDropReason__InvalidDivergence                             = 7,
	ENavSkeletonSamplePointDropReason__TooLessWallCount                              = 8,
	ENavSkeletonSamplePointDropReason__Isolated                                      = 9,
	ENavSkeletonSamplePointDropReason__NotMainPoint                                  = 10,
	ENavSkeletonSamplePointDropReason__CloseToAnotherMainPoint                       = 11,
	ENavSkeletonSamplePointDropReason__CannotFindProperPointToConnect                = 12,
	ENavSkeletonSamplePointDropReason__InvalidPointKind                              = 13,
	ENavSkeletonSamplePointDropReason__BeSimplified                                  = 14,
	ENavSkeletonSamplePointDropReason__InPrunedEndBranch                             = 15,
	ENavSkeletonSamplePointDropReason__Count                                         = 16
};

/// Enum /Script/MFNPCAI.EPathExistenceTestMode
/// Size: 0x01 (1 bytes)
enum class EPathExistenceTestMode : uint8_t
{
	EPathExistenceTestMode__Regular                                                  = 0,
	EPathExistenceTestMode__Hierarchical                                             = 1
};

/// Enum /Script/MFNPCAI.ENavAreaKind
/// Size: 0x01 (1 bytes)
enum class ENavAreaKind : uint8_t
{
	Burning                                                                          = 0,
	TearGas                                                                          = 1,
	TripMine                                                                         = 2,
	Claymore                                                                         = 3,
	Paradrop                                                                         = 4
};

/// Enum /Script/MFNPCAI.ENavMeshTileLabel
/// Size: 0x01 (1 bytes)
enum class ENavMeshTileLabel : uint8_t
{
	ENavMeshTileLabel__AllPolysReachable                                             = 0,
	ENavMeshTileLabel__PartialPolysReachable                                         = 1,
	ENavMeshTileLabel__InvalidBeginIndex                                             = 2,
	ENavMeshTileLabel__ConsiderUnreachablePolys                                      = 252,
	ENavMeshTileLabel__AllPolysUneachable                                            = 253,
	ENavMeshTileLabel__InvalidHeader                                                 = 254,
	ENavMeshTileLabel__Unknown                                                       = 255
};

/// Enum /Script/MFNPCAI.EMETIS_OBJTYPE
/// Size: 0x04 (4 bytes)
enum class EMETIS_OBJTYPE : uint32_t
{
	EMETIS_OBJTYPE__METIS_OBJTYPE_CUT                                                = 0,
	EMETIS_OBJTYPE__METIS_OBJTYPE_VOL                                                = 1,
	EMETIS_OBJTYPE__METIS_OBJTYPE_NODE                                               = 2
};

/// Enum /Script/MFNPCAI.EMETIS_RTYPE
/// Size: 0x04 (4 bytes)
enum class EMETIS_RTYPE : uint32_t
{
	EMETIS_RTYPE__METIS_RTYPE_FM                                                     = 0,
	EMETIS_RTYPE__METIS_RTYPE_GREEDY                                                 = 1,
	EMETIS_RTYPE__METIS_RTYPE_SEP2SIDED                                              = 2,
	EMETIS_RTYPE__METIS_RTYPE_SEP1SIDED                                              = 3
};

/// Enum /Script/MFNPCAI.EMETIS_IPTYPE
/// Size: 0x04 (4 bytes)
enum class EMETIS_IPTYPE : uint32_t
{
	EMETIS_IPTYPE__METIS_IPTYPE_GROW                                                 = 0,
	EMETIS_IPTYPE__METIS_IPTYPE_RANDOM                                               = 1,
	EMETIS_IPTYPE__METIS_IPTYPE_EDGE                                                 = 2,
	EMETIS_IPTYPE__METIS_IPTYPE_NODE                                                 = 3,
	EMETIS_IPTYPE__METIS_IPTYPE_METISRB                                              = 4
};

/// Enum /Script/MFNPCAI.EMETIS_CTYPE
/// Size: 0x04 (4 bytes)
enum class EMETIS_CTYPE : uint32_t
{
	EMETIS_CTYPE__METIS_CTYPE_RM                                                     = 0,
	EMETIS_CTYPE__METIS_CTYPE_SHEM                                                   = 1
};

/// Enum /Script/MFNPCAI.EMETIS_PTYPE
/// Size: 0x01 (1 bytes)
enum class EMETIS_PTYPE : uint8_t
{
	EMETIS_PTYPE__METIS_PTYPE_RB                                                     = 0,
	EMETIS_PTYPE__METIS_PTYPE_KWAY                                                   = 1
};

/// Enum /Script/MFNPCAI.EnumAIGrassType
/// Size: 0x01 (1 bytes)
enum class EnumAIGrassType : uint8_t
{
	EnumAIGrassType__E_Foliage                                                       = 0,
	EnumAIGrassType__E_Landscape                                                     = 1
};

/// Enum /Script/MFNPCAI.EnumAIGrassDebugBox
/// Size: 0x01 (1 bytes)
enum class EnumAIGrassDebugBox : uint8_t
{
	EnumAIGrassDebugBox__E_NONE                                                      = 0,
	EnumAIGrassDebugBox__E_Foliage                                                   = 1,
	EnumAIGrassDebugBox__E_Landscape                                                 = 2,
	EnumAIGrassDebugBox__E_FoliageCylinders                                          = 3,
	EnumAIGrassDebugBox__E_ALL                                                       = 4
};

/// Enum /Script/MFNPCAI.EAimingType
/// Size: 0x01 (1 bytes)
enum class EAimingType : uint8_t
{
	EAimingType__Normal                                                              = 0,
	EAimingType__Regular                                                             = 1
};

/// Enum /Script/MFNPCAI.ENPCAISceneEventID
/// Size: 0x01 (1 bytes)
enum class ENPCAISceneEventID : uint8_t
{
	ENPCAISceneEventID__None                                                         = 0,
	ENPCAISceneEventID__Armory_Alarm_EscapeG1                                        = 1,
	ENPCAISceneEventID__Armory_Alarm_EscapeWater                                     = 2,
	ENPCAISceneEventID__Valley_Alarm_BossHouse                                       = 3,
	ENPCAISceneEventID__Valley_Alarm_BossFactory                                     = 4,
	ENPCAISceneEventID__CallHelp                                                     = 5,
	ENPCAISceneEventID__ArmoryAlarmEscapeMine                                        = 6,
	ENPCAISceneEventID__TVStation_Escape_Elevator                                    = 7,
	ENPCAISceneEventID__ArmoryAlarmEscapeBunker                                      = 8,
	ENPCAISceneEventID__Call_Defender_TVStation                                      = 9
};

/// Enum /Script/MFNPCAI.ESteepZoneSamplePointDropReason
/// Size: 0x01 (1 bytes)
enum class ESteepZoneSamplePointDropReason : uint8_t
{
	ESteepZoneSamplePointDropReason__None                                            = 0,
	ESteepZoneSamplePointDropReason__InvalidTrace                                    = 1,
	ESteepZoneSamplePointDropReason__StartPenetrating                                = 2,
	ESteepZoneSamplePointDropReason__WalkableFloor                                   = 3,
	ESteepZoneSamplePointDropReason__NotEnoughNeighbours                             = 4,
	ESteepZoneSamplePointDropReason__Count                                           = 5
};

/// Enum /Script/MFNPCAI.ESteepZoneNavMeshPolyDropReason
/// Size: 0x01 (1 bytes)
enum class ESteepZoneNavMeshPolyDropReason : uint8_t
{
	ESteepZoneNavMeshPolyDropReason__None                                            = 0,
	ESteepZoneNavMeshPolyDropReason__GetTileAndPolyByRefFailed                       = 1,
	ESteepZoneNavMeshPolyDropReason__NotPoly                                         = 2,
	ESteepZoneNavMeshPolyDropReason__InvalidNormal                                   = 3,
	ESteepZoneNavMeshPolyDropReason__ValidIncludedAngle                              = 4,
	ESteepZoneNavMeshPolyDropReason__AllTrianglesDropped                             = 5,
	ESteepZoneNavMeshPolyDropReason__Count                                           = 6
};

/// Enum /Script/MFNPCAI.EAIKeyRouteQueryType
/// Size: 0x01 (1 bytes)
enum class EAIKeyRouteQueryType : uint8_t
{
	EAIKeyRouteQueryType__Safe                                                       = 0,
	EAIKeyRouteQueryType__Short                                                      = 1
};

/// Enum /Script/MFNPCAI.ENPCSetPartType
/// Size: 0x01 (1 bytes)
enum class ENPCSetPartType : uint8_t
{
	ENPCSetPartType__None                                                            = 0,
	ENPCSetPartType__Close                                                           = 1,
	ENPCSetPartType__Middle                                                          = 2,
	ENPCSetPartType__Far                                                             = 3
};

/// Enum /Script/MFNPCAI.EAITrackLOGType
/// Size: 0x01 (1 bytes)
enum class EAITrackLOGType : uint8_t
{
	EAITrackLOGType__Move                                                            = 0,
	EAITrackLOGType__AimingBodyPart                                                  = 1,
	EAITrackLOGType__AimingTime                                                      = 2,
	EAITrackLOGType__AimingPredestined                                               = 3,
	EAITrackLOGType__Shoot                                                           = 4,
	EAITrackLOGType__BeHit                                                           = 5,
	EAITrackLOGType__Decision                                                        = 6,
	EAITrackLOGType__Init                                                            = 7
};

/// Enum /Script/MFNPCAI.ENPCAITactic
/// Size: 0x01 (1 bytes)
enum class ENPCAITactic : uint8_t
{
	ENPCAITactic__None                                                               = 0,
	ENPCAITactic__CloseFight                                                         = 1,
	ENPCAITactic__MidFight                                                           = 2,
	ENPCAITactic__LongFight                                                          = 3,
	ENPCAITactic__RushFace                                                           = 4,
	ENPCAITactic__FlankAttack                                                        = 5,
	ENPCAITactic__BackAround                                                         = 6,
	ENPCAITactic__Hide                                                               = 7,
	ENPCAITactic__RunAway                                                            = 8
};

/// Enum /Script/MFNPCAI.EAIMainType
/// Size: 0x01 (1 bytes)
enum class EAIMainType : uint8_t
{
	EAIMainType__EAIMainType_Scav                                                    = 0,
	EAIMainType__EAIMainType_Boss                                                    = 1,
	EAIMainType__EAIMainType_Follower                                                = 2,
	EAIMainType__EAIMainType_PMCAI                                                   = 3,
	EAIMainType__EAIMainType_TeachingAI                                              = 4,
	EAIMainType__EAIMainType_TestAI                                                  = 5,
	EAIMainType__EAIMainType_Elit                                                    = 6,
	EAIMainType__EAIMainType_Elit_PlayerScavAI                                       = 7
};

/// Enum /Script/MFNPCAI.EAIEnemyVisibilityType
/// Size: 0x01 (1 bytes)
enum class EAIEnemyVisibilityType : uint8_t
{
	EAIEnemyVisibilityType__NotVisible                                               = 0,
	EAIEnemyVisibilityType__VisibleBySense                                           = 1,
	EAIEnemyVisibilityType__Visible                                                  = 2
};

/// Enum /Script/MFNPCAI.EAIEnemyPriority
/// Size: 0x01 (1 bytes)
enum class EAIEnemyPriority : uint8_t
{
	EAIEnemyPriority__EAIEnemyPriority_High                                          = 0,
	EAIEnemyPriority__EAIEnemyPriority_Medium                                        = 1,
	EAIEnemyPriority__EAIEnemyPriority_Low                                           = 2
};

/// Enum /Script/MFNPCAI.EAIAimingBodyPartTrend
/// Size: 0x01 (1 bytes)
enum class EAIAimingBodyPartTrend : uint8_t
{
	EAIAimingBodyPartTrend__None                                                     = 0,
	EAIAimingBodyPartTrend__Armor                                                    = 1,
	EAIAimingBodyPartTrend__NoArmor                                                  = 2,
	EAIAimingBodyPartTrend__Fatal                                                    = 3,
	EAIAimingBodyPartTrend__MinDamage                                                = 4
};

/// Enum /Script/MFNPCAI.EAIBodyBulkType
/// Size: 0x01 (1 bytes)
enum class EAIBodyBulkType : uint8_t
{
	EAIBodyBulkType__HeadGroup                                                       = 0,
	EAIBodyBulkType__BodyGroup                                                       = 1,
	EAIBodyBulkType__LegsGroup                                                       = 2
};

/// Enum /Script/MFNPCAI.EAIBodyPartType
/// Size: 0x01 (1 bytes)
enum class EAIBodyPartType : uint8_t
{
	EAIBodyPartType__EAIBodyPartType_Head                                            = 0,
	EAIBodyPartType__EAIBodyPartType_Chest                                           = 1,
	EAIBodyPartType__EAIBodyPartType_LefyArm                                         = 2,
	EAIBodyPartType__EAIBodyPartType_RightArm                                        = 3,
	EAIBodyPartType__EAIBodyPartType_LeftLeg                                         = 4,
	EAIBodyPartType__EAIBodyPartType_RightLeg                                        = 5,
	EAIBodyPartType__EAIBodyPartType_Stomach                                         = 6,
	EAIBodyPartType__EAIBodyPartType_Max                                             = 7
};

/// Enum /Script/MFNPCAI.EAISoundType
/// Size: 0x01 (1 bytes)
enum class EAISoundType : uint8_t
{
	EAISoundType__EAISoundType_ConfirmTargetScream                                   = 0
};

/// Enum /Script/MFNPCAI.EAIWorkResult
/// Size: 0x01 (1 bytes)
enum class EAIWorkResult : uint8_t
{
	EAIWorkResult__Success                                                           = 0,
	EAIWorkResult__Failed                                                            = 1,
	EAIWorkResult__Wait                                                              = 2
};

/// Enum /Script/MFNPCAI.EAISenseSightConf
/// Size: 0x01 (1 bytes)
enum class EAISenseSightConf : uint8_t
{
	EAISenseSightConf__Normal                                                        = 0,
	EAISenseSightConf__Night                                                         = 1,
	EAISenseSightConf__Light                                                         = 2
};

/// Enum /Script/MFNPCAI.ENPCAISenseChannel
/// Size: 0x01 (1 bytes)
enum class ENPCAISenseChannel : uint8_t
{
	ENPCAISenseChannel__NONE                                                         = 0,
	ENPCAISenseChannel__Weapon_Channel                                               = 15,
	ENPCAISenseChannel__AISight_Channel                                              = 25
};

/// Enum /Script/MFNPCAI.EAISenseType
/// Size: 0x01 (1 bytes)
enum class EAISenseType : uint8_t
{
	EAISenseType__ALL                                                                = 0,
	EAISenseType__Sight                                                              = 1,
	EAISenseType__Hearing                                                            = 2,
	EAISenseType__Damage                                                             = 3,
	EAISenseType__ComingExplosion                                                    = 4
};

/// Enum /Script/MFNPCAI.ENPCAISenseBarrier
/// Size: 0x01 (1 bytes)
enum class ENPCAISenseBarrier : uint8_t
{
	ENPCAISenseBarrier__None                                                         = 0,
	ENPCAISenseBarrier__Normal                                                       = 1,
	ENPCAISenseBarrier__Grass                                                        = 2,
	ENPCAISenseBarrier__ALLY                                                         = 3,
	ENPCAISenseBarrier__OtherEnemy                                                   = 4,
	ENPCAISenseBarrier__Smoke                                                        = 5
};

/// Enum /Script/MFNPCAI.ENPCAIPriority
/// Size: 0x01 (1 bytes)
enum class ENPCAIPriority : uint8_t
{
	ENPCAIPriority__Low                                                              = 0,
	ENPCAIPriority__Middle                                                           = 1,
	ENPCAIPriority__High                                                             = 2,
	ENPCAIPriority__Max                                                              = 3,
	ENPCAIPriority__COUNT                                                            = 4
};

/// Enum /Script/MFNPCAI.EAIGotoPointDecision
/// Size: 0x01 (1 bytes)
enum class EAIGotoPointDecision : uint8_t
{
	EAIGotoPointDecision__Normal                                                     = 0,
	EAIGotoPointDecision__SafetyDoor                                                 = 1,
	EAIGotoPointDecision__Swing                                                      = 2
};

/// Enum /Script/MFNPCAI.EAIGroupRequestPriority
/// Size: 0x01 (1 bytes)
enum class EAIGroupRequestPriority : uint8_t
{
	EAIGroupRequestPriority__Low                                                     = 0,
	EAIGroupRequestPriority__Normal                                                  = 1,
	EAIGroupRequestPriority__Top                                                     = 2,
	EAIGroupRequestPriority__Fatal                                                   = 3
};

/// Enum /Script/MFNPCAI.EAIProfileType
/// Size: 0x01 (1 bytes)
enum class EAIProfileType : uint8_t
{
	EAIProfileType__Aiming                                                           = 0,
	EAIProfileType__AIType                                                           = 1,
	EAIProfileType__Boss                                                             = 2,
	EAIProfileType__Core                                                             = 3,
	EAIProfileType__Curve                                                            = 4,
	EAIProfileType__Global                                                           = 5,
	EAIProfileType__Grenade                                                          = 6,
	EAIProfileType__Hearing                                                          = 7,
	EAIProfileType__Lay                                                              = 8,
	EAIProfileType__Look                                                             = 9,
	EAIProfileType__Mind                                                             = 10,
	EAIProfileType__Move                                                             = 11,
	EAIProfileType__Shoot                                                            = 12,
	EAIProfileType__Sound                                                            = 13,
	EAIProfileType__Weapon                                                           = 14,
	EAIProfileType__Damage                                                           = 15,
	EAIProfileType__Health                                                           = 16,
	EAIProfileType__PlayerActionReaction                                             = 17,
	EAIProfileType__BTBlock                                                          = 18,
	EAIProfileType__Strategy                                                         = 19,
	EAIProfileType__Smart                                                            = 20,
	EAIProfileType__Tactic                                                           = 21,
	EAIProfileType__RequestRun                                                       = 22
};

/// Enum /Script/MFNPCAI.ENPCAIDecision
/// Size: 0x01 (1 bytes)
enum class ENPCAIDecision : uint8_t
{
	ENPCAIDecision__None                                                             = 0,
	ENPCAIDecision__RushFaceWhenDisable                                              = 1,
	ENPCAIDecision__ShootFromCover                                                   = 2,
	ENPCAIDecision__ShootFromGround                                                  = 3,
	ENPCAIDecision__ShootPrecisely                                                   = 4,
	ENPCAIDecision__RushFaceWithAlly                                                 = 5,
	ENPCAIDecision__FindCoverToHide                                                  = 6,
	ENPCAIDecision__ChangeCoverAfterNotSafe                                          = 7,
	ENPCAIDecision__MoveFurther                                                      = 8,
	ENPCAIDecision__MoveCloser                                                       = 9,
	ENPCAIDecision__MoveToFlank                                                      = 10,
	ENPCAIDecision__MoveToAttackPoint                                                = 11,
	ENPCAIDecision__ChangeCover                                                      = 12,
	ENPCAIDecision__SearchEnemy                                                      = 13,
	ENPCAIDecision__HoldPosition                                                     = 14,
	ENPCAIDecision__BackToCover                                                      = 15,
	ENPCAIDecision__DogFight                                                         = 16,
	ENPCAIDecision__CautionInPlace                                                   = 17,
	ENPCAIDecision__CautionInCover                                                   = 18,
	ENPCAIDecision__CheckSuspiciousPoint                                             = 19,
	ENPCAIDecision__SuspiciousPointClear                                             = 20,
	ENPCAIDecision__GoToNextPathNode                                                 = 21,
	ENPCAIDecision__FollowTargetBoss                                                 = 22,
	ENPCAIDecision__StandAndLookAround                                               = 23,
	ENPCAIDecision__PacingInPlace                                                    = 24,
	ENPCAIDecision__TakeMedicine                                                     = 25,
	ENPCAIDecision__CallHelp                                                         = 26,
	ENPCAIDecision__RushStrike                                                       = 27,
	ENPCAIDecision__RushFace                                                         = 28,
	ENPCAIDecision__LootNearby                                                       = 29,
	ENPCAIDecision__DodgeGrenade                                                     = 30,
	ENPCAIDecision__ThrowGrenade                                                     = 31,
	ENPCAIDecision__WaitInEscapeVolume                                               = 32,
	ENPCAIDecision__ShootFootstepCreator                                             = 33,
	ENPCAIDecision__KillDBNOEnemy                                                    = 34,
	ENPCAIDecision__SneakApproaching                                                 = 35,
	ENPCAIDecision__ReloadInGround                                                   = 36,
	ENPCAIDecision__ReloadInCover                                                    = 37,
	ENPCAIDecision__Overwatch                                                        = 38,
	ENPCAIDecision__ActiveAlarmDevice                                                = 39,
	ENPCAIDecision__Escape                                                           = 40,
	ENPCAIDecision__DodgeFire                                                        = 41,
	ENPCAIDecision__ThrowSmoke                                                       = 42,
	ENPCAIDecision__ProneShoot                                                       = 43,
	ENPCAIDecision__FindPronePoint                                                   = 44,
	ENPCAIDecision__CrouchShoot                                                      = 45,
	ENPCAIDecision__ProneSuppress                                                    = 46,
	ENPCAIDecision__CrouchSuppress                                                   = 47,
	ENPCAIDecision__StandSuppress                                                    = 48,
	ENPCAIDecision__DualCharge                                                       = 49,
	ENPCAIDecision__DualGuard                                                        = 50,
	ENPCAIDecision__Retreat                                                          = 51,
	ENPCAIDecision__ChangeCoverAfterNotAdvantage                                     = 52,
	ENPCAIDecision__QuickToHide                                                      = 53,
	ENPCAIDecision__ChangeCoverToCrouch                                              = 54,
	ENPCAIDecision__CrouchAimingInCover                                              = 55,
	ENPCAIDecision__CallForHelp                                                      = 56,
	ENPCAIDecision__RidiculeVoice                                                    = 57,
	ENPCAIDecision__StayInPlace                                                      = 58,
	ENPCAIDecision__PositionAdjustment                                               = 59,
	ENPCAIDecision__DodgeAttackMove                                                  = 60,
	ENPCAIDecision__MoveToLocNeedArrive                                              = 61,
	ENPCAIDecision__SmokeToAssistHide                                                = 62,
	ENPCAIDecision__TacticAction_RushFace                                            = 63,
	ENPCAIDecision__GrenadeToPeek                                                    = 64,
	ENPCAIDecision__DodgeGrenadeHold                                                 = 65,
	ENPCAIDecision__TeamMove                                                         = 66,
	ENPCAIDecision__ThrowStepCreator                                                 = 67,
	ENPCAIDecision__SuppressionChangeClose                                           = 68,
	ENPCAIDecision__SuppressionInPlace                                               = 69,
	ENPCAIDecision__SuppressionControlDistance                                       = 70,
	ENPCAIDecision__SuppressionDoor                                                  = 71,
	ENPCAIDecision__OutBattleVolume                                                  = 72,
	ENPCAIDecision__SlientDefenseDoor                                                = 73,
	ENPCAIDecision__SlientDefenseChangeFar                                           = 74,
	ENPCAIDecision__SlientDefenseControlDistance                                     = 75,
	ENPCAIDecision__HoldAreaWithWall                                                 = 76,
	ENPCAIDecision__HoldRoomWithWall                                                 = 77,
	ENPCAIDecision__FootStepCreatorMoveClose                                         = 78,
	ENPCAIDecision__FootStepCreatorMoveFar                                           = 79,
	ENPCAIDecision__OpenDoorRush                                                     = 80,
	ENPCAIDecision__OpenDoorSlient                                                   = 81,
	ENPCAIDecision__MoveToDoorSafePoint                                              = 82,
	ENPCAIDecision__EscapeRush                                                       = 83,
	ENPCAIDecision__EscapeSlient                                                     = 84,
	ENPCAIDecision__DodgeFlashProjectile                                             = 85,
	ENPCAIDecision__RandomRangeShoot                                                 = 86,
	ENPCAIDecision__GrassMove                                                        = 87,
	ENPCAIDecision__ProtectSafeBox                                                   = 88,
	ENPCAIDecision__PeekFromPeekMark                                                 = 89,
	ENPCAIDecision__PlaceTrapDevice                                                  = 90,
	ENPCAIDecision__CallHelpOnHit                                                    = 91,
	ENPCAIDecision__AroundFindEnemy                                                  = 92,
	ENPCAIDecision__AlwaysReload                                                     = 93,
	ENPCAIDecision__MeleeAttackOnReload                                              = 94,
	ENPCAIDecision__TakeMedicineOnHit                                                = 95,
	ENPCAIDecision__FoolShootOnHit                                                   = 96,
	ENPCAIDecision__BattleShow                                                       = 97,
	ENPCAIDecision__OutOfBattleAct                                                   = 98,
	ENPCAIDecision__OutOfAllyRange                                                   = 99
};

/// Enum /Script/MFNPCAI.EAIPerformance
/// Size: 0x01 (1 bytes)
enum class EAIPerformance : uint8_t
{
	EAIPerformance__None                                                             = 0,
	EAIPerformance__Camp1                                                            = 1,
	EAIPerformance__Camp2                                                            = 2,
	EAIPerformance__Camp3                                                            = 3,
	EAIPerformance__Camp4                                                            = 4,
	EAIPerformance__Camp5                                                            = 5,
	EAIPerformance__Camp6                                                            = 6,
	EAIPerformance__Camp7                                                            = 7,
	EAIPerformance__Camp8                                                            = 8,
	EAIPerformance__Camp9                                                            = 9,
	EAIPerformance__Camp10                                                           = 10,
	EAIPerformance__Camp11                                                           = 11,
	EAIPerformance__Camp12                                                           = 12,
	EAIPerformance__Boss1                                                            = 13,
	EAIPerformance__Boss2                                                            = 14,
	EAIPerformance__Boss3                                                            = 15,
	EAIPerformance__Boss4                                                            = 16,
	EAIPerformance__Boss5                                                            = 17,
	EAIPerformance__Boss519                                                          = 18,
	EAIPerformance__Boss520                                                          = 19,
	EAIPerformance__Boss                                                             = 20,
	EAIPerformance__EventBoss1                                                       = 21,
	EAIPerformance__EventBoss2                                                       = 22,
	EAIPerformance__EventFollower1                                                   = 23,
	EAIPerformance__EventFollower2                                                   = 24,
	EAIPerformance__Follower1                                                        = 25,
	EAIPerformance__Follower2                                                        = 26,
	EAIPerformance__Follower3                                                        = 27,
	EAIPerformance__Follower4                                                        = 28,
	EAIPerformance__Follower5                                                        = 29,
	EAIPerformance__Follower531                                                      = 30,
	EAIPerformance__Follower_6                                                       = 31,
	EAIPerformance__Follower_633                                                     = 32,
	EAIPerformance__Follower_634                                                     = 33,
	EAIPerformance__Follower_635                                                     = 34,
	EAIPerformance__Follower_636                                                     = 35,
	EAIPerformance__Follower_637                                                     = 36,
	EAIPerformance__PMC1                                                             = 37,
	EAIPerformance__PlayerScav1                                                      = 38
};

/// Enum /Script/MFNPCAI.EAISenseSourceType
/// Size: 0x01 (1 bytes)
enum class EAISenseSourceType : uint8_t
{
	EAISenseSourceType__EAISenseSourceType_Grenade                                   = 0
};

/// Enum /Script/MFNPCAI.EBlackboardEntryCondition
/// Size: 0x01 (1 bytes)
enum class EBlackboardEntryCondition : uint8_t
{
	EBlackboardEntryCondition__BlackboardEntryCondition_Equal                        = 0,
	EBlackboardEntryCondition__BlackboardEntryCondition_Greater                      = 1,
	EBlackboardEntryCondition__BlackboardEntryCondition_Less                         = 2
};

/// Enum /Script/MFNPCAI.ENPCKnowWeather
/// Size: 0x01 (1 bytes)
enum class ENPCKnowWeather : uint8_t
{
	ENPCKnowWeather__Normal                                                          = 0,
	ENPCKnowWeather__Fog                                                             = 1
};

/// Enum /Script/MFNPCAI.ENPCWeakenDebuffType
/// Size: 0x01 (1 bytes)
enum class ENPCWeakenDebuffType : uint8_t
{
	ENPCWeakenDebuffType__LoseSight                                                  = 0,
	ENPCWeakenDebuffType__Tinnitus                                                   = 1,
	ENPCWeakenDebuffType__Slowdown                                                   = 2
};

/// Enum /Script/MFNPCAI.ENPCPanicType
/// Size: 0x01 (1 bytes)
enum class ENPCPanicType : uint8_t
{
	ENPCPanicType__None                                                              = 0,
	ENPCPanicType__Run                                                               = 1,
	ENPCPanicType__Crouch                                                            = 2,
	ENPCPanicType__Prone                                                             = 3
};

/// Enum /Script/MFNPCAI.EAIMoveType
/// Size: 0x01 (1 bytes)
enum class EAIMoveType : uint8_t
{
	EAIMoveType__AIMoveType_Walk                                                     = 0,
	EAIMoveType__AIMoveType_Run                                                      = 1,
	EAIMoveType__AIMoveType_Sprint                                                   = 2
};

/// Enum /Script/MFNPCAI.EAILeanType
/// Size: 0x01 (1 bytes)
enum class EAILeanType : uint8_t
{
	EAILeanType__AILeanType_Center                                                   = 0,
	EAILeanType__AILeanType_Left                                                     = 1,
	EAILeanType__AILeanType_Right                                                    = 2
};

/// Enum /Script/MFNPCAI.EAIPose
/// Size: 0x01 (1 bytes)
enum class EAIPose : uint8_t
{
	EAIPose__AIPose_Stand                                                            = 0,
	EAIPose__AIPose_Crouch                                                           = 1,
	EAIPose__AIPose_Prone                                                            = 2,
	EAIPose__AIPose_Slide                                                            = 3,
	EAIPose__AIPose_Move                                                             = 4
};

/// Enum /Script/MFNPCAI.EAISpecialFireType
/// Size: 0x01 (1 bytes)
enum class EAISpecialFireType : uint8_t
{
	EAISpecialFireType__EAISpecialFireType_Miss                                      = 0
};

/// Enum /Script/MFNPCAI.EAILookPointMode
/// Size: 0x01 (1 bytes)
enum class EAILookPointMode : uint8_t
{
	EAILookPointMode__ToMovingDirection                                              = 0,
	EAILookPointMode__ToCustomPoint                                                  = 1,
	EAILookPointMode__NoSteering                                                     = 2
};

/// Class /Script/MFNPCAI.NPCBTService_BlueprintBase
/// Size: 0x0028 (40 bytes) (0x000070 - 0x000098) align 8 pad: 0x0000
class UNPCBTService_BlueprintBase : public UBTService
{ 
public:
	bool                                               bAsSharedInstance;                                          // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
	class AAIController*                               AIOwner;                                                    // 0x0078   (0x0008)  
	unsigned char                                      UnknownData01_6[0x14];                                      // 0x0080   (0x0014)  MISSED
	bool                                               bShowPropertyDetails : 1;                                   // 0x0094:0 (0x0001)  
	bool                                               bShowEventDetails : 1;                                      // 0x0094:1 (0x0001)  
	unsigned char                                      UnknownData02_7[0x3];                                       // 0x0095   (0x0003)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.ReceiveTickAI
	// void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.ReceiveTick
	// void ReceiveTick(class AActor* OwnerActor, float DeltaSeconds);                                                          // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.ReceiveSearchStartAI
	// void ReceiveSearchStartAI(class AAIController* OwnerController, class APawn* ControlledPawn);                            // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.ReceiveSearchStart
	// void ReceiveSearchStart(class AActor* OwnerActor);                                                                       // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.ReceiveDeactivationAI
	// void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);                           // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.ReceiveDeactivation
	// void ReceiveDeactivation(class AActor* OwnerActor);                                                                      // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.ReceiveActivationAI
	// void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);                             // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.ReceiveActivation
	// void ReceiveActivation(class AActor* OwnerActor);                                                                        // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.IsServiceActive
	// bool IsServiceActive();                                                                                                  // [0x2e19560] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.GetOwnerPawn
	// class APawn* GetOwnerPawn();                                                                                             // [0x2e19530] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCBTService_BlueprintBase.GetOwnerController
	// class AAIController* GetOwnerController();                                                                               // [0x2e19500] Final|Native|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/MFNPCAI.NPCBTTask_BlueprintBase
/// Size: 0x0038 (56 bytes) (0x000070 - 0x0000A8) align 8 pad: 0x0000
class UNPCBTTask_BlueprintBase : public UBTTaskNode
{ 
public:
	bool                                               bAsSharedInstance;                                          // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
	class AAIController*                               AIOwner;                                                    // 0x0078   (0x0008)  
	FIntervalCountdown                                 TickInterval;                                               // 0x0080   (0x0008)  
	unsigned char                                      UnknownData01_6[0x1C];                                      // 0x0088   (0x001C)  MISSED
	bool                                               bShowPropertyDetails : 1;                                   // 0x00A4:0 (0x0001)  
	unsigned char                                      UnknownData02_7[0x3];                                       // 0x00A5   (0x0003)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.SetFinishOnMessageWithId
	// void SetFinishOnMessageWithId(FName MessageName, int32_t RequestID);                                                     // [0x2e19680] Final|Native|Protected|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.SetFinishOnMessage
	// void SetFinishOnMessage(FName MessageName);                                                                              // [0x2e195f0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.ReceiveTickAI
	// void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);               // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.ReceiveTick
	// void ReceiveTick(class AActor* OwnerActor, float DeltaSeconds);                                                          // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.ReceiveExecute
	// void ReceiveExecute(class AActor* OwnerActor);                                                                           // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.ReceiveAbortAI
	// void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                  // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.ReceiveAbort
	// void ReceiveAbort(class AActor* OwnerActor);                                                                             // [0x3a75280] Event|Protected|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.IsTaskExecuting
	// bool IsTaskExecuting();                                                                                                  // [0x2e195c0] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.IsTaskAborting
	// bool IsTaskAborting();                                                                                                   // [0x2e19590] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.GetOwnerPawn
	// class APawn* GetOwnerPawn();                                                                                             // [0x2e19530] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.GetOwnerController
	// class AAIController* GetOwnerController();                                                                               // [0x2e19500] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.FinishExecute
	// void FinishExecute(bool bSuccess);                                                                                       // [0x2e19470] Final|Native|Protected|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCBTTask_BlueprintBase.FinishAbort
	// void FinishAbort();                                                                                                      // [0x2e19450] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCBTTask_LatenTaskBase
/// Size: 0x0008 (8 bytes) (0x0000A8 - 0x0000B0) align 8 pad: 0x0000
class UNPCBTTask_LatenTaskBase : public UNPCBTTask_BlueprintBase
{ 
public:
	float                                              TaskDuration;                                               // 0x00A8   (0x0004)  
	float                                              StartTime;                                                  // 0x00AC   (0x0004)  
};

/// Class /Script/MFNPCAI.NPCAINavModifierVolume
/// Size: 0x0020 (32 bytes) (0x000330 - 0x000350) align 8 pad: 0x0000
class ANPCAINavModifierVolume : public ANavModifierVolume
{ 
public:
	TArray<int64_t>                                    AffectedPolygons;                                           // 0x0330   (0x0010)  
	TArray<class ANPCAINavLinkProxy*>                  AffectedNavLinks;                                           // 0x0340   (0x0010)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavModifierVolume.SetupNavNodesAreaID
	// void SetupNavNodesAreaID();                                                                                              // [0x2dd2450] Final|Native|Protected 
	// Function /Script/MFNPCAI.NPCAINavModifierVolume.OnNavDataRegisteredCallback
	// void OnNavDataRegisteredCallback(class ANavigationData* NavData);                                                        // [0x2dd14e0] Final|Native|Protected 
	// Function /Script/MFNPCAI.NPCAINavModifierVolume.CollectAffectedNavNodes
	// void CollectAffectedNavNodes();                                                                                          // [0xca50c0] Native|Protected     
};

/// Class /Script/MFNPCAI.AIRuntimeMonitor
/// Size: 0x0058 (88 bytes) (0x000028 - 0x000080) align 8 pad: 0x0000
class UAIRuntimeMonitor : public UObject
{ 
public:
	SDK_UNDEFINED(80,600) /* TMap<FString, FAIRuntimeMonitorStatInfo> */ __um(StatMap);                            // 0x0028   (0x0050)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0078   (0x0008)  MISSED
};

/// Class /Script/MFNPCAI.AISceneEventMessage
/// Size: 0x0030 (48 bytes) (0x000028 - 0x000058) align 8 pad: 0x0000
class UAISceneEventMessage : public UObject
{ 
public:
	float                                              ValidTime;                                                  // 0x0028   (0x0004)  
	float                                              ValidScope;                                                 // 0x002C   (0x0004)  
	TArray<FString>                                    Tags;                                                       // 0x0030   (0x0010)  
	int32_t                                            EvtUniqueId;                                                // 0x0040   (0x0004)  
	float                                              StartTime;                                                  // 0x0044   (0x0004)  
	float                                              EndTime;                                                    // 0x0048   (0x0004)  
	FVector                                            TriggerLocation;                                            // 0x004C   (0x000C)  


	/// Functions
	// Function /Script/MFNPCAI.AISceneEventMessage.IsExpired
	// bool IsExpired(float CurrentTimeSec);                                                                                    // [0x2dadf50] Final|Native|Public  
};

/// Class /Script/MFNPCAI.AISceneEventsTriggerManager
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UAISceneEventsTriggerManager : public UObject
{ 
public:
	TArray<class UAISceneEventMessage*>                SceneEventsList;                                            // 0x0028   (0x0010)  


	/// Functions
	// Function /Script/MFNPCAI.AISceneEventsTriggerManager.TriggerSceneEvent
	// int32_t TriggerSceneEvent(class UAISceneEventMessage* SceneEvtMessage, FVector& TriggerLocation, float CoverInRange);    // [0x2dae8c0] Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.AISceneEventsTriggerManager.RemoveSceneEventByUniqueId
	// void RemoveSceneEventByUniqueId(int32_t EvtUniqueId);                                                                    // [0x2dae480] Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.AISceneEventsTriggerManager.RemoveSceneEvent
	// void RemoveSceneEvent(class UAISceneEventMessage* SceneEvtMessage);                                                      // [0x16b0bd0] Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.AISceneEventsTriggerManager.OnDSTick
	// void OnDSTick();                                                                                                         // [0x1da1980] Native|Public        
	// Function /Script/MFNPCAI.AISceneEventsTriggerManager.GetSceneEventByUniqueId
	// class UAISceneEventMessage* GetSceneEventByUniqueId(int32_t EvtUniqueId);                                                // [0x2dadbd0] Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.AISceneEventsTriggerManager.FindNearSceneEvents
	// bool FindNearSceneEvents(TArray<UAISceneEventMessage*> ActivedEvents, FVector& CenterPos, float Radius);                 // [0x2dad400] Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.AISceneEventsTriggerManager.FilterExpiredSceneEvents
	// void FilterExpiredSceneEvents();                                                                                         // [0x2dad3e0] Final|Native|Public  
	// Function /Script/MFNPCAI.AISceneEventsTriggerManager.ClearExpiredSceneEventOnAI
	// void ClearExpiredSceneEventOnAI(int32_t EvtUniqueId);                                                                    // [0x2dacf00] Final|Native|Public  
};

/// Struct /Script/MFNPCAI.AISGDoorUsed
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FAISGDoorUsed
{ 
	class AActor*                                      SGDoor;                                                     // 0x0000   (0x0008)  
	class ACharacter*                                  AIPawn;                                                     // 0x0008   (0x0008)  
	float                                              UsedTime;                                                   // 0x0010   (0x0004)  
	char                                               WaitPersons;                                                // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x0015   (0x0003)  MISSED
};

/// Class /Script/MFNPCAI.AISGDoorManager
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000050) align 8 pad: 0x0000
class UAISGDoorManager : public UObject
{ 
public:
	TArray<FAISGDoorUsed>                              AISGDoorUsedList;                                           // 0x0028   (0x0010)  
	SDK_UNDEFINED(16,601) /* TArray<TWeakObjectPtr<AActor*>> */ __um(DoorsInWorld);                                // 0x0038   (0x0010)  
	float                                              TimeFindDoorsInWorld;                                       // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x004C   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.AISGDoorManager.WantToWaitUsed
	// void WantToWaitUsed(class ACharacter* AIPawn, class AActor* SGDoor);                                                     // [0x2daebc0] Final|Native|Public  
	// Function /Script/MFNPCAI.AISGDoorManager.WantToUsedDoor
	// bool WantToUsedDoor(class ACharacter* AIPawn, class AActor* SGDoor);                                                     // [0x2daeaf0] Final|Native|Public  
	// Function /Script/MFNPCAI.AISGDoorManager.ReleaseUsedDoor
	// void ReleaseUsedDoor(class ACharacter* AIPawn);                                                                          // [0x2dae3f0] Final|Native|Public  
	// Function /Script/MFNPCAI.AISGDoorManager.InitDoorsInWorld
	// void InitDoorsInWorld(class UObject* WorldContext);                                                                      // [0x2dade90] Final|Native|Private 
	// Function /Script/MFNPCAI.AISGDoorManager.GetPawnUsedDoor
	// class AActor* GetPawnUsedDoor(class AActor* SGDoor);                                                                     // [0x2dadaf0] Final|Native|Public  
	// Function /Script/MFNPCAI.AISGDoorManager.GetDoor
	// class AActor* GetDoor(class UObject* WorldContext, FVector& DoorPoint);                                                  // [0x2dad8c0] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.AISGDoorManager.DoorIsBusy
	// bool DoorIsBusy(class AActor* SGDoor, class ACharacter* AIPawn);                                                         // [0x2dad310] Final|Native|Public  
	// Function /Script/MFNPCAI.AISGDoorManager.AutoRemoveInValidUsed
	// void AutoRemoveInValidUsed();                                                                                            // [0x2dace40] Final|Native|Public  
};

/// Class /Script/MFNPCAI.BehaviorTreeTooler
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UBehaviorTreeTooler : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.BehaviorTreeTooler.GetGameState
	// class AGameState* GetGameState(class UObject* World);                                                                    // [0x2dad9a0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.BehaviorTreeTooler.GetClientWorld
	// class UWorld* GetClientWorld(class UObject* WorldContext);                                                               // [0x2dad760] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIActorComponent
/// Size: 0x0010 (16 bytes) (0x0000F8 - 0x000108) align 8 pad: 0x0000
class UNPCAIActorComponent : public UActorComponent
{ 
public:
	TArray<class UNPCAIProfileBaseComponent*>          PropertyComponents;                                         // 0x00F8   (0x0010)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIActorComponent.GetAIPropertyByClass
	// class UNPCAIProfileBaseComponent* GetAIPropertyByClass(class UClass* InPropertyClass);                                   // [0x2dad5b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/MFNPCAI.NPCAIAimingInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIAimingInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAIAimingInterface.UpdatePredestinedHit
	// void UpdatePredestinedHit();                                                                                             // [0x2daead0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.TriggerPressedDone
	// void TriggerPressedDone(float WeaponRecoilParam);                                                                        // [0x2dae840] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.SetTargetEnemy
	// void SetTargetEnemy(class AActor* InEnemyPawn);                                                                          // [0x2a480d0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.SetShootPartID
	// void SetShootPartID(char InShootPartID);                                                                                 // [0x2dae7c0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.SetNextAimingDelay
	// void SetNextAimingDelay(float DelayTime);                                                                                // [0x2dae740] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.SetAimingPoint
	// void SetAimingPoint(FVector& InAimingPoint);                                                                             // [0x2dae510] Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIAimingInterface.NodeUpdate
	// void NodeUpdate();                                                                                                       // [0x2dae3b0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.NextShotMiss
	// void NextShotMiss();                                                                                                     // [0x2dae390] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.NextShotHit
	// void NextShotHit();                                                                                                      // [0x2dae370] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.LoseTarget
	// void LoseTarget();                                                                                                       // [0x2dae350] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.IsWaitingStartAiming
	// bool IsWaitingStartAiming();                                                                                             // [0x2dae320] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.IsUsingPredestined
	// bool IsUsingPredestined();                                                                                               // [0x2dae2f0] Native|Public|Const  
	// Function /Script/MFNPCAI.NPCAIAimingInterface.IsReady
	// bool IsReady();                                                                                                          // [0x288bc90] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.IsNextShotMiss
	// bool IsNextShotMiss();                                                                                                   // [0x2dae1f0] Native|Public|Const  
	// Function /Script/MFNPCAI.NPCAIAimingInterface.IsNextShotHit
	// bool IsNextShotHit();                                                                                                    // [0x2dae1c0] Native|Public|Const  
	// Function /Script/MFNPCAI.NPCAIAimingInterface.IsInPullBolt
	// bool IsInPullBolt();                                                                                                     // [0x2dae190] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.IsFacingTargetPoint
	// bool IsFacingTargetPoint(FVector& TargetPoint, float AngleLimit);                                                        // [0x2dadfe0] Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIAimingInterface.HasAmmo
	// bool HasAmmo();                                                                                                          // [0x2dadd80] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetTargetEnemy
	// class AActor* GetTargetEnemy();                                                                                          // [0x28c0730] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetShootPartID
	// char GetShootPartID();                                                                                                   // [0x2dadc70] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetMaxShotCount
	// int32_t GetMaxShotCount();                                                                                               // [0x2dadac0] Native|Public|Const  
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetLastDist2Target
	// float GetLastDist2Target();                                                                                              // [0x2984220] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetHit
	// void GetHit(int32_t DamageInfo);                                                                                         // [0x2dada30] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetDimAimingPoint
	// FVector GetDimAimingPoint(float Scaler);                                                                                 // [0x2dad820] Native|Public|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetCurrentShotCount
	// int32_t GetCurrentShotCount();                                                                                           // [0x2dad7f0] Native|Public|Const  
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetAimingPoint
	// FVector GetAimingPoint();                                                                                                // [0x2dad720] Native|Public|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetAimingOffset
	// FVector GetAimingOffset(float WeakenTime);                                                                               // [0x2dad680] Native|Public|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIAimingInterface.GetAimingLeftTime
	// float GetAimingLeftTime();                                                                                               // [0x2dad650] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.ForceCompleteAim
	// void ForceCompleteAim();                                                                                                 // [0x2dad590] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.ClearNextShotMiss
	// void ClearNextShotMiss();                                                                                                // [0x2dacfd0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.ClearNextShotHit
	// void ClearNextShotHit();                                                                                                 // [0x2dacfb0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.ClearNextShotFlags
	// void ClearNextShotFlags();                                                                                               // [0x2dacf90] Native|Public        
	// Function /Script/MFNPCAI.NPCAIAimingInterface.CalculateRequiredAimingTime
	// float CalculateRequiredAimingTime(FVector& AimingPos);                                                                   // [0x2dace60] Native|Public|HasOutParms|HasDefaults 
};

/// Class /Script/MFNPCAI.NPCAIAreaVolumeInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIAreaVolumeInterface : public UInterface
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIAsyncTaskBase
/// Size: 0x0010 (16 bytes) (0x000030 - 0x000040) align 8 pad: 0x0000
class UNPCAIAsyncTaskBase : public UBlueprintAsyncActionBase
{ 
public:
	bool                                               bSimpleTodo;                                                // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0031   (0x0007)  MISSED
	class AActor*                                      AIPawn;                                                     // 0x0038   (0x0008)  
};

/// Struct /Script/MFNPCAI.NPCAIAsyncTask
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FNPCAIAsyncTask
{ 
	class AActor*                                      AIPawn;                                                     // 0x0000   (0x0008)  
	ENPCAIAsyncTaskType                                Type;                                                       // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	class UNPCAIAsyncTaskBase*                         AsyncTask;                                                  // 0x0010   (0x0008)  
};

/// Class /Script/MFNPCAI.NPCAIAsyncTaskSystem
/// Size: 0x0010 (16 bytes) (0x000030 - 0x000040) align 8 pad: 0x0000
class UNPCAIAsyncTaskSystem : public UWorldSubsystem
{ 
public:
	TArray<FNPCAIAsyncTask>                            AsyncTasks;                                                 // 0x0030   (0x0010)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIAsyncTaskSystem.OnDSTick
	// void OnDSTick();                                                                                                         // [0x2dae3d0] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIAsyncTaskSystem.HasTask
	// bool HasTask(class AActor* AIPawn, ENPCAIAsyncTaskType& InType);                                                         // [0x2daddb0] Final|Native|Public|HasOutParms 
	// Function /Script/MFNPCAI.NPCAIAsyncTaskSystem.GetTask
	// class UNPCAIAsyncTaskBase* GetTask(class AActor* AIPawn, ENPCAIAsyncTaskType& InType);                                   // [0x2dadca0] Final|Native|Public|HasOutParms 
};

/// Class /Script/MFNPCAI.NPCAIAttentionPoint
/// Size: 0x0078 (120 bytes) (0x000028 - 0x0000A0) align 8 pad: 0x0000
class UNPCAIAttentionPoint : public UObject
{ 
public:
	bool                                               bIsCome;                                                    // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	class AActor*                                      Creator;                                                    // 0x0030   (0x0008)  
	unsigned char                                      UnknownData01_6[0x1];                                       // 0x0038   (0x0001)  MISSED
	bool                                               IsFootSounder;                                              // 0x0039   (0x0001)  
	unsigned char                                      UnknownData02_6[0x6];                                       // 0x003A   (0x0006)  MISSED
	class AActor*                                      FootSounderSpawnCharacter;                                  // 0x0040   (0x0008)  
	class AAIController*                               CheckingPlayer;                                             // 0x0048   (0x0008)  
	bool                                               bReachable;                                                 // 0x0050   (0x0001)  
	ENPCPlaceForCheckType                              PointType;                                                  // 0x0051   (0x0001)  
	unsigned char                                      UnknownData03_6[0x2];                                       // 0x0052   (0x0002)  MISSED
	float                                              CreatedTime;                                                // 0x0054   (0x0004)  
	float                                              DiedTime;                                                   // 0x0058   (0x0004)  
	unsigned char                                      UnknownData04_7[0x44];                                      // 0x005C   (0x0044)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.UpdatePointData
	// void UpdatePointData(float InNewCreateTime, FVector InNewPosition);                                                      // [0x2dae9f0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.SetIsCome
	// void SetIsCome(bool InIsCome);                                                                                           // [0x2dae6b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.SetDieTime
	// void SetDieTime(float LifeTime);                                                                                         // [0x2dae630] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.SetCreator
	// void SetCreator(class AActor* InCreator);                                                                                // [0x2dae5a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.IsThisPointClose
	// bool IsThisPointClose(FVector InCheckLoc);                                                                               // [0x2dae250] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.IsOld
	// bool IsOld();                                                                                                            // [0x2dae220] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.IsGrenadeHolding
	// bool IsGrenadeHolding();                                                                                                 // [0x2dae160] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.IsGrenadeHit
	// bool IsGrenadeHit();                                                                                                     // [0x2dae130] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.IsGrenadeComing
	// bool IsGrenadeComing();                                                                                                  // [0x2dae100] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.IsFatal
	// bool IsFatal();                                                                                                          // [0x2dae0d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.IsDanger
	// bool IsDanger();                                                                                                         // [0x2dadf20] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.GetPosition
	// FVector GetPosition();                                                                                                   // [0x2dadb90] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.CreateNewAttentionPointWithCoverPointID
	// class UNPCAIAttentionPoint* CreateNewAttentionPointWithCoverPointID(class UObject* InHolder, int32_t InCoverPointID, FVector InBaseLoc, ENPCPlaceForCheckType InType, class AActor* InCreator); // [0x2dad150] Final|Native|Static|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIAttentionPoint.CreateNewAttentionPoint
	// class UNPCAIAttentionPoint* CreateNewAttentionPoint(class UObject* InHolder, FVector InLoc, ENPCPlaceForCheckType InType, class AActor* InCreator); // [0x2dacff0] Final|Native|Static|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIBattleVolumeInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIBattleVolumeInterface : public UInterface
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIBehaviorHistoryDebugInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIBehaviorHistoryDebugInterface : public UInterface
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICharacterInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAICharacterInterface : public UInterface
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIControllerInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIControllerInterface : public UInterface
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryData
/// Size: 0x01A8 (424 bytes) (0x000028 - 0x0001D0) align 8 pad: 0x0000
class UNPCAICoverEnvQueryData : public UObject
{ 
public:
	unsigned char                                      UnknownData00_3[0xA8];                                      // 0x0028   (0x00A8)  MISSED
	FVector                                            Generator_Location;                                         // 0x00D0   (0x000C)  
	float                                              Generator_Radius;                                           // 0x00DC   (0x0004)  
	class AVolume*                                     Generator_BotZoneVolume;                                    // 0x00E0   (0x0008)  
	float                                              IsFree_TreatAsFreeAfterSeconds;                             // 0x00E8   (0x0004)  
	float                                              IsSafe_TreatAsSafeAfterSeconds;                             // 0x00EC   (0x0004)  
	FVector                                            IsNear_Location;                                            // 0x00F0   (0x000C)  
	float                                              IsNear_Distance;                                            // 0x00FC   (0x0004)  
	bool                                               IsNear_Reversed;                                            // 0x0100   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0101   (0x0003)  MISSED
	FVector                                            CloserRatio_Location;                                       // 0x0104   (0x000C)  
	float                                              CloserRatio_Ratio;                                          // 0x0110   (0x0004)  
	FVector                                            CanContain_TargetLocation;                                  // 0x0114   (0x000C)  
	float                                              CanContain_HorizontalAngle;                                 // 0x0120   (0x0004)  
	float                                              CanContain_TopAngle;                                        // 0x0124   (0x0004)  
	float                                              CanContain_BottomAngle;                                     // 0x0128   (0x0004)  
	FVector                                            CanAttackTo_TargetLocation;                                 // 0x012C   (0x000C)  
	TArray<class AActor*>                              CanAttackTo_IgnoredActors;                                  // 0x0138   (0x0010)  
	FVector                                            PathLength_StartLocation;                                   // 0x0148   (0x000C)  
	float                                              PathLength_MaxPathLength;                                   // 0x0154   (0x0004)  
	float                                              PathLength_MaxRatio;                                        // 0x0158   (0x0004)  
	float                                              PathLength_CheckPoint;                                      // 0x015C   (0x0004)  
	float                                              DefenceRatio_MinRatio;                                      // 0x0160   (0x0004)  
	float                                              DefenceAngle_MinAngle;                                      // 0x0164   (0x0004)  
	TArray<FVector>                                    DistanceToHotPoint_Locations;                               // 0x0168   (0x0010)  
	FVector                                            DistanceToAllyCover_Location;                               // 0x0178   (0x000C)  
	float                                              DistanceToAllyCover_MinDistance;                            // 0x0184   (0x0004)  
	FVector                                            IsSameSideToTarget_TargetLocation;                          // 0x0188   (0x000C)  
	FVector                                            IsSameSideToTarget_TargetDirection;                         // 0x0194   (0x000C)  
	FVector                                            IsInCone_Location;                                          // 0x01A0   (0x000C)  
	FVector                                            IsInCone_Direction;                                         // 0x01AC   (0x000C)  
	float                                              IsInCone_Radius;                                            // 0x01B8   (0x0004)  
	float                                              IsInCone_Angle;                                             // 0x01BC   (0x0004)  
	FVector                                            CoverDist_Location;                                         // 0x01C0   (0x000C)  
	float                                              CoverDist_MaxDistance;                                      // 0x01CC   (0x0004)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupPathLength
	// void SetupPathLength(FVector& Location, float MaxPathLength, float MaxRatio, float CheckPointPathLength);                // [0x2db2c60] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupIsSameSideToTarget
	// void SetupIsSameSideToTarget(FVector& Location, FVector& Direction);                                                     // [0x2db2b80] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupIsSafe
	// void SetupIsSafe(float TreatAsSafeAfterSeconds);                                                                         // [0x2db2b00] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupIsIsNear
	// void SetupIsIsNear(FVector& Location, float Distance, bool bReversed);                                                   // [0x2db29e0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupIsInCone
	// void SetupIsInCone(FVector& Location, FVector& Direction, float Radius, float Angle);                                    // [0x2db2860] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupIsFree
	// void SetupIsFree(float TreatAsFreeAfterSeconds);                                                                         // [0x2db27e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupIsCloserRatio
	// void SetupIsCloserRatio(FVector& Location, float Ratio);                                                                 // [0x2db2700] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupGenerator
	// void SetupGenerator(FVector& Location, float Radius, class AVolume* BotZoneVolume);                                      // [0x2db25f0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupDistanceToHotPoint
	// void SetupDistanceToHotPoint(TArray<FVector>& Locations);                                                                // [0x2db2540] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupDistanceToAllyCover
	// void SetupDistanceToAllyCover(FVector& Location, float MinDistance);                                                     // [0x2db2460] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupDefenceRatio
	// void SetupDefenceRatio(float MinRatio);                                                                                  // [0x2db23e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupDefenceAngle
	// void SetupDefenceAngle(float MinAngle);                                                                                  // [0x2db2360] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupCoverDist
	// void SetupCoverDist(FVector& Location, float MaxDistance);                                                               // [0x2db2280] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupCanContain
	// void SetupCanContain(FVector& Location, float HorizontalAngle, float TopAngle, float BottomAngle);                       // [0x2db2110] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverEnvQueryData.SetupCanAttackTo
	// void SetupCanAttackTo(FVector& Location, TArray<AActor*>& IgnoredActors);                                                // [0x2db1fe0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryGenerator
/// Size: 0x0008 (8 bytes) (0x000210 - 0x000218) align 8 pad: 0x0000
class UNPCAICoverEnvQueryGenerator : public UEnvQueryGenerator_OnCircle
{ 
public:
	class UCoverSystem*                                CacheCoverSystem;                                           // 0x0210   (0x0008)  
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_CanAttackTo
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_CanAttackTo : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_CanContain
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_CanContain : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_CloserRatio
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_CloserRatio : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_CoverDist
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_CoverDist : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_DefenceAngle
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_DefenceAngle : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_DefenceRatio
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_DefenceRatio : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_DistanceToAllyCover
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_DistanceToAllyCover : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_DistanceToHotPoint
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_DistanceToHotPoint : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_IsFree
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_IsFree : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_IsInCone
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_IsInCone : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_IsNear
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_IsNear : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_IsSafe
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_IsSafe : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_IsSameSideToTarget
/// Size: 0x0000 (0 bytes) (0x0001F8 - 0x0001F8) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_IsSameSideToTarget : public UEnvQueryTest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_PathLength
/// Size: 0x0008 (8 bytes) (0x0001F8 - 0x000200) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_PathLength : public UEnvQueryTest
{ 
public:
	bool                                               bEnabledDebug;                                              // 0x01F8   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x01F9   (0x0007)  MISSED
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_Protection
/// Size: 0x0008 (8 bytes) (0x0001F8 - 0x000200) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_Protection : public UEnvQueryTest
{ 
public:
	class UClass*                                      ProtectionFrom;                                             // 0x01F8   (0x0008)  
};

/// Class /Script/MFNPCAI.NPCAICoverEnvQueryTest_ShootDistance
/// Size: 0x0008 (8 bytes) (0x0001F8 - 0x000200) align 8 pad: 0x0000
class UNPCAICoverEnvQueryTest_ShootDistance : public UEnvQueryTest
{ 
public:
	class UClass*                                      ShootDistanceTo;                                            // 0x01F8   (0x0008)  
};

/// Class /Script/MFNPCAI.NPCAICoverSystemStatics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAICoverSystemStatics : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_IsSafe
	// bool TestCoverPoints_IsSafe(TArray<int32_t>& InPoints, float SecondsAfterLastSpotted, TArray<int32_t>& PassPoints, class UObject* WorldContextObject); // [0x2db3b00] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_IsNear
	// bool TestCoverPoints_IsNear(TArray<int32_t>& InPoints, FVector& Location, float Distance, bool bReversed, TArray<int32_t>& PassPoints, class UObject* WorldContextObject); // [0x2db38d0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_IsFree
	// bool TestCoverPoints_IsFree(TArray<int32_t>& InPoints, class AActor* InActor, float TreatAsFreeAfterSeconds, TArray<int32_t>& PassPoints, class UObject* WorldContextObject); // [0x2db3700] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_HasNavPath
	// bool TestCoverPoints_HasNavPath(TArray<int32_t>& InPoints, FVector& StartLocation, float MaxPathLenght, TArray<int32_t>& PassPoints, class UObject* WorldContextObject); // [0x2db3510] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_CanProtectPose
	// bool TestCoverPoints_CanProtectPose(TArray<int32_t>& InPoints, ENPCPoseType PoseType, TArray<int32_t>& PassPoints, class UObject* WorldContextObject); // [0x2db3370] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_CanContain
	// bool TestCoverPoints_CanContain(TArray<int32_t>& InPoints, FVector& Location, float HorizontalAngle, float TopAngle, float BottomAngle, TArray<int32_t>& PassPoints, class UObject* WorldContextObject); // [0x2db3110] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_CanAttackTo
	// bool TestCoverPoints_CanAttackTo(TArray<int32_t>& InPoints, FVector& Location, TArray<AActor*>& IgnoredActors, TArray<int32_t>& PassPoints, class UObject* WorldContextObject); // [0x2db2ed0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.TestCoverPoint_IsSafe
	// bool TestCoverPoint_IsSafe(int32_t InPointID, float SecondsAfterLastSpotted, class UObject* WorldContextObject);         // [0x2db2dd0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.SetCoverPointSpotted
	// bool SetCoverPointSpotted(int32_t PointID, class UObject* WorldContextObject);                                           // [0x2db1f10] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.SetCoverPointOwner
	// bool SetCoverPointOwner(int32_t PointID, class AActor* Actor, float Radius, class UObject* WorldContextObject);          // [0x2db1dd0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.RunEQSQuery_FindBackUpCoverPointNearBy
	// class UEnvQueryInstanceBlueprintWrapper* RunEQSQuery_FindBackUpCoverPointNearBy(class UObject* WorldContextObject, class UEnvQuery* QueryTemplate, class AActor* Querier, FVector& InEnemyPos, float InRadiusNoCheck, TEnumAsByte<EEnvQueryRunMode> RunMode, class UClass* WrapperClass); // [0x2db1bb0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.RemoveCoverPointBeTaked
	// void RemoveCoverPointBeTaked(class AActor* InAIPawn);                                                                    // [0x2db1b30] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.GetQueryResultsAsCoverIDs
	// bool GetQueryResultsAsCoverIDs(class UEnvQueryInstanceBlueprintWrapper* QueryInstanceBPWrapper, TArray<int32_t>& PassPoints); // [0x2db1a10] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.GetCoverSystem
	// class UCoverSystem* GetCoverSystem(class UObject* WorldContextObject);                                                   // [0x2db1980] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.GetCoverPointPoseDataArray
	// bool GetCoverPointPoseDataArray(int32_t PointID, TArray<FCoverPoseData>& PoseDataArray, FVector& RightDirection, class UObject* WorldContextObject); // [0x2db1800] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.GetCoverPointLocationAndDirection
	// bool GetCoverPointLocationAndDirection(int32_t PointID, FVector& Location, FVector& Direction, class UObject* WorldContextObject); // [0x2db1690] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.GetCoverPointData
	// bool GetCoverPointData(int32_t PointID, FCoverPointOctreeData& Data, class UObject* WorldContextObject);                 // [0x2db1530] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.FindNearestCoverPoint
	// bool FindNearestCoverPoint(FVector& Location, float EdgeSize, FVector& CoverLocation, class UObject* WorldContextObject); // [0x2db13c0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.FindCoverPointsInSphere
	// bool FindCoverPointsInSphere(FVector Location, float Radius, TArray<int32_t>& Points, class UObject* WorldContextObject); // [0x2db1230] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAICoverSystemStatics.FindCoverPointsInPathLength
	// bool FindCoverPointsInPathLength(class AActor* AIPawn, float PathLength, TArray<FVector>& PointsPos);                    // [0x2db1100] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIDamageData
/// Size: 0x0018 (24 bytes) (0x000028 - 0x000040) align 8 pad: 0x0000
class UNPCAIDamageData : public UObject
{ 
public:
	float                                              TimeDamage;                                                 // 0x0028   (0x0004)  
	FVector                                            position;                                                   // 0x002C   (0x000C)  
	float                                              CachedMaxActiveTime;                                        // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x003C   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIDamageData.IsActive
	// bool IsActive();                                                                                                         // [0x2db1b00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/MFNPCAI.NPCAIDoorInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIDoorInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAIDoorInterface.IsDoorLocked
	// bool IsDoorLocked();                                                                                                     // [0x29cc100] Native|Public        
	// Function /Script/MFNPCAI.NPCAIDoorInterface.IsDoorClosed
	// bool IsDoorClosed();                                                                                                     // [0x288bc90] Native|Public        
};

/// Class /Script/MFNPCAI.NPCAIDoorOpenInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIDoorOpenInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAIDoorOpenInterface.IsDoorOpened
	// bool IsDoorOpened(class AActor* InDoor);                                                                                 // [0x2db7b60] Native|Public        
};

/// Class /Script/MFNPCAI.NPCAIDynamicGroupInfo
/// Size: 0x0030 (48 bytes) (0x000028 - 0x000058) align 8 pad: 0x0000
class UNPCAIDynamicGroupInfo : public UObject
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x0028   (0x0008)  MISSED
	int32_t                                            DyGroupId;                                                  // 0x0030   (0x0004)  
	float                                              CreateTime;                                                 // 0x0034   (0x0004)  
	bool                                               CanAutoRelease;                                             // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0039   (0x0007)  MISSED
	TArray<class AActor*>                              AllyList;                                                   // 0x0040   (0x0010)  
	class UWorld*                                      WorldPrivate;                                               // 0x0050   (0x0008)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIDynamicGroupInfo.GetTimeSeconds
	// float GetTimeSeconds();                                                                                                  // [0x288fef0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIDynamicGroupInfo.GetAllyList
	// TArray<AActor*> GetAllyList();                                                                                           // [0x2db7860] Native|Public|BlueprintCallable|BlueprintPure 
};

/// Struct /Script/MFNPCAI.AIShotCountStat
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 pad: 0x0000
struct FAIShotCountStat
{ 
	int32_t                                            Count;                                                      // 0x0000   (0x0004)  
	float                                              LastTime;                                                   // 0x0004   (0x0004)  
	float                                              FirstTime;                                                  // 0x0008   (0x0004)  
	float                                              IntervalToClear;                                            // 0x000C   (0x0004)  
};

/// Class /Script/MFNPCAI.NPCAITargetInfoBase
/// Size: 0x0038 (56 bytes) (0x000028 - 0x000060) align 8 pad: 0x0000
class UNPCAITargetInfoBase : public UObject
{ 
public:
	float                                              FirstTimeSeen;                                              // 0x0028   (0x0004)  
	float                                              TimeToForgorAboutEnemySec;                                  // 0x002C   (0x0004)  
	FAIShotCountStat                                   BeFireCount;                                                // 0x0030   (0x0010)  
	FAIShotCountStat                                   BeHitCount;                                                 // 0x0040   (0x0010)  
	float                                              EnemyStartSeenTime;                                         // 0x0050   (0x0004)  
	float                                              EnemyLastSeenTime;                                          // 0x0054   (0x0004)  
	float                                              EnemyLastKnowTime;                                          // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x005C   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.SetTimeToForgorAboutEnemySec
	// void SetTimeToForgorAboutEnemySec(float Value);                                                                          // [0x2e09670] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.SetTimeLastSeen
	// void SetTimeLastSeen(float InNowTime);                                                                                   // [0x1983360] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.SetTimeLastKnow
	// void SetTimeLastKnow(float InNowTime);                                                                                   // [0x2e095e0] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.SetFirstTimeSeen
	// void SetFirstTimeSeen(float InNowTime);                                                                                  // [0x1da1d10] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.SetBeHitTime
	// void SetBeHitTime(float InNowTime);                                                                                      // [0x2e093a0] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.SetBeFireTime
	// void SetBeFireTime(float InNowTime);                                                                                     // [0x2e09310] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetTimeToForgorAboutEnemySec
	// float GetTimeToForgorAboutEnemySec();                                                                                    // [0x2e08b90] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetTimeLastSeen
	// float GetTimeLastSeen();                                                                                                 // [0x2e08b50] Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetTimeLastKnow
	// float GetTimeLastKnow();                                                                                                 // [0x2e08b10] Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetLastBeHitTime
	// float GetLastBeHitTime();                                                                                                // [0x2e08730] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetLastBeFireTime
	// float GetLastBeFireTime();                                                                                               // [0x2e086f0] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetFirstTimeSeen
	// float GetFirstTimeSeen();                                                                                                // [0x288feb0] Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetFirstBeHitTime
	// float GetFirstBeHitTime();                                                                                               // [0x2e082c0] Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetFirstBeFireTime
	// float GetFirstBeFireTime();                                                                                              // [0x2e08280] Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetBeHitCount
	// int32_t GetBeHitCount();                                                                                                 // [0x2e07aa0] Native|Public        
	// Function /Script/MFNPCAI.NPCAITargetInfoBase.GetBeFireCount
	// int32_t GetBeFireCount();                                                                                                // [0x2e07a70] Native|Public        
};

/// Class /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo
/// Size: 0x0048 (72 bytes) (0x000060 - 0x0000A8) align 8 pad: 0x0000
class UNPCAIEnemyGroupSingleInfo : public UNPCAITargetInfoBase
{ 
public:
	bool                                               IsTemporaryEnemy;                                           // 0x0060   (0x0001)  
	bool                                               IsTemporaryEnemyFromAlly;                                   // 0x0061   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0062   (0x0002)  MISSED
	float                                              EndTimeOfTemporaryEnemy;                                    // 0x0064   (0x0004)  
	FVector                                            EnemyLastSeenPosition;                                      // 0x0068   (0x000C)  
	float                                              EndTimeOfSupressed;                                         // 0x0074   (0x0004)  
	float                                              LastTimeCreateSuspectedPoint;                               // 0x0078   (0x0004)  
	float                                              PersonInValidTime;                                          // 0x007C   (0x0004)  
	class AActor*                                      Person;                                                     // 0x0080   (0x0008)  
	int32_t                                            HatredValue;                                                // 0x0088   (0x0004)  
	float                                              HatredEndtime;                                              // 0x008C   (0x0004)  
	float                                              LastShootGroupAllyTime;                                     // 0x0090   (0x0004)  
	int32_t                                            SuspectedPointCreatedNum;                                   // 0x0094   (0x0004)  
	float                                              LastIncreaseTimeSuspectedPoint;                             // 0x0098   (0x0004)  
	FVector                                            EnemyLastEstimatePosition;                                  // 0x009C   (0x000C)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.SetTemporaryEnemyInfo
	// void SetTemporaryEnemyInfo(bool InIsTemporaryEnemy, float InExpiredTime, bool InIsFromAlly);                             // [0x2db8140] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.SetSuppressEndTime
	// void SetSuppressEndTime(float InEndTime);                                                                                // [0x2db80c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.SetLastShootGroupAllyTime
	// void SetLastShootGroupAllyTime(float InTime);                                                                            // [0x2db8040] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.SetHatredValue
	// void SetHatredValue(int32_t InHatredValue, float InEndTime);                                                             // [0x2db7f70] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.SetEnemyLastVisibleInfo
	// void SetEnemyLastVisibleInfo(FVector InLastSeenPosition, float InLastSeenTime);                                          // [0x2db7e90] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.SetEnemyLastEstimatePosition
	// void SetEnemyLastEstimatePosition(class AActor* InEnemy, FVector InPosition);                                            // [0x2db7db0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.IsRealValidEnemy
	// bool IsRealValidEnemy(float InNowTime);                                                                                  // [0x2db7c00] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.GetSuspectedPointCreatedNum
	// int32_t GetSuspectedPointCreatedNum(class AActor* InAIPawn);                                                             // [0x2db7ac0] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.GetPerson
	// class AActor* GetPerson();                                                                                               // [0x2db7a00] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.GetLastShootGroupAllyTime
	// float GetLastShootGroupAllyTime();                                                                                       // [0x2db79d0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.GetHatredValue
	// int32_t GetHatredValue(float InNowTime);                                                                                 // [0x2db7940] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.GetEnemyLastEstimatePosition
	// FVector GetEnemyLastEstimatePosition();                                                                                  // [0x2db78d0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.CalculateSuspectedPointCreatedNum
	// void CalculateSuspectedPointCreatedNum(class AActor* InAIPawn);                                                          // [0x2db7720] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIEnemyGroupSingleInfo.AddSuspectedPointCreatedNum
	// void AddSuspectedPointCreatedNum(class AActor* InAIPawn);                                                                // [0x2db7690] Final|Native|Public  
};

/// Class /Script/MFNPCAI.NPCAIEnvQueryGenerator_BlueprintBase
/// Size: 0x0040 (64 bytes) (0x000080 - 0x0000C0) align 8 pad: 0x0000
class UNPCAIEnvQueryGenerator_BlueprintBase : public UEnvQueryGenerator_BlueprintBase
{ 
public:
	FAIDataProviderIntValue                            IntParam;                                                   // 0x0080   (0x0038)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x00B8   (0x0008)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIEnvQueryGenerator_BlueprintBase.GetQueryIntParam
	// int32_t GetQueryIntParam(FName& ParamName);                                                                              // [0x2db7a20] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/MFNPCAI.NPCAIEnvQueryGenerator_OnPolyCenter
/// Size: 0x00E8 (232 bytes) (0x000210 - 0x0002F8) align 8 pad: 0x0000
class UNPCAIEnvQueryGenerator_OnPolyCenter : public UEnvQueryGenerator_OnCircle
{ 
public:
	FAIDataProviderBoolValue                           OnlyCurrentRegion;                                          // 0x0210   (0x0038)  
	FAIDataProviderBoolValue                           IncludeNavMeshPolyCenters;                                  // 0x0248   (0x0038)  
	FAIDataProviderBoolValue                           IncludeNavMeshInternalEdges;                                // 0x0280   (0x0038)  
	FAIDataProviderBoolValue                           IncludeNavMeshBoundaryEdges;                                // 0x02B8   (0x0038)  
	float                                              PointZOffset;                                               // 0x02F0   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x02F4   (0x0004)  MISSED
};

/// Class /Script/MFNPCAI.NPCAIEnvQueryInstanceBlueprintWrapper
/// Size: 0x0008 (8 bytes) (0x000078 - 0x000080) align 8 pad: 0x0000
class UNPCAIEnvQueryInstanceBlueprintWrapper : public UEnvQueryInstanceBlueprintWrapper
{ 
public:
	float                                              QueryTime;                                                  // 0x0078   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x007C   (0x0004)  MISSED
};

/// Class /Script/MFNPCAI.NPCAIEnvQueryItemType_CoverPoint
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UNPCAIEnvQueryItemType_CoverPoint : public UEnvQueryItemType_VectorBase
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIEnvQueryManager
/// Size: 0x0000 (0 bytes) (0x000140 - 0x000140) align 8 pad: 0x0000
class UNPCAIEnvQueryManager : public UEnvQueryManager
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIEnvQueryTest_BlueprintBase
/// Size: 0x0020 (32 bytes) (0x0001F8 - 0x000218) align 8 pad: 0x0000
class UNPCAIEnvQueryTest_BlueprintBase : public UEnvQueryTest
{ 
public:
	class UClass*                                      Context;                                                    // 0x01F8   (0x0008)  
	FText                                              TestDescription;                                            // 0x0200   (0x0018)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIEnvQueryTest_BlueprintBase.CalcScore
	// float CalcScore(class AActor* ItemActor, TArray<AActor*>& ContextActors);                                                // [0x3a75280] Event|Public|HasOutParms|BlueprintEvent|Const 
};

/// Class /Script/MFNPCAI.NPCAIEnvQueryTest_PathfindingFromQuerier
/// Size: 0x0040 (64 bytes) (0x0001F8 - 0x000238) align 8 pad: 0x0000
class UNPCAIEnvQueryTest_PathfindingFromQuerier : public UEnvQueryTest
{ 
public:
	TEnumAsByte<EEnvTestPathfinding>                   TestMode;                                                   // 0x01F8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x01F9   (0x0007)  MISSED
	FAIDataProviderBoolValue                           SkipUnreachable;                                            // 0x0200   (0x0038)  
};

/// Class /Script/MFNPCAI.NPCAIEnvQueryTest_PointBase
/// Size: 0x0020 (32 bytes) (0x0001F8 - 0x000218) align 8 pad: 0x0000
class UNPCAIEnvQueryTest_PointBase : public UEnvQueryTest
{ 
public:
	class UClass*                                      Context;                                                    // 0x01F8   (0x0008)  
	FText                                              TestDescription;                                            // 0x0200   (0x0018)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIEnvQueryTest_PointBase.CalcScore
	// float CalcScore(FVector& ItemLocation, TArray<AActor*>& ContextActors, class UObject* QueryOwner);                       // [0x3a75280] Event|Public|HasOutParms|HasDefaults|BlueprintEvent|Const 
};

/// Class /Script/MFNPCAI.NPCAIEQSSystemStatics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIEQSSystemStatics : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAIEQSSystemStatics.UARunEQSQuery
	// class UEnvQueryInstanceBlueprintWrapper* UARunEQSQuery(class UObject* WorldContextObject, class UEnvQuery* QueryTemplate, class AActor* Querier, TEnumAsByte<EEnvQueryRunMode> RunMode, class UClass* WrapperClass, TEnumAsByte<EEnvQueryPriority> QueryPriority); // [0x2db8250] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIFactionComponent
/// Size: 0x0018 (24 bytes) (0x000108 - 0x000120) align 8 pad: 0x0000
class UNPCAIFactionComponent : public UNPCAIActorComponent
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x0108   (0x0008)  MISSED
	TArray<class UNPCAIPropertyProfile*>               PropertyProfiles;                                           // 0x0110   (0x0010)  
};

/// Class /Script/MFNPCAI.NPCAIFactionPluginBase
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UNPCAIFactionPluginBase : public UObject
{ 
public:
	SDK_UNDEFINED(16,602) /* TArray<TWeakObjectPtr<UObject*>> */ __um(ObjectRefs);                                 // 0x0028   (0x0010)  
};

/// Struct /Script/MFNPCAI.NPCAIProfileCover
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FNPCAIProfileCover
{ 
	TArray<char>                                       Ars;                                                        // 0x0000   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0010   (0x0008)  MISSED
	FString                                            CoverName;                                                  // 0x0018   (0x0010)  
};

/// Class /Script/MFNPCAI.NPCAIFactionPlugin
/// Size: 0x0078 (120 bytes) (0x000038 - 0x0000B0) align 8 pad: 0x0000
class UNPCAIFactionPlugin : public UNPCAIFactionPluginBase
{ 
public:
	SDK_UNDEFINED(80,603) /* TMap<EAIProfileType, UClass*> */ __um(ProfileTypeMap);                                // 0x0038   (0x0050)  
	FNPCAIProfileCover                                 ProfileCover;                                               // 0x0088   (0x0028)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIFactionPlugin.CoverFaction
	// void CoverFaction(class AAIController* AIController);                                                                    // [0x19a6d00] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIFindAmbushAgainstPointAsyncTask
/// Size: 0x0038 (56 bytes) (0x000040 - 0x000078) align 8 pad: 0x0000
class UNPCAIFindAmbushAgainstPointAsyncTask : public UNPCAIAsyncTaskBase
{ 
public:
	SDK_UNDEFINED(16,604) /* FMulticastInlineDelegate */ __um(OnSuccess);                                          // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,605) /* FMulticastInlineDelegate */ __um(OnFail);                                             // 0x0050   (0x0010)  
	FVector                                            PointStart;                                                 // 0x0060   (0x000C)  
	FVector                                            PointToGo;                                                  // 0x006C   (0x000C)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIFindAmbushAgainstPointAsyncTask.ExecuteTask
	// void ExecuteTask();                                                                                                      // [0x198b080] Native|Public        
	// Function /Script/MFNPCAI.NPCAIFindAmbushAgainstPointAsyncTask.AIFindAmbushAgainstPoint
	// class UNPCAIFindAmbushAgainstPointAsyncTask* AIFindAmbushAgainstPoint(class AActor* Pawn, FVector& PointStart, FVector& PointToGo); // [0x2db7330] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIFindPathByKeyRouteAsyncTask
/// Size: 0x00E8 (232 bytes) (0x000040 - 0x000128) align 8 pad: 0x0000
class UNPCAIFindPathByKeyRouteAsyncTask : public UNPCAIAsyncTaskBase
{ 
public:
	SDK_UNDEFINED(16,606) /* FMulticastInlineDelegate */ __um(OnSuccess);                                          // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,607) /* FMulticastInlineDelegate */ __um(OnFail);                                             // 0x0050   (0x0010)  
	FKeyRoutePointData                                 FromPoint;                                                  // 0x0060   (0x0060)  
	FKeyRoutePointData                                 ToPoint;                                                    // 0x00C0   (0x0060)  
	EAIKeyRouteQueryType                               QueryType;                                                  // 0x0120   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0121   (0x0007)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIFindPathByKeyRouteAsyncTask.ExecuteTask
	// void ExecuteTask();                                                                                                      // [0x198b080] Native|Public        
	// Function /Script/MFNPCAI.NPCAIFindPathByKeyRouteAsyncTask.AIFindPathByKeyRoute
	// class UNPCAIFindPathByKeyRouteAsyncTask* AIFindPathByKeyRoute(class AActor* Pawn, FKeyRoutePointData& FromPoint, FKeyRoutePointData& ToPoint, EAIKeyRouteQueryType QueryType); // [0x2db7460] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGameStateDebugInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIGameStateDebugInterface : public UInterface
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIGlobalManagerInterface
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAIGlobalManagerInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.NotifySceneEvent
	// void NotifySceneEvent(class UAISceneEventMessage* SceneEvent, EAISceneEventState& EventState, class AActor* AIPawn);     // [0x2db7c90] Native|Public|HasOutParms 
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetTacticSystemActor
	// class ATacticSystemActor* GetTacticSystemActor();                                                                        // [0x16a3b10] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetPerceptionDynamicActor
	// class ANPCAIPerceptionDynamicActor* GetPerceptionDynamicActor();                                                         // [0x28c08b0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetPerceptionAssistActor
	// class ANPCAIPerceptionAssistActor* GetPerceptionAssistActor();                                                           // [0x28c0880] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetGrenadeMinLifeTime
	// float GetGrenadeMinLifeTime();                                                                                           // [0x2db7910] Native|Public|Const  
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetCurrentFogDensity
	// float GetCurrentFogDensity();                                                                                            // [0x2db78a0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetCoverSystemActor
	// class ACoverSystemActor* GetCoverSystemActor();                                                                          // [0x16a3460] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetAISGDoorManager
	// class UAISGDoorManager* GetAISGDoorManager();                                                                            // [0x28c0820] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetAISceneEventsTriggerManager
	// class UAISceneEventsTriggerManager* GetAISceneEventsTriggerManager();                                                    // [0x28c0790] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetAISceneEventDataTable
	// class UDataTable* GetAISceneEventDataTable();                                                                            // [0x28c0730] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetAIRuntimeMonitor
	// class UAIRuntimeMonitor* GetAIRuntimeMonitor();                                                                          // [0x28c0850] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.GetAIGlobalShareInfo
	// class UNPCAIGlobalSharedInfo* GetAIGlobalShareInfo();                                                                    // [0x2983ae0] Native|Public        
	// Function /Script/MFNPCAI.NPCAIGlobalManagerInterface.FindAllSGDoorsInWorld
	// void FindAllSGDoorsInWorld(TArray<TWeakObjectPtr<AActor*>>& DoorsInWorld);                                               // [0x2db77b0] Native|Public|HasOutParms 
};

/// Struct /Script/MFNPCAI.AIProtectTreasureBox
/// Size: 0x0060 (96 bytes) (0x000000 - 0x000060) align 8 pad: 0x0000
struct FAIProtectTreasureBox
{ 
	class AActor*                                      BoxInstance;                                                // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_7[0x58];                                      // 0x0008   (0x0058)  MISSED
};

/// Class /Script/MFNPCAI.NPCAIGlobalSharedInfo
/// Size: 0x01F8 (504 bytes) (0x000028 - 0x000220) align 8 pad: 0x0000
class UNPCAIGlobalSharedInfo : public UObject
{ 
public:
	float                                              TimeOfRunEQS_FindBackUpCoverPoint;                          // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	SDK_UNDEFINED(80,608) /* TMap<UClass*, FAIGlobalCacheActors> */ __um(CacheActorsInWorld);                      // 0x0030   (0x0050)  
	SDK_UNDEFINED(80,609) /* TMap<uint32_t, FAIEnemyInfo> */ __um(AIEnemyInfos);                                   // 0x0080   (0x0050)  
	bool                                               bEnableAIPerceptionLines;                                   // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x00D1   (0x0003)  MISSED
	float                                              AITrackLOGLastAutoReleaseTime;                              // 0x00D4   (0x0004)  
	SDK_UNDEFINED(80,610) /* TMap<FString, UAITrackLOGUnit*> */ __um(AITrackLOGData);                              // 0x00D8   (0x0050)  
	bool                                               bAITrackEnabled;                                            // 0x0128   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0129   (0x0007)  MISSED
	SDK_UNDEFINED(80,611) /* TMap<EAITrackLOGType, FString> */ __um(AITrackLOGTemplate);                           // 0x0130   (0x0050)  
	TArray<class AActor*>                              DSPoseUpdateWaitList;                                       // 0x0180   (0x0010)  
	TArray<class AActor*>                              DSLeanPoseUpdateWaitList;                                   // 0x0190   (0x0010)  
	class AActor*                                      DSPoseUpdateCharacter;                                      // 0x01A0   (0x0008)  
	TArray<class AActor*>                              DSIKUpdateWaitList;                                         // 0x01A8   (0x0010)  
	class AActor*                                      DSIKUpdateCharacter;                                        // 0x01B8   (0x0008)  
	TArray<FAIProtectTreasureBox>                      TreasureBoxInfos;                                           // 0x01C0   (0x0010)  
	SDK_UNDEFINED(80,612) /* TMap<UClass*, EAIProfileType> */ __um(AIPropClassTypes);                              // 0x01D0   (0x0050)  
};

/// Class /Script/MFNPCAI.NPCAIGoalTarget
/// Size: 0x0018 (24 bytes) (0x000028 - 0x000040) align 8 pad: 0x0000
class UNPCAIGoalTarget : public UObject
{ 
public:
	class UNPCAIAttentionPoint*                        AttentionPoint;                                             // 0x0028   (0x0008)  
	class AAIController*                               AIOwner;                                                    // 0x0030   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0038   (0x0008)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGoalTarget.SetZeroGoal
	// void SetZeroGoal();                                                                                                      // [0x2dbc3b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.SetGoalTargetPoint
	// void SetGoalTargetPoint(class UNPCAIAttentionPoint* InPoint);                                                            // [0x2dbc220] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.SetAIOwner
	// void SetAIOwner(class AAIController* InOwner);                                                                           // [0x2951c30] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.PointLookComplete
	// void PointLookComplete(int32_t InLookingIndex);                                                                          // [0x2dbbc90] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.IsDanger
	// bool IsDanger();                                                                                                         // [0x2dbb9b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.HaveZeroTarget
	// bool HaveZeroTarget();                                                                                                   // [0xc1a920] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.HavePlaceTarget
	// bool HavePlaceTarget();                                                                                                  // [0x2dbb5f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.HaveMainTarget
	// bool HaveMainTarget();                                                                                                   // [0x2dbb5c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.GetPointType
	// ENPCPlaceForCheckType GetPointType();                                                                                    // [0x2dbb320] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.GetGoalTargetPoint
	// class UNPCAIAttentionPoint* GetGoalTargetPoint();                                                                        // [0x2dbaff0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.GetCreatedTime
	// float GetCreatedTime();                                                                                                  // [0x2dbaee0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.ClearGoalTarget
	// void ClearGoalTarget();                                                                                                  // [0x2dbad70] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGoalTarget.CanCheckBody
	// bool CanCheckBody();                                                                                                     // [0x2dba830] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupBaseRequest
/// Size: 0x0080 (128 bytes) (0x000028 - 0x0000A8) align 8 pad: 0x0000
class UNPCAIGroupBaseRequest : public UObject
{ 
public:
	int32_t                                            RequestType;                                                // 0x0028   (0x0004)  
	int32_t                                            DynamicGroupId;                                             // 0x002C   (0x0004)  
	bool                                               bOnlyInDynamicGroup;                                        // 0x0030   (0x0001)  
	EAIGroupRequestPriority                            RequestPriority;                                            // 0x0031   (0x0001)  
	bool                                               bCanExecuteByMyself;                                        // 0x0032   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0033   (0x0001)  MISSED
	int32_t                                            MaxTakenCount;                                              // 0x0034   (0x0004)  
	bool                                               IsNeedAllCompleted;                                         // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	int32_t                                            CurrentTakenCount;                                          // 0x003C   (0x0004)  
	int32_t                                            CurrentCompleteCount;                                       // 0x0040   (0x0004)  
	int32_t                                            MaxRequestCount;                                            // 0x0044   (0x0004)  
	int32_t                                            RequestTypeNeedCompletedInPast;                             // 0x0048   (0x0004)  
	float                                              StartTimeOfTake;                                            // 0x004C   (0x0004)  
	float                                              EndTimeOfTake;                                              // 0x0050   (0x0004)  
	float                                              EndTimeOfExecute;                                           // 0x0054   (0x0004)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0058   (0x0008)  MISSED
	class AActor*                                      Requester;                                                  // 0x0060   (0x0008)  
	class UObject*                                     WorldContext;                                               // 0x0068   (0x0008)  
	TArray<class AActor*>                              ExecuterList;                                               // 0x0070   (0x0010)  
	TArray<class AActor*>                              HistoryExecuterList;                                        // 0x0080   (0x0010)  
	TArray<class AActor*>                              PossibleExecuterList;                                       // 0x0090   (0x0010)  
	unsigned char                                      UnknownData03_7[0x8];                                       // 0x00A0   (0x0008)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.Take
	// void Take(class AActor* InExecuter);                                                                                     // [0x16b0a40] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.SetRequestTypeNeedCompletedInPast
	// bool SetRequestTypeNeedCompletedInPast();                                                                                // [0x2dbc380] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.SetPossibleExecuterList
	// void SetPossibleExecuterList(TArray<AActor*>& InExecuterList);                                                           // [0x2dbc2b0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.SetEndTimeOnTake
	// void SetEndTimeOnTake(float InEndTime);                                                                                  // [0x2dbc1a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.SetEndTimeOnExecute
	// void SetEndTimeOnExecute(float InEndTime);                                                                               // [0x2dbc120] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.RemoveFromExecuterList
	// void RemoveFromExecuterList(class AActor* InExecuter);                                                                   // [0x2dbbdb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.IsPossibleExecuter
	// bool IsPossibleExecuter(class AActor* InExecuter);                                                                       // [0x2dbbbf0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.IsInHistoryExecuter
	// bool IsInHistoryExecuter(class AActor* InExecuter);                                                                      // [0x2dbbb50] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.IsInExecuter
	// bool IsInExecuter(class AActor* InExecuter);                                                                             // [0x2dbbab0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.IsGroupAsRequester
	// bool IsGroupAsRequester();                                                                                               // [0x2dbba80] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.InitRequestType
	// bool InitRequestType();                                                                                                  // [0x2dbb8a0] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.InitRequestInfo
	// void InitRequestInfo(class AActor* InRequester, int32_t InMaxTakenCount, float InEndOfTakeTime, class UObject* InWorldContext); // [0x2dbb740] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.InitRequestByBluePrint
	// bool InitRequestByBluePrint();                                                                                           // [0xfa3a40] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.GetStartTimeOfTake
	// float GetStartTimeOfTake();                                                                                              // [0x2dbb4f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.GetRequestName
	// FString GetRequestName();                                                                                                // [0x29be2a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.GetRequester
	// class AActor* GetRequester();                                                                                            // [0x2dbb4c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.GetExecuterList
	// TArray<AActor*> GetExecuterList();                                                                                       // [0x2dbaf40] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.GetEndTimeOfTake
	// float GetEndTimeOfTake();                                                                                                // [0x2dbaf10] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.Dispose
	// void Dispose();                                                                                                          // [0x2dbad90] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.CheckIsEndOfTake
	// bool CheckIsEndOfTake(float InCurrentRuntime);                                                                           // [0x2dbace0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.CheckIsEndOfExecute
	// bool CheckIsEndOfExecute(float InCurrentRuntime);                                                                        // [0x2dbac50] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.CheckCanTakeRequestForLastRequestLimit
	// bool CheckCanTakeRequestForLastRequestLimit(class AActor* InExecuter);                                                   // [0x2dbabb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.CheckCanTakeRequestForGroupLimit
	// bool CheckCanTakeRequestForGroupLimit(class AActor* InExecuter);                                                         // [0x2dbab10] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.CheckCanTakeRequestAllLimit
	// bool CheckCanTakeRequestAllLimit(class AActor* InExecuter);                                                              // [0x2dbaa70] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.CheckCanTakeRequest
	// bool CheckCanTakeRequest(class AActor* InExecuter);                                                                      // [0x2dba9d0] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.CanRequest
	// bool CanRequest();                                                                                                       // [0x2dba900] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.CanProceed
	// bool CanProceed(class AActor* InExecuter);                                                                               // [0x2dba860] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupBaseRequest.AddPossibleExecuter
	// void AddPossibleExecuter(class AActor* InExecuter);                                                                      // [0x2dba670] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupAttackCloseRequest
/// Size: 0x0000 (0 bytes) (0x0000A8 - 0x0000A8) align 8 pad: 0x0000
class UNPCAIGroupAttackCloseRequest : public UNPCAIGroupBaseRequest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIGroupCustomRequest
/// Size: 0x0000 (0 bytes) (0x0000A8 - 0x0000A8) align 8 pad: 0x0000
class UNPCAIGroupCustomRequest : public UNPCAIGroupBaseRequest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIGroupDoorOpenRequest
/// Size: 0x0008 (8 bytes) (0x0000A8 - 0x0000B0) align 8 pad: 0x0000
class UNPCAIGroupDoorOpenRequest : public UNPCAIGroupBaseRequest
{ 
public:
	class AActor*                                      Door;                                                       // 0x00A8   (0x0008)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupDoorOpenRequest.InitData
	// void InitData(class AActor* InDoor);                                                                                     // [0x2dbb620] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupFollowMeRequest
/// Size: 0x0008 (8 bytes) (0x0000A8 - 0x0000B0) align 8 pad: 0x0000
class UNPCAIGroupFollowMeRequest : public UNPCAIGroupBaseRequest
{ 
public:
	float                                              TimeLimit;                                                  // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x00AC   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupFollowMeRequest.IsExecuterFar
	// bool IsExecuterFar(class AActor* InExecuter);                                                                            // [0x2dbb9e0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupGoToPointRequest
/// Size: 0x0010 (16 bytes) (0x0000A8 - 0x0000B8) align 8 pad: 0x0000
class UNPCAIGroupGoToPointRequest : public UNPCAIGroupBaseRequest
{ 
public:
	FVector                                            PointToGo;                                                  // 0x00A8   (0x000C)  
	float                                              Radius;                                                     // 0x00B4   (0x0004)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupGoToPointRequest.InitTargetPoint
	// void InitTargetPoint(FVector InTargetPoint, float InRadius);                                                             // [0x2dbb8d0] Final|Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupHideRequest
/// Size: 0x0000 (0 bytes) (0x0000A8 - 0x0000A8) align 8 pad: 0x0000
class UNPCAIGroupHideRequest : public UNPCAIGroupBaseRequest
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIGroupHoldRequest
/// Size: 0x0010 (16 bytes) (0x0000A8 - 0x0000B8) align 8 pad: 0x0000
class UNPCAIGroupHoldRequest : public UNPCAIGroupBaseRequest
{ 
public:
	FVector                                            Direction;                                                  // 0x00A8   (0x000C)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x00B4   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupHoldRequest.InitData
	// void InitData(FVector InDirection);                                                                                      // [0x2dbb6b0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupHoldRequest.GetProjectionPoint
	// FVector GetProjectionPoint(FVector InP1, FVector InP2, FVector InP3);                                                    // [0x2dbb350] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupHoldRequest.CalculateDirection
	// void CalculateDirection(class AActor* InExecuter, FVector InDirection, FVector InRequesterHeadPos);                      // [0x2dba700] Final|Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAISubSystemComponent
/// Size: 0x0010 (16 bytes) (0x0000F8 - 0x000108) align 8 pad: 0x0000
class UNPCAISubSystemComponent : public UActorComponent
{ 
public:
	class ACharacter*                                  OwnerPawn;                                                  // 0x00F8   (0x0008)  
	class AAIController*                               OwnerController;                                            // 0x0100   (0x0008)  
};

/// Class /Script/MFNPCAI.NPCAIGroupRequestComponent
/// Size: 0x0060 (96 bytes) (0x000108 - 0x000168) align 8 pad: 0x0000
class UNPCAIGroupRequestComponent : public UNPCAISubSystemComponent
{ 
public:
	bool                                               bIsLogEnabled;                                              // 0x0108   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0109   (0x0007)  MISSED
	class UClass*                                      ClassOfWarnPlayerRequest;                                   // 0x0110   (0x0008)  
	int32_t                                            LastCompletedRequestType;                                   // 0x0118   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x011C   (0x0004)  MISSED
	SDK_UNDEFINED(16,613) /* FMulticastInlineDelegate */ __um(OnRequestCompleted);                                 // 0x0120   (0x0010)  
	SDK_UNDEFINED(16,614) /* FMulticastInlineDelegate */ __um(OnRequestGiveUp);                                    // 0x0130   (0x0010)  
	float                                              NextSearchRequestTime;                                      // 0x0140   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0144   (0x0004)  MISSED
	class UNPCAIGroupBaseRequest*                      CurrentRequest;                                             // 0x0148   (0x0008)  
	TArray<int32_t>                                    CompletedRequestTypeList;                                   // 0x0150   (0x0010)  
	class UNPCAIGroupRequestController*                GpRequestController;                                        // 0x0160   (0x0008)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.Update
	// void Update();                                                                                                           // [0x2dbdac0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.TryToFindRequest
	// bool TryToFindRequest();                                                                                                 // [0x2dbda90] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.TryGiveUpCurrentRequest
	// void TryGiveUpCurrentRequest();                                                                                          // [0x2dbda70] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.TickCheckCurrentRequestIsValid
	// void TickCheckCurrentRequestIsValid();                                                                                   // [0x2dbc3d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.SetCurrentRequestCompleted
	// void SetCurrentRequestCompleted();                                                                                       // [0x2dbc100] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.SetCurrentRequest
	// void SetCurrentRequest(class UNPCAIGroupBaseRequest* InRequest);                                                         // [0x2dbc070] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.HasCompletedRequestInPast
	// bool HasCompletedRequestInPast(int32_t InRequestType);                                                                   // [0x2dbb520] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.GetGroupRequestController
	// class UNPCAIGroupRequestController* GetGroupRequestController();                                                         // [0x2dbb0c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.CheckCanReplaceHighPriorityRequest
	// bool CheckCanReplaceHighPriorityRequest(class UNPCAIGroupBaseRequest* InNewRequest);                                     // [0x2dba930] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestComponent.AcceptRequest
	// bool AcceptRequest(class UNPCAIGroupBaseRequest* InRequest);                                                             // [0x2dba5d0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupRequestController
/// Size: 0x0018 (24 bytes) (0x000028 - 0x000040) align 8 pad: 0x0000
class UNPCAIGroupRequestController : public UObject
{ 
public:
	TArray<class UNPCAIGroupBaseRequest*>              GroupRequestsList;                                          // 0x0028   (0x0010)  
	float                                              LastTimeAutoFiltRequests;                                   // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x003C   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryAddRequest
	// bool TryAddRequest(class UNPCAIGroupBaseRequest* InRequest);                                                             // [0x2dbd9d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateWarnPlayerRequest
	// class UNPCAIGroupBaseRequest* TryActivateWarnPlayerRequest(class AActor* InRequester, class ACharacter* InWarnPlayer, int32_t InMaxExecuterCount, class UClass* InRequestClass, bool InIsNeedAllCompleted); // [0x2dbd830] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateThrowGrenadeRequest
	// class UNPCAIGroupBaseRequest* TryActivateThrowGrenadeRequest(class AActor* InRequester, class ACharacter* InEnemy, FVector InThrowPoint, int32_t InMaxExecuterCount, class UClass* InRequestClass, bool InIsNeedAllCompleted); // [0x2dbd650] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateSussperssionFireRequest
	// class UNPCAIGroupBaseRequest* TryActivateSussperssionFireRequest(class AActor* InRequester, class ACharacter* InEnemy, FVector InFirePoint, int32_t InMaxExecuterCount, class UClass* InRequestClass, bool InIsNeedAllCompleted); // [0x2dbd470] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateRequestByGroup
	// class UNPCAIGroupBaseRequest* TryActivateRequestByGroup(class UObject* InWorldContextObject, class UClass* InRequestClass, int32_t InMaxExecuterCount, bool InIsNeedAllCompleted, bool InOnlyInDynamicGroup, bool InCanExecuteByMyself, TArray<AActor*>& InPossibleExecuterList); // [0x2dbd1f0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateRequestByClass
	// class UNPCAIGroupBaseRequest* TryActivateRequestByClass(class AActor* InRequester, class UClass* InRequestClass, int32_t InMaxExecuterCount, bool InIsNeedAllCompleted, bool InCanExecuteByMyself, TArray<AActor*>& InPossibleExecuterList); // [0x2dbcfd0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateRequest
	// class UNPCAIGroupBaseRequest* TryActivateRequest(class AActor* InRequester, class UNPCAIGroupBaseRequest* InRequestInstance, int32_t InMaxExecuterCount, bool InIsNeedAllCompleted, bool InCanExecuteByMyself, TArray<AActor*>& InPossibleExecuterList); // [0x2dbcdb0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateOpenDoorRequest
	// class UNPCAIGroupBaseRequest* TryActivateOpenDoorRequest(class AActor* InRequester, class AActor* InDoor, class UClass* InRequestClass, bool InIsNeedAllCompleted); // [0x2dbcc50] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateHoldRequest
	// class UNPCAIGroupBaseRequest* TryActivateHoldRequest(class AActor* InRequester, FVector InDirection, int32_t InMaxExecuterCount, class UClass* InRequestClass, bool InIsNeedAllCompleted); // [0x2dbca70] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateHideRequest
	// class UNPCAIGroupBaseRequest* TryActivateHideRequest(class AActor* InRequester, int32_t InMaxExecuterCount, class UClass* InRequestClass, bool InIsNeedAllCompleted); // [0x2dbc910] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateGoToPointRequest
	// class UNPCAIGroupBaseRequest* TryActivateGoToPointRequest(class AActor* InRequester, FVector InPoint, float InRadius, int32_t InMaxExecuterCount, class UClass* InRequestClass, bool InIsNeedAllCompleted); // [0x2dbc730] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateFollowMeRequest
	// class UNPCAIGroupBaseRequest* TryActivateFollowMeRequest(class AActor* InRequester, int32_t InMaxExecuterCount, class UClass* InRequestClass, bool InIsNeedAllCompleted); // [0x2dbc5d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.TryActivateCustomRequest
	// class UNPCAIGroupBaseRequest* TryActivateCustomRequest(class AActor* InRequester, class UNPCAIGroupCustomRequest* InRequest, class AActor* PossibleExecuter, bool bResetSearchTime, bool InIsNeedAllCompleted, bool bCleanPendingRequest); // [0x2dbc3f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.RequestGiveUpToDo
	// void RequestGiveUpToDo(class UNPCAIGroupBaseRequest* InRequest, class AActor* InExecuter);                               // [0x2dbbfa0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.RequestCompletedToDo
	// void RequestCompletedToDo(class UNPCAIGroupBaseRequest* InRequest, class AActor* InExecuter);                            // [0x2dbbed0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.RemoveRequestInList
	// void RemoveRequestInList(class UNPCAIGroupBaseRequest* InRequest);                                                       // [0x2dbbe40] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.RemoveAllByRequester
	// void RemoveAllByRequester(class AActor* InRequester);                                                                    // [0x2dbbd20] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.GetGroupRequestsList
	// TArray<UNPCAIGroupBaseRequest*> GetGroupRequestsList();                                                                  // [0x2dbb290] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.GetGroupRequestListByType
	// int32_t GetGroupRequestListByType(int32_t InRequestType, TArray<UNPCAIGroupBaseRequest*>& OutRequestsList);              // [0x2dbb190] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.GetGroupRequestCountByType
	// int32_t GetGroupRequestCountByType(int32_t InRequestType);                                                               // [0x2dbb0f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.GetGroupRequestCount
	// int32_t GetGroupRequestCount();                                                                                          // [0x18d14a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.GetGroupRequestByType
	// class UNPCAIGroupBaseRequest* GetGroupRequestByType(int32_t InRequestType);                                              // [0x2dbb020] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.FindForMe
	// class UNPCAIGroupBaseRequest* FindForMe(class AActor* InExecuter);                                                       // [0x2dbae40] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupRequestController.FilterInValidRequest
	// void FilterInValidRequest(class UObject* WorldContext);                                                                  // [0x2dbadb0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupSusspressionFireRequest
/// Size: 0x0020 (32 bytes) (0x0000A8 - 0x0000C8) align 8 pad: 0x0000
class UNPCAIGroupSusspressionFireRequest : public UNPCAIGroupBaseRequest
{ 
public:
	EAIGroupRequestFireTarget                          TargetType;                                                 // 0x00A8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00A9   (0x0007)  MISSED
	class AActor*                                      EnemyTarget;                                                // 0x00B0   (0x0008)  
	FVector                                            PointTarget;                                                // 0x00B8   (0x000C)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x00C4   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupSusspressionFireRequest.IsEnemyLost
	// bool IsEnemyLost();                                                                                                      // [0x2dc01d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupSusspressionFireRequest.InitEnemy
	// void InitEnemy(class AActor* InEnemy, FVector InFirePoint);                                                              // [0x2dc0010] Final|Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupThrowGrenadeRequest
/// Size: 0x0018 (24 bytes) (0x0000A8 - 0x0000C0) align 8 pad: 0x0000
class UNPCAIGroupThrowGrenadeRequest : public UNPCAIGroupBaseRequest
{ 
public:
	class AActor*                                      EnemyTarget;                                                // 0x00A8   (0x0008)  
	FVector                                            PointTarget;                                                // 0x00B0   (0x000C)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x00BC   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupThrowGrenadeRequest.IsThrowEnemy
	// bool IsThrowEnemy();                                                                                                     // [0x2dc0320] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupThrowGrenadeRequest.IsEnemyLost
	// bool IsEnemyLost();                                                                                                      // [0x2dc0200] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupThrowGrenadeRequest.InitEnemy
	// void InitEnemy(class AActor* InEnemy, FVector InThrowPoint);                                                             // [0x2dc00f0] Final|Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIGroupWarnPlayerRequest
/// Size: 0x0028 (40 bytes) (0x0000A8 - 0x0000D0) align 8 pad: 0x0000
class UNPCAIGroupWarnPlayerRequest : public UNPCAIGroupBaseRequest
{ 
public:
	class AActor*                                      WarnPlayer;                                                 // 0x00A8   (0x0008)  
	EAIStateWarnPlayerRequest                          StateWarnPlayer;                                            // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x00B1   (0x0003)  MISSED
	float                                              DistanceToRequester;                                        // 0x00B4   (0x0004)  
	FVector                                            PointToShoot;                                               // 0x00B8   (0x000C)  
	float                                              TimeOfStay;                                                 // 0x00C4   (0x0004)  
	int32_t                                            CountOfWarns;                                               // 0x00C8   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x00CC   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIGroupWarnPlayerRequest.ShallEndStay
	// bool ShallEndStay(class AActor* InExecuter);                                                                             // [0x2dc1030] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupWarnPlayerRequest.OnStateToDo
	// void OnStateToDo(class AActor* InExecuter);                                                                              // [0x16b18f0] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupWarnPlayerRequest.NextState
	// void NextState(class AActor* InExecuter);                                                                                // [0x16b1ae0] Native|Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAIGroupWarnPlayerRequest.IsWarnPlayerAwayFromRequester
	// bool IsWarnPlayerAwayFromRequester();                                                                                    // [0x2dc0350] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupWarnPlayerRequest.InitData
	// void InitData(class AActor* InTargetToWarn);                                                                             // [0x2dbb620] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupWarnPlayerRequest.GetPointToShoot
	// FVector GetPointToShoot();                                                                                               // [0x2dbffa0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIGroupWarnPlayerRequest.CalculatePointToShoot
	// void CalculatePointToShoot();                                                                                            // [0x2dbfc10] Final|Native|Public|BlueprintCallable 
};

/// Struct /Script/MFNPCAI.MetisOptions
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 4 pad: 0x0000
struct FMetisOptions
{ 
	bool                                               bUseDefault;                                                // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	EMETIS_OBJTYPE                                     ObjectiveType;                                              // 0x0004   (0x0004)  
	EMETIS_CTYPE                                       CoarsenType;                                                // 0x0008   (0x0004)  
	EMETIS_IPTYPE                                      InitialPartitioningType;                                    // 0x000C   (0x0004)  
	EMETIS_RTYPE                                       RifinementType;                                             // 0x0010   (0x0004)  
	int32_t                                            NCuts;                                                      // 0x0014   (0x0004)  
	int32_t                                            IterateTimes;                                               // 0x0018   (0x0004)  
	bool                                               bMinimizeMaximumConnectivity;                               // 0x001C   (0x0001)  
	bool                                               bNo2Hop;                                                    // 0x001D   (0x0001)  
	bool                                               bForcesContiguousPartitions;                                // 0x001E   (0x0001)  
	unsigned char                                      UnknownData01_7[0x1];                                       // 0x001F   (0x0001)  MISSED
};

/// Struct /Script/MFNPCAI.HNavSettings
/// Size: 0x003C (60 bytes) (0x000000 - 0x00003C) align 4 pad: 0x0000
struct FHNavSettings
{ 
	bool                                               bAutoBuildAfterNavigationGenerationFinished;                // 0x0000   (0x0001)  
	bool                                               bBuildIntermediateGraph;                                    // 0x0001   (0x0001)  
	bool                                               bRemoveIntermediateGraph;                                   // 0x0002   (0x0001)  
	bool                                               bIntraPathOnlyInSelfNode;                                   // 0x0003   (0x0001)  
	bool                                               bCombineMultiEdges;                                         // 0x0004   (0x0001)  
	bool                                               bEnableEdgeWeight;                                          // 0x0005   (0x0001)  
	bool                                               bBreakNavLinkConnection;                                    // 0x0006   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0007   (0x0001)  MISSED
	int32_t                                            MaxGraphLevel;                                              // 0x0008   (0x0004)  
	int32_t                                            PartitionSize;                                              // 0x000C   (0x0004)  
	int32_t                                            ForceBuildForTopK;                                          // 0x0010   (0x0004)  
	int32_t                                            MinNodeCountToBuild;                                        // 0x0014   (0x0004)  
	int32_t                                            MaxSearchNode;                                              // 0x0018   (0x0004)  
	FMetisOptions                                      MetisOptions;                                               // 0x001C   (0x0020)  
};

/// Struct /Script/MFNPCAI.PortalEdge
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 pad: 0x0000
struct FPortalEdge
{ 
	uint64_t                                           PackedData;                                                 // 0x0000   (0x0008)  
};

/// Struct /Script/MFNPCAI.IntraPath
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FIntraPath
{ 
	uint64_t                                           PackedData;                                                 // 0x0000   (0x0008)  
	TArray<uint64_t>                                   Nodes;                                                      // 0x0008   (0x0010)  
	float                                              Length;                                                     // 0x0018   (0x0004)  
	float                                              Cost;                                                       // 0x001C   (0x0004)  
};

/// Struct /Script/MFNPCAI.HNavGraph
/// Size: 0x0150 (336 bytes) (0x000000 - 0x000150) align 8 pad: 0x0000
struct FHNavGraph
{ 
	int32_t                                            Level;                                                      // 0x0000   (0x0004)  
	int32_t                                            NodeCount;                                                  // 0x0004   (0x0004)  
	bool                                               bIntermediate;                                              // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	TArray<int32_t>                                    ParentIndices;                                              // 0x0010   (0x0010)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x0020   (0x0020)  MISSED
	TArray<int32_t>                                    ChildIndexOffsets;                                          // 0x0040   (0x0010)  
	TArray<int32_t>                                    ChildIndices;                                               // 0x0050   (0x0010)  
	TArray<int32_t>                                    PortalEdgeOffsets;                                          // 0x0060   (0x0010)  
	TArray<FPortalEdge>                                PortalEdges;                                                // 0x0070   (0x0010)  
	TArray<int32_t>                                    IntraPathOffsets;                                           // 0x0080   (0x0010)  
	TArray<FIntraPath>                                 IntraPaths;                                                 // 0x0090   (0x0010)  
	TArray<int32_t>                                    IntraPathSourceIndexOffsets;                                // 0x00A0   (0x0010)  
	TArray<int32_t>                                    IntraPathSourceIndices;                                     // 0x00B0   (0x0010)  
	TArray<int32_t>                                    IntraPathTargetIndexOffsets;                                // 0x00C0   (0x0010)  
	unsigned char                                      UnknownData02_6[0x10];                                      // 0x00D0   (0x0010)  MISSED
	TArray<uint64_t>                                   IntraPathCounts;                                            // 0x00E0   (0x0010)  
	TArray<int32_t>                                    IntraPathPolyRefOffsets;                                    // 0x00F0   (0x0010)  
	TArray<uint64_t>                                   IntraPathPolyRefs;                                          // 0x0100   (0x0010)  
	TArray<float>                                      IntraPathCosts;                                             // 0x0110   (0x0010)  
	TArray<float>                                      IntraPathLengths;                                           // 0x0120   (0x0010)  
	unsigned char                                      UnknownData03_7[0x20];                                      // 0x0130   (0x0020)  MISSED
};

/// Struct /Script/MFNPCAI.HNavSearchInfo
/// Size: 0x0060 (96 bytes) (0x000000 - 0x000060) align 8 pad: 0x0000
struct FHNavSearchInfo
{ 
	unsigned char                                      UnknownData00_2[0x60];                                      // 0x0000   (0x0060)  MISSED
};

/// Class /Script/MFNPCAI.NPCAIHNavActor
/// Size: 0x0190 (400 bytes) (0x0002E0 - 0x000470) align 8 pad: 0x0000
class ANPCAIHNavActor : public AActor
{ 
public:
	FHNavSettings                                      Settings;                                                   // 0x02E0   (0x003C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x031C   (0x0004)  MISSED
	TArray<FHNavGraph>                                 Graphs;                                                     // 0x0320   (0x0010)  
	int32_t                                            MinimumPartitionCount;                                      // 0x0330   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0334   (0x0004)  MISSED
	TArray<char>                                       PortalNodeFlags;                                            // 0x0338   (0x0010)  
	unsigned char                                      UnknownData02_6[0xC0];                                      // 0x0348   (0x00C0)  MISSED
	FHNavSearchInfo                                    SearchedInfo;                                               // 0x0408   (0x0060)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0468   (0x0004)  MISSED
	bool                                               bUseDefaultPathfinding;                                     // 0x046C   (0x0001)  
	bool                                               bNewMaxPortalAdjacency;                                     // 0x046D   (0x0001)  
	unsigned char                                      UnknownData04_7[0x2];                                       // 0x046E   (0x0002)  MISSED
};

/// Class /Script/MFNPCAI.NPCAILaunchPad
/// Size: 0x0038 (56 bytes) (0x0002E0 - 0x000318) align 8 pad: 0x0000
class ANPCAILaunchPad : public AActor
{ 
public:
	class USceneComponent*                             Root;                                                       // 0x02E0   (0x0008)  
	class UStaticMeshComponent*                        Launchpad;                                                  // 0x02E8   (0x0008)  
	class USphereComponent*                            TriggerVolume;                                              // 0x02F0   (0x0008)  
	class UNavLinkComponent*                           NavLink;                                                    // 0x02F8   (0x0008)  
	FVector                                            Target;                                                     // 0x0300   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x030C   (0x0004)  MISSED
	class ACharacter*                                  LaunchedCharacter;                                          // 0x0310   (0x0008)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAILaunchPad.OnTriggerBeginOverlap
	// void OnTriggerBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2dc0380] Final|Native|Public|HasOutParms 
	// Function /Script/MFNPCAI.NPCAILaunchPad.CanTriggerLaunch
	// bool CanTriggerLaunch(class ACharacter* Other);                                                                          // [0x3a75280] Event|Public|BlueprintEvent 
	// Function /Script/MFNPCAI.NPCAILaunchPad.CalculateLaunchVelocity
	// FVector CalculateLaunchVelocity(class AActor* LaunchedActor);                                                            // [0x2dbfb60] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAILaunchPad.BP_LaunchCharacter
	// void BP_LaunchCharacter(class ACharacter* Character);                                                                    // [0x3a75280] Event|Protected|BlueprintEvent 
};

/// Struct /Script/MFNPCAI.AIBackUpCoverPointFinder
/// Size: 0x001C (28 bytes) (0x000000 - 0x00001C) align 4 pad: 0x0000
struct FAIBackUpCoverPointFinder
{ 
	FVector                                            AIPosistion;                                                // 0x0000   (0x000C)  
	FVector                                            EnemyPosition;                                              // 0x000C   (0x000C)  
	float                                              LastTime;                                                   // 0x0018   (0x0004)  
};

/// Struct /Script/MFNPCAI.AIStackGunRecord
/// Size: 0x0044 (68 bytes) (0x000000 - 0x000044) align 4 pad: 0x0000
struct FAIStackGunRecord
{ 
	bool                                               CanStackGun;                                                // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	FVector                                            MyPosition;                                                 // 0x0004   (0x000C)  
	FVector                                            EnemyPosition;                                              // 0x0010   (0x000C)  
	EAILeanType                                        AILean;                                                     // 0x001C   (0x0001)  
	EAIPose                                            AIPose;                                                     // 0x001D   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x001E   (0x0002)  MISSED
	FVector                                            GunPoint;                                                   // 0x0020   (0x000C)  
	FVector                                            EeyPoint;                                                   // 0x002C   (0x000C)  
	FVector                                            ShootPoint;                                                 // 0x0038   (0x000C)  
};

/// Struct /Script/MFNPCAI.AIRoundPathFindingNodes
/// Size: 0x0080 (128 bytes) (0x000000 - 0x000080) align 8 pad: 0x0000
struct FAIRoundPathFindingNodes
{ 
	float                                              LastTimeCheckUpdate;                                        // 0x0000   (0x0004)  
	int32_t                                            CheckUpdateCount;                                           // 0x0004   (0x0004)  
	float                                              RoundPathLength;                                            // 0x0008   (0x0004)  
	float                                              RadiusReCalcRoundPathNodes;                                 // 0x000C   (0x0004)  
	int64_t                                            CurrentPolyId;                                              // 0x0010   (0x0008)  
	FVector                                            LastLocationCalcRoundPathNodes;                             // 0x0018   (0x000C)  
	unsigned char                                      UnknownData00_7[0x5C];                                      // 0x0024   (0x005C)  MISSED
};

/// Struct /Script/MFNPCAI.NPCAIQueryRoundEnvironmentResult
/// Size: 0x005C (92 bytes) (0x000000 - 0x00005C) align 4 pad: 0x0000
struct FNPCAIQueryRoundEnvironmentResult
{ 
	FVector                                            AILocation;                                                 // 0x0000   (0x000C)  
	FVector                                            EnemyLocation;                                              // 0x000C   (0x000C)  
	bool                                               LCanMove;                                                   // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0019   (0x0003)  MISSED
	FVector                                            LMovePoint;                                                 // 0x001C   (0x000C)  
	bool                                               RCanMove;                                                   // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0029   (0x0003)  MISSED
	FVector                                            RMovePoint;                                                 // 0x002C   (0x000C)  
	bool                                               FCanMove;                                                   // 0x0038   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	FVector                                            FMovePoint;                                                 // 0x003C   (0x000C)  
	bool                                               BCanMove;                                                   // 0x0048   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x0049   (0x0003)  MISSED
	FVector                                            BMovePoint;                                                 // 0x004C   (0x000C)  
	bool                                               LCanDefense;                                                // 0x0058   (0x0001)  
	bool                                               RCanDefense;                                                // 0x0059   (0x0001)  
	bool                                               LCanAttack;                                                 // 0x005A   (0x0001)  
	bool                                               RCanAttack;                                                 // 0x005B   (0x0001)  
};

/// Class /Script/MFNPCAI.NPCAIMemorySystemComponent
/// Size: 0x0208 (520 bytes) (0x000108 - 0x000310) align 8 pad: 0x0000
class UNPCAIMemorySystemComponent : public UNPCAISubSystemComponent
{ 
public:
	class AAIController*                               AIOwner;                                                    // 0x0108   (0x0008)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0110   (0x0010)  MISSED
	bool                                               IsLockingGoalEnemy;                                         // 0x0120   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0121   (0x0007)  MISSED
	class UNPCAITargetInfo*                            GoalEnemy;                                                  // 0x0128   (0x0008)  
	class UNPCAITargetInfo*                            LastEnemy;                                                  // 0x0130   (0x0008)  
	FString                                            MemoryServiceNodeName;                                      // 0x0138   (0x0010)  
	class UNPCAIGoalTarget*                            GoalTarget;                                                 // 0x0148   (0x0008)  
	FVector                                            CheckCoverPointPosition;                                    // 0x0150   (0x000C)  
	int32_t                                            CurrentCoverPointID;                                        // 0x015C   (0x0004)  
	FAIBackUpCoverPointFinder                          BackUpCoverPointFinder;                                     // 0x0160   (0x001C)  
	int32_t                                            PeekCount;                                                  // 0x017C   (0x0004)  
	char                                               CallUpReason;                                               // 0x0180   (0x0001)  
	char                                               CallUpResult;                                               // 0x0181   (0x0001)  
	unsigned char                                      UnknownData02_6[0x2];                                       // 0x0182   (0x0002)  MISSED
	float                                              LastMolotovHurttime;                                        // 0x0184   (0x0004)  
	float                                              SightWeakenEndTime;                                         // 0x0188   (0x0004)  
	bool                                               bIsInTryLeanShoot;                                          // 0x018C   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x018D   (0x0003)  MISSED
	float                                              PauseBehaviorEndTime;                                       // 0x0190   (0x0004)  
	FAIStackGunRecord                                  StackGunRecord;                                             // 0x0194   (0x0044)  
	TArray<int32_t>                                    AcceptedSceneEvtUniqueIds;                                  // 0x01D8   (0x0010)  
	FAIRoundPathFindingNodes                           RoundPathNodes;                                             // 0x01E8   (0x0080)  
	class AActor*                                      TreasureBoxWantProtect;                                     // 0x0268   (0x0008)  
	FVector                                            Cache_AmbushAgainstStartPoint;                              // 0x0270   (0x000C)  
	FVector                                            Cache_AmbushAgainstEndPoint;                                // 0x027C   (0x000C)  
	FVector                                            Cache_AmbushAgainstResultPoint;                             // 0x0288   (0x000C)  
	FNPCAIQueryRoundEnvironmentResult                  Cache_QREResult;                                            // 0x0294   (0x005C)  
	class UActorComponent*                             AIStaticComponent;                                          // 0x02F0   (0x0008)  
	class UAISceneEventsTriggerManager*                AISceneEventsTriggerManager;                                // 0x02F8   (0x0008)  
	class UNPCAIPerceptionComponent*                   CachedPerceptionComponent;                                  // 0x0300   (0x0008)  
	class UNPCAIMoverSystemComponent*                  MoverSystemComponent;                                       // 0x0308   (0x0008)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.UpdateRoundPathNodes
	// void UpdateRoundPathNodes();                                                                                             // [0x2dc10d0] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetStackGunRecord
	// void SetStackGunRecord(FVector& InMyPos, FVector& InEnemyPos, EAIPose& InPose, EAILeanType& InLean);                     // [0x2dc0e90] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetSightWeakenTime
	// void SetSightWeakenTime(float WeakenTime);                                                                               // [0x2dc0e10] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetPauseBehaviorTime
	// void SetPauseBehaviorTime(float Time);                                                                                   // [0x2dc0d90] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetLastCalculateBackUpCoverPointNearBy
	// void SetLastCalculateBackUpCoverPointNearBy(FVector& InEnemyPos);                                                        // [0x2dc0d00] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetIsMolotovHurted
	// void SetIsMolotovHurted(bool bInHurted);                                                                                 // [0x2dc0c70] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetIsInTryLeanShoot
	// void SetIsInTryLeanShoot(bool bTryLean);                                                                                 // [0x2dc0be0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetGoalTarget
	// void SetGoalTarget(class AActor* InOwner, class UNPCAIAttentionPoint* InPoint);                                          // [0x2dc0b20] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetGoalEnemy
	// void SetGoalEnemy(class AActor* InOwner, class UNPCAITargetInfo* InEnemy);                                               // [0x2dc0a60] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.SetCurrentCoverPoint
	// void SetCurrentCoverPoint(class AActor* InOwner, int32_t InCoverPointID);                                                // [0x2dc09a0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.RemoveSceneEvent
	// void RemoveSceneEvent(int32_t EventUniqueId);                                                                            // [0x2dc0910] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.QueryPathLengthToPoint
	// float QueryPathLengthToPoint(FVector& ToPoint, int64_t& PointPolyRef, bool bTryUpdatePathNodes);                         // [0x2dc07e0] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.QueryNavPathPoints
	// bool QueryNavPathPoints(FVector& ToPoint, TArray<FVector>& Paths);                                                       // [0x2dc06d0] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.PointIsAroundAI
	// bool PointIsAroundAI(FVector& ToPoint, int64_t& PointPolyRef, bool bTryUpdatePathNodes);                                 // [0x2dc05a0] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.IsSightWeaken
	// bool IsSightWeaken();                                                                                                    // [0x2dc02f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.IsInCover
	// bool IsInCover();                                                                                                        // [0x2dc02c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.IsGoalEnemyThreaten
	// bool IsGoalEnemyThreaten(float ThreatenDistance);                                                                        // [0x2dc0230] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.HasGoldEnemyOrTarget
	// bool HasGoldEnemyOrTarget();                                                                                             // [0x2dbffe0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.GetSightWeakenEndTime
	// float GetSightWeakenEndTime();                                                                                           // [0x28c98b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.GetPauseBehaviorEndTime
	// float GetPauseBehaviorEndTime();                                                                                         // [0x29a2770] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.GetIsMolotovHurted
	// bool GetIsMolotovHurted();                                                                                               // [0x2dbff70] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.GetIsInTryLeanShoot
	// bool GetIsInTryLeanShoot();                                                                                              // [0x29a2610] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.GetGoalTarget
	// class UNPCAIGoalTarget* GetGoalTarget(class AActor* InOwner);                                                            // [0x2dbfee0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.GetGoalEnemy
	// class UNPCAITargetInfo* GetGoalEnemy(class AActor* InOwner);                                                             // [0x2dbfe50] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.GetCurrentCoverPoint
	// bool GetCurrentCoverPoint(class AActor* InOwner, FCoverPointOctreeData& Out_CoverPoint);                                 // [0x2dbfd40] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.GetCachedPerceptionComponent
	// class UNPCAIPerceptionComponent* GetCachedPerceptionComponent();                                                         // [0x2dbfd10] Final|Native|Protected 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.CanCalculateBackUpCoverPointNearBy
	// bool CanCalculateBackUpCoverPointNearBy(FVector& InEnemyPos, float InRadiusNoCheck);                                     // [0x2dbfc30] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/MFNPCAI.NPCAIMemorySystemComponent.AcceptSceneEvent
	// bool AcceptSceneEvent(int32_t EventUniqueId);                                                                            // [0x2dbfac0] Final|Native|Public  
};

/// Class /Script/MFNPCAI.NPCAIPropertyProfileBase
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UNPCAIPropertyProfileBase : public UObject
{ 
public:
	class UClass*                                      PropertyComponentClass;                                     // 0x0028   (0x0008)  
	EAIProfileType                                     AIProfileType;                                              // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Class /Script/MFNPCAI.NPCAIModifierProfile
/// Size: 0x0000 (0 bytes) (0x000038 - 0x000038) align 8 pad: 0x0000
class UNPCAIModifierProfile : public UNPCAIPropertyProfileBase
{ 
public:
};

/// Class /Script/MFNPCAI.AIModifierAITypeProfile
/// Size: 0x0008 (8 bytes) (0x000038 - 0x000040) align 8 pad: 0x0000
class UAIModifierAITypeProfile : public UNPCAIModifierProfile
{ 
public:
	EAIMainType                                        AIMainType;                                                 // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/MFNPCAI.NPCAIProfileBaseComponent
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UNPCAIProfileBaseComponent : public UObject
{ 
public:
	class UNPCAIPropertyProfileBase*                   PropertyProfile;                                            // 0x0028   (0x0008)  
	class AActor*                                      Owner;                                                      // 0x0030   (0x0008)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAIProfileBaseComponent.GetTimeSeconds
	// float GetTimeSeconds();                                                                                                  // [0x2ddc130] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIProfileBaseComponent.GetOwner
	// class AActor* GetOwner();                                                                                                // [0x2ddbfb0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/MFNPCAI.NPCAIModifierComponent
/// Size: 0x0000 (0 bytes) (0x000038 - 0x000038) align 8 pad: 0x0000
class UNPCAIModifierComponent : public UNPCAIProfileBaseComponent
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAIModifierComponent_AIType
/// Size: 0x0000 (0 bytes) (0x000038 - 0x000038) align 8 pad: 0x0000
class UNPCAIModifierComponent_AIType : public UNPCAIModifierComponent
{ 
public:
};

/// Struct /Script/MFNPCAI.AIArmorAttributeModifier
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 4 pad: 0x0000
struct FAIArmorAttributeModifier
{ 
	float                                              DurabilityConsumeScale_Blocked;                             // 0x0000   (0x0004)  
	float                                              DurabilityConsumeScale_Penetrated;                          // 0x0004   (0x0004)  
	float                                              AntiPenetrationFactor;                                      // 0x0008   (0x0004)  
	float                                              DamageScaleForPenetration;                                  // 0x000C   (0x0004)  
	float                                              DamageScaleForBlock;                                        // 0x0010   (0x0004)  
};

/// Class /Script/MFNPCAI.AIModifierArmorProfile
/// Size: 0x0028 (40 bytes) (0x000038 - 0x000060) align 8 pad: 0x0000
class UAIModifierArmorProfile : public UNPCAIModifierProfile
{ 
public:
	FAIArmorAttributeModifier                          HeadArmor;                                                  // 0x0038   (0x0014)  
	FAIArmorAttributeModifier                          BodyArmor;                                                  // 0x004C   (0x0014)  
};

/// Class /Script/MFNPCAI.NPCAIModifierComponent_Armor
/// Size: 0x0008 (8 bytes) (0x000038 - 0x000040) align 8 pad: 0x0000
class UNPCAIModifierComponent_Armor : public UNPCAIModifierComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0038   (0x0008)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIModifierComponent_Armor.GetHeadArmor
	// FAIArmorAttributeModifier GetHeadArmor();                                                                                // [0x2dc42f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIModifierComponent_Armor.GetBodyArmor
	// FAIArmorAttributeModifier GetBodyArmor();                                                                                // [0x2dc3e00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/MFNPCAI.AIModifierDamageProfile
/// Size: 0x0008 (8 bytes) (0x000038 - 0x000040) align 8 pad: 0x0000
class UAIModifierDamageProfile : public UNPCAIModifierProfile
{ 
public:
	float                                              DamageScale;                                                // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Class /Script/MFNPCAI.NPCAIModifierComponent_Damage
/// Size: 0x0000 (0 bytes) (0x000038 - 0x000038) align 8 pad: 0x0000
class UNPCAIModifierComponent_Damage : public UNPCAIModifierComponent
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAIModifierComponent_Damage.GetDamageScale
	// float GetDamageScale();                                                                                                  // [0x2dc3fe0] Final|Native|Public|BlueprintCallable 
};

/// Struct /Script/MFNPCAI.AILocationMonitor
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FAILocationMonitor
{ 
	SDK_UNDEFINED(8,615) /* TWeakObjectPtr<APawn*> */  __um(Target);                                               // 0x0000   (0x0008)  
	float                                              MonitoringInterval;                                         // 0x0008   (0x0004)  
	float                                              MaxTimeAllowOutOfNavmesh;                                   // 0x000C   (0x0004)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x0010   (0x0010)  MISSED
};

/// Class /Script/MFNPCAI.NPCAIMoverSystemComponent
/// Size: 0x01D8 (472 bytes) (0x000108 - 0x0002E0) align 8 pad: 0x0000
class UNPCAIMoverSystemComponent : public UNPCAISubSystemComponent
{ 
public:
	bool                                               bAllowStrafe;                                               // 0x0108   (0x0001)  
	bool                                               bAllowPartialPath;                                          // 0x0109   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x010A   (0x0002)  MISSED
	float                                              AcceptableRadius;                                           // 0x010C   (0x0004)  
	float                                              OffsetFromCornersDistance;                                  // 0x0110   (0x0004)  
	float                                              DisposableOffsetFromCornersDistance;                        // 0x0114   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0118   (0x0004)  MISSED
	bool                                               bReachTestIncludesAgentRadius;                              // 0x011C   (0x0001)  
	bool                                               bReachTestIncludesGoalRadius;                               // 0x011D   (0x0001)  
	bool                                               bProjectGoalLocation;                                       // 0x011E   (0x0001)  
	unsigned char                                      UnknownData02_6[0x1];                                       // 0x011F   (0x0001)  MISSED
	bool                                               bHandleLandedDelegate;                                      // 0x0120   (0x0001)  
	bool                                               bEnableMoverSystem;                                         // 0x0121   (0x0001)  
	ENPCAIMovementKind                                 MovementKind;                                               // 0x0122   (0x0001)  
	unsigned char                                      UnknownData03_6[0x1];                                       // 0x0123   (0x0001)  MISSED
	int32_t                                            GotoPointDecision;                                          // 0x0124   (0x0004)  
	TArray<class AVolume*>                             AvoidVolumes;                                               // 0x0128   (0x0010)  
	unsigned char                                      UnknownData04_6[0x40];                                      // 0x0138   (0x0040)  MISSED
	FVector                                            DirCurPoint;                                                // 0x0178   (0x000C)  
	ENPCAIMoveResult                                   LastMoveResult;                                             // 0x0184   (0x0001)  
	unsigned char                                      UnknownData05_6[0x17];                                      // 0x0185   (0x0017)  MISSED
	float                                              CurrentSprintEngery;                                        // 0x019C   (0x0004)  
	class UNPCAIPropertyComponent_Move*                MoveProperty;                                               // 0x01A0   (0x0008)  
	FAILocationMonitor                                 LocationMonitor;                                            // 0x01A8   (0x0020)  
	unsigned char                                      UnknownData06_6[0x24];                                      // 0x01C8   (0x0024)  MISSED
	SDK_UNDEFINED(8,616) /* TWeakObjectPtr<AActor*> */ __um(CaredActorWhenMoving);                                 // 0x01EC   (0x0008)  
	float                                              CaredActorEffectRadius;                                     // 0x01F4   (0x0004)  
	FVector                                            BlendingVelocity;                                           // 0x01F8   (0x000C)  
	int32_t                                            CheckPointCountOnPath;                                      // 0x0204   (0x0004)  
	SDK_UNDEFINED(16,617) /* FMulticastInlineDelegate */ __um(OnAIPathChecked);                                    // 0x0208   (0x0010)  
	SDK_UNDEFINED(16,618) /* FMulticastInlineDelegate */ __um(OnAIGoDirectlyFinished);                             // 0x0218   (0x0010)  
	SDK_UNDEFINED(16,619) /* FMulticastInlineDelegate */ __um(OnOutOfNavmesh);                                     // 0x0228   (0x0010)  
	bool                                               bEnableDrawPathPoints;                                      // 0x0238   (0x0001)  
	bool                                               bUseFlanking;                                               // 0x0239   (0x0001)  
	unsigned char                                      UnknownData07_6[0x2];                                       // 0x023A   (0x0002)  MISSED
	FVector                                            DangerPoint;                                                // 0x023C   (0x000C)  
	FVector                                            DangerPointDirection;                                       // 0x0248   (0x000C)  
	float                                              DangerPointEffectRadius;                                    // 0x0254   (0x0004)  
	unsigned char                                      UnknownData08_6[0x4];                                       // 0x0258   (0x0004)  MISSED
	float                                              MaxTurnDistance;                                            // 0x025C   (0x0004)  
	float                                              MinTurnDistance;                                            // 0x0260   (0x0004)  
	float                                              DistanceCheck;                                              // 0x0264   (0x0004)  
	float                                              SwayWidthCheck;                                             // 0x0268   (0x0004)  
	float                                              SwayWidth;                                                  // 0x026C   (0x0004)  
	float                                              RandSwayWidthRate;                                          // 0x0270   (0x0004)  
	float                                              PathOffset;                                                 // 0x0274   (0x0004)  
	int32_t                                            SampleTimes;                                                // 0x0278   (0x0004)  
	int32_t                                            RegionWhereNavLinksNeedDisable;                             // 0x027C   (0x0004)  
	class UActorComponent*                             AIDoorOpenerComponent;                                      // 0x0280   (0x0008)  
	class UActorComponent*                             AIPoseComponent;                                            // 0x0288   (0x0008)  
	int32_t                                            Blending_Count;                                             // 0x0290   (0x0004)  
	float                                              Blending_Time;                                              // 0x0294   (0x0004)  
	unsigned char                                      UnknownData09_7[0x48];                                      // 0x0298   (0x0048)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.SetupRegionWhereNavLinksNeedDisable
	// void SetupRegionWhereNavLinksNeedDisable(int32_t RegionIndex);                                                           // [0x2dc69b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.SetupFlanking
	// void SetupFlanking(FVector& InDangerPoint, FVector& InDangerPointDirection, float InDangerPointEffectRadius);            // [0x2dc6880] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.SetIgnoreGotoPoint
	// void SetIgnoreGotoPoint(float IgnoreTime);                                                                               // [0x2dc6610] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.SetDisposableOffsetFromCornersDistance
	// void SetDisposableOffsetFromCornersDistance(float OffsetDistance);                                                       // [0x2dc6590] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.SetDestination
	// void SetDestination(FVector InPosition);                                                                                 // [0x2dc6500] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.SetCurrentMoveType
	// void SetCurrentMoveType(EAIMoveType InMoveType);                                                                         // [0x2dc6480] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.SetAvoidVolumes
	// void SetAvoidVolumes(TArray<AVolume*> Volumes);                                                                          // [0x2dc6280] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.PauseMovement
	// void PauseMovement(float PauseTime);                                                                                     // [0x2dc5da0] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.OnMovementModeChanged
	// void OnMovementModeChanged(class ACharacter* MovedCharacter, TEnumAsByte<EMovementMode> PrevMovementMode, char PreviousCustomMode); // [0x2dc5ac0] Final|Native|Protected 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.OnMoveCompleted
	// void OnMoveCompleted(FAIRequestID RequestID, TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x2dc59f0] Final|Native|Protected 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.OnLanded
	// void OnLanded(FHitResult& Hit);                                                                                          // [0x2dc5910] Final|Native|Protected|HasOutParms 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsSprintEnergyEnough
	// bool IsSprintEnergyEnough(bool bSprinting);                                                                              // [0x2dc5600] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsPauseMovement
	// bool IsPauseMovement();                                                                                                  // [0x2dc5170] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsMovingMayBlocking
	// bool IsMovingMayBlocking();                                                                                              // [0x2dc50a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsLastPathPassDoor
	// bool IsLastPathPassDoor();                                                                                               // [0x2dc5070] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsLastMoveSuccess
	// bool IsLastMoveSuccess();                                                                                                // [0x2dc5040] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsInIgnoreGotoPoint
	// bool IsInIgnoreGotoPoint();                                                                                              // [0x2dc4f70] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsGoalPositionReached
	// bool IsGoalPositionReached();                                                                                            // [0x2dc4da0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsComeTo
	// bool IsComeTo(bool OnCover);                                                                                             // [0x2dc4d00] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsCloseToDestination
	// bool IsCloseToDestination(float InRadius);                                                                               // [0x2dc4c70] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.IsAnyLegBroken
	// bool IsAnyLegBroken();                                                                                                   // [0x2dc4b60] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GoToPoint
	// void GoToPoint(FVector InPosition, bool bSlowAtTheEnd, float InReachDist, bool bShoudGetUp, bool bGetUpWithCheck, class AActor* CaredActor, float CaredActorEffectRadius, int32_t GoDecision); // [0x2dc4800] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GoDirectly
	// void GoDirectly(FVector& Direction, float Seconds, FVector& InBlendingVelocity);                                         // [0x2dc46d0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GoAccordingToWayPoints
	// void GoAccordingToWayPoints(FNavSkeletonGraphFindResult& PathResult, FNavSkeletonMoveSettings& Settings);                // [0x2dc45a0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetNearestDoorState
	// int32_t GetNearestDoorState();                                                                                           // [0x29a2120] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetNearestDoorLocation
	// FVector GetNearestDoorLocation();                                                                                        // [0x2dc4420] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetMoveType
	// EAIMoveType GetMoveType();                                                                                               // [0x2dc43c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetMoveProperty
	// class UNPCAIPropertyComponent_Move* GetMoveProperty();                                                                   // [0x2dc4390] Final|Native|Protected|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetMovementKind
	// ENPCAIMovementKind GetMovementKind();                                                                                    // [0x2dc43f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetLastMoveResult
	// ENPCAIMoveResult GetLastMoveResult();                                                                                    // [0x2dc4360] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetFromPosition
	// FVector GetFromPosition();                                                                                               // [0x2dc41b0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetDirCurPoint
	// FVector GetDirCurPoint();                                                                                                // [0x2dc4070] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetDestinationUpdateTime
	// float GetDestinationUpdateTime();                                                                                        // [0x2dc4050] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.GetDestination
	// FVector GetDestination();                                                                                                // [0x2dc4010] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.ClearMovement
	// void ClearMovement();                                                                                                    // [0x2dc3a30] Final|Native|Protected|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMoverSystemComponent.ClearLastPathPassDoorFlag
	// void ClearLastPathPassDoorFlag();                                                                                        // [0x2dc3a10] Final|Native|Public  
};

/// Class /Script/MFNPCAI.NPCAIMultiTargetSystemComponent
/// Size: 0x0098 (152 bytes) (0x000108 - 0x0001A0) align 8 pad: 0x0000
class UNPCAIMultiTargetSystemComponent : public UNPCAISubSystemComponent
{ 
public:
	bool                                               bDebugSuspectedPoint;                                       // 0x0108   (0x0001)  
	bool                                               bDebugShootOffsetScope;                                     // 0x0109   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x010A   (0x0002)  MISSED
	float                                              TimeOfShootOffsetScopeDraw;                                 // 0x010C   (0x0004)  
	bool                                               bDebugShootScopeTestPoints;                                 // 0x0110   (0x0001)  
	bool                                               bLogGoalEnemyScore;                                         // 0x0111   (0x0001)  
	bool                                               bWantCalculateGoalTargetPoint;                              // 0x0112   (0x0001)  
	bool                                               bWantCalculateGoalEnemy;                                    // 0x0113   (0x0001)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0114   (0x0004)  MISSED
	class UNPCAIZoneGroupInfo*                         ZoneGroupInfo;                                              // 0x0118   (0x0008)  
	int32_t                                            DynamicGroupId;                                             // 0x0120   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0124   (0x0004)  MISSED
	TArray<class UNPCAITargetInfo*>                    AllTargetInfoList;                                          // 0x0128   (0x0010)  
	float                                              LastChangeEnemyTime;                                        // 0x0138   (0x0004)  
	float                                              LastWantCalcEnemyTime;                                      // 0x013C   (0x0004)  
	unsigned char                                      UnknownData03_6[0x8];                                       // 0x0140   (0x0008)  MISSED
	class UNPCAIMemorySystemComponent*                 MemoryComponent;                                            // 0x0148   (0x0008)  
	class UNPCAIPerceptionComponent*                   PerceptionComponent;                                        // 0x0150   (0x0008)  
	class UActorComponent*                             AIStaticComponent;                                          // 0x0158   (0x0008)  
	class UNPCAIGlobalSharedInfo*                      SharedInfo;                                                 // 0x0160   (0x0008)  
	class UNPCAIPropertyComponent_Mind*                MindProps;                                                  // 0x0168   (0x0008)  
	class UNPCAIPropertyComponent_Hearing*             HearProps;                                                  // 0x0170   (0x0008)  
	class UNPCAIPropertyComponent_Aiming*              AimingProps;                                                // 0x0178   (0x0008)  
	class UNPCAIPropertyComponent_Health*              HealthProps;                                                // 0x0180   (0x0008)  
	class UNPCAIPropertyComponent_Grenade*             GrenadeProps;                                               // 0x0188   (0x0008)  
	class UNPCAIPropertyComponent_Damage*              DamageProps;                                                // 0x0190   (0x0008)  
	float                                              CD_CHANGE_GOALENEMY_IF_BOTH_NOT_SEE;                        // 0x0198   (0x0004)  
	unsigned char                                      UnknownData04_7[0x4];                                       // 0x019C   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.WantToCalculateGoalEnemy
	// void WantToCalculateGoalEnemy();                                                                                         // [0x2dc6d70] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.UpdateGroupEnemyVisibleInfo
	// void UpdateGroupEnemyVisibleInfo(class AActor* InEnemy, FVector InLastSeenPosition, float SeenTime);                     // [0x2dc6c50] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.SwitchToTemporaryEnemy
	// bool SwitchToTemporaryEnemy(class AActor* InNeutral, float InEndTime);                                                   // [0x2dc6b80] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.SwitchEnemyToNeutral
	// bool SwitchEnemyToNeutral(class AActor* InEnemy);                                                                        // [0x2dc6ae0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.SwitchEnemyToAlly
	// bool SwitchEnemyToAlly(class AActor* InEnemy);                                                                           // [0x2dc6a40] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.SetZoneGroupInfo
	// void SetZoneGroupInfo(class UNPCAIZoneGroupInfo* InGroupInfo);                                                           // [0x2dc67f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.SetKnowEnemySeenTimeAndPosition
	// void SetKnowEnemySeenTimeAndPosition(class AActor* InTargetPawn, bool bCanSeenSoon);                                     // [0x2dc6690] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.SearchDangerPoint
	// class UNPCAIAttentionPoint* SearchDangerPoint();                                                                         // [0x2dc61c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.SearchDangerEnemy
	// class UNPCAITargetInfo* SearchDangerEnemy();                                                                             // [0x2dc6190] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveSuspectedPointByType
	// void RemoveSuspectedPointByType(ENPCPlaceForCheckType InPlaceType, class AActor* InCreator);                             // [0x2dc60c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveSuspectedPoint
	// void RemoveSuspectedPoint(class UNPCAIAttentionPoint* InAttentionPoint, bool bRemoveNearCanSee);                         // [0x2dc5ff0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveNeutral
	// void RemoveNeutral(class AActor* InNeutral);                                                                             // [0x2dc5f60] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveEnemy
	// void RemoveEnemy(class AActor* InEnemy);                                                                                 // [0x2dc5ed0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveAlly
	// void RemoveAlly(class AActor* InAlly);                                                                                   // [0x2dc5e40] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.QuitToDynamicGroup
	// void QuitToDynamicGroup();                                                                                               // [0x2dc5e20] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.JoinToDynamicGroup
	// bool JoinToDynamicGroup(int32_t DyGroupId);                                                                              // [0x2dc56a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.IsPointInVShootScope
	// bool IsPointInVShootScope(FVector& GunPoint, FVector& ShootPoint, float HRadin, float VTopRadin, float VLowRadin, FVector& InPoint); // [0x2dc53d0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.IsPointInHShootScope
	// bool IsPointInHShootScope(FVector& GunPoint, FVector& ShootPoint, float HRadin, float VTopRadin, float VLowRadin, FVector& InPoint); // [0x2dc51a0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.IsNeutral
	// bool IsNeutral(class AActor* InNeutral);                                                                                 // [0x2dc50d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.IsInSameZoneGroup
	// bool IsInSameZoneGroup(class AActor* InTarget);                                                                          // [0x2dc4fa0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.IsGroupEnemy
	// bool IsGroupEnemy(class AActor* InEnemy);                                                                                // [0x2dc4dd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.IsAlly
	// bool IsAlly(class AActor* InAlly);                                                                                       // [0x2dc4ac0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.HasOthersAllyInShootScope
	// bool HasOthersAllyInShootScope();                                                                                        // [0x2dc4a90] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetZoneGroupInfo
	// class UNPCAIZoneGroupInfo* GetZoneGroupInfo();                                                                           // [0x286ae70] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetYoungestSuspectedPoint
	// class UNPCAIAttentionPoint* GetYoungestSuspectedPoint(class AActor* InCharacter, float InRadius, bool InPriorityDanger); // [0x2dc4490] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetNeutralsNum
	// int32_t GetNeutralsNum();                                                                                                // [0x2dc4460] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetEnemyNum
	// int32_t GetEnemyNum();                                                                                                   // [0x2dc4150] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetEnemyGroupInfo
	// class UNPCAIEnemyGroupSingleInfo* GetEnemyGroupInfo(class AActor* InTarget);                                             // [0x2dc40b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetDynamicGroupId
	// int32_t GetDynamicGroupId();                                                                                             // [0x2aad290] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetBulletFireDangerPower
	// int32_t GetBulletFireDangerPower(bool IsHitNoise, FVector InNoisePosition, float InNoiseDistance, FVector InBulletVelocity); // [0x2dc3e40] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetAllyNum
	// int32_t GetAllyNum();                                                                                                    // [0x2dc3da0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetAllTargetInfoList
	// TArray<UNPCAITargetInfo*> GetAllTargetInfoList();                                                                        // [0x2dc3d10] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetAllInSightEnemys
	// void GetAllInSightEnemys(TArray<AActor*>& OutEnemys);                                                                    // [0x2dc3c40] Final|Native|Public|HasOutParms 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.GetAllHadSeenEnemys
	// void GetAllHadSeenEnemys(TArray<AActor*>& OutEnemys);                                                                    // [0x2dc3b70] Final|Native|Public|HasOutParms 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.FilterNotValidEnemyOrPoints
	// void FilterNotValidEnemyOrPoints();                                                                                      // [0x2dc3b50] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.CanHeardNoise
	// bool CanHeardNoise(float InNoiseDistance, float InNoisePower);                                                           // [0x2dc3930] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.CalculateShootScope
	// bool CalculateShootScope(FVector& GunPoint, FVector& ShootPoint, float& HRadian, float& VTopRadian, float& VLowRadian, FVector& HMaxPoint1, FVector& HMaxPoint2, FVector& VTopPoint, FVector& VLowPoint); // [0x2dc3610] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.CalculateGoalPointForBot
	// void CalculateGoalPointForBot();                                                                                         // [0x2dc35f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.CalculateGoalForBot
	// void CalculateGoalForBot();                                                                                              // [0x2dc35d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.CalculateGoalEnemyForBot
	// void CalculateGoalEnemyForBot();                                                                                         // [0x2dc35b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.AddSuspectedPointToSearch
	// class UNPCAIAttentionPoint* AddSuspectedPointToSearch(FVector InPoint, ENPCPlaceForCheckType InPlaceType, class AActor* InCreator, bool bIsAutoReCalculate, bool bIsAddSuspectedNum); // [0x2dc33d0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.AddNeutral
	// void AddNeutral(class AActor* InNeutral);                                                                                // [0x2dc3340] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.AddEnemy
	// class UNPCAIEnemyGroupSingleInfo* AddEnemy(class AActor* InEnemy);                                                       // [0x2dc32a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.AddAllyGoalEnemyIfNotTarget
	// class UNPCAITargetInfo* AddAllyGoalEnemyIfNotTarget(float InRange);                                                      // [0x2dc3210] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSystemComponent.AddAlly
	// void AddAlly(class AActor* InAlly);                                                                                      // [0x2dc3180] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent
/// Size: 0x0108 (264 bytes) (0x0001A0 - 0x0002A8) align 8 pad: 0x0000
class UNPCAIMultiTargetSelectorComponent : public UNPCAIMultiTargetSystemComponent
{ 
public:
	FString                                            PerceptionTag1;                                             // 0x01A0   (0x0010)  
	FString                                            PerceptionTag2;                                             // 0x01B0   (0x0010)  
	FString                                            PerceptionTag3;                                             // 0x01C0   (0x0010)  
	float                                              DistanceToPercActor;                                        // 0x01D0   (0x0004)  
	float                                              DistanceToPercLoc;                                          // 0x01D4   (0x0004)  
	class AActor*                                      PerceptionActor;                                            // 0x01D8   (0x0008)  
	FAIStimulus                                        PerceptionStimulus;                                         // 0x01E0   (0x003C)  
	bool                                               bIsTeamEnemy;                                               // 0x021C   (0x0001)  
	bool                                               bIsTeamFriendly;                                            // 0x021D   (0x0001)  
	bool                                               bIsGroupEnemy;                                              // 0x021E   (0x0001)  
	bool                                               bIsGroupAlly;                                               // 0x021F   (0x0001)  
	bool                                               bIsSounder;                                                 // 0x0220   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0221   (0x0007)  MISSED
	class AActor*                                      SounderThrower;                                             // 0x0228   (0x0008)  
	bool                                               bIsCheatGhost;                                              // 0x0230   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0231   (0x0003)  MISSED
	float                                              LastCalculateWarnPlayerTime;                                // 0x0234   (0x0004)  
	float                                              LastCalculateGoalEnemyTime;                                 // 0x0238   (0x0004)  
	float                                              LastCalculateGoalPointTime;                                 // 0x023C   (0x0004)  
	float                                              NextLeanAutoRelaxTime;                                      // 0x0240   (0x0004)  
	float                                              LastTodoHearingTime;                                        // 0x0244   (0x0004)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0248   (0x0008)  MISSED
	class AActor*                                      LastFireToMePerson;                                         // 0x0250   (0x0008)  
	float                                              LastFireToMeTime;                                           // 0x0258   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x025C   (0x0004)  MISSED
	class AActor*                                      LastShootMePerson;                                          // 0x0260   (0x0008)  
	FVector                                            LastShootMePersonLocation;                                  // 0x0268   (0x000C)  
	FVector                                            LastShootMeSelfLocation;                                    // 0x0274   (0x000C)  
	float                                              LastShootMeDamageValue;                                     // 0x0280   (0x0004)  
	float                                              LastBeenShootTime;                                          // 0x0284   (0x0004)  
	FAIShotCountStat                                   BeHitCount;                                                 // 0x0288   (0x0010)  
	float                                              TEMPORARY_ENEMY_DURATION_TIME;                              // 0x0298   (0x0004)  
	float                                              SWITCH_TO_ENEMY_IF_ATK_INRADIUS;                            // 0x029C   (0x0004)  
	float                                              SWITCH_TO_ENEMY_IF_NEARBY_BETRAYER;                         // 0x02A0   (0x0004)  
	unsigned char                                      UnknownData04_7[0x4];                                       // 0x02A4   (0x0004)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.SetScavPlayerTeamAsGroupEnemy
	// void SetScavPlayerTeamAsGroupEnemy(class AActor* InScavPlayer);                                                          // [0x2dc6760] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.SetBeHitDetail
	// void SetBeHitDetail(class AActor* DamageCauser, float DamageValue, float InTimeSec);                                     // [0x2dc6370] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.SeparateMultiTags
	// void SeparateMultiTags(FName InTotalTag);                                                                                // [0x2dc61f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.OnSmokeExplosionToDo
	// void OnSmokeExplosionToDo();                                                                                             // [0x2dc5d80] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.OnSightToDo
	// void OnSightToDo();                                                                                                      // [0x2dc5d60] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.OnPerceptionUpdated
	// void OnPerceptionUpdated(class AActor* InTarget, FAIStimulus InAIStimulus);                                              // [0x2dc5bd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.OnHearingToDo
	// void OnHearingToDo();                                                                                                    // [0x2dc58f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.OnDamageToDo
	// void OnDamageToDo();                                                                                                     // [0x2dc58d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.OnBulletFireToDo
	// void OnBulletFireToDo(class AActor* InInstigator, FVector InBulletLocation, FVector InBulletVelocity, FName InNoiseType); // [0x2dc5740] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.IsGunNoise
	// bool IsGunNoise(FString InTag);                                                                                          // [0x2dc4e70] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.IsBeingFireHited
	// bool IsBeingFireHited(float InTime, class AActor*& OutWhoFire);                                                          // [0x2dc4b90] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.GetLastBeHitTime
	// float GetLastBeHitTime();                                                                                                // [0x2dc4330] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.GetFuzzyPointCoef
	// float GetFuzzyPointCoef(FString InHearTag);                                                                              // [0x2dc41f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.GetFirstBeHitTime
	// float GetFirstBeHitTime();                                                                                               // [0x2dc4180] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.GetBeHitCount
	// int32_t GetBeHitCount();                                                                                                 // [0x2dc3dd0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAIMultiTargetSelectorComponent.CreateFuzzyPoint
	// FVector CreateFuzzyPoint(FVector InCenterPoint, float InFuzzyRadius);                                                    // [0x2dc3a50] Final|Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAINavSubsystemBase
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UNPCAINavSubsystemBase : public UWorldSubsystem
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavSubsystemBase.IsNavTileDataPrepared
	// bool IsNavTileDataPrepared(class UObject* WorldContextObject);                                                           // [0x2dd7190] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSubsystemBase.IsLocationOnNavLink
	// bool IsLocationOnNavLink(class UObject* WorldContextObject, FVector& Location);                                          // [0x2dd70c0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSubsystemBase.GetNavLinkById
	// class ANPCAINavLinkProxy* GetNavLinkById(class UObject* WorldContextObject, int32_t LinkID);                             // [0x2dd6de0] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAINavConnectivitySystem
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UNPCAINavConnectivitySystem : public UNPCAINavSubsystemBase
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavConnectivitySystem.GetNavLinkCylinderLocation
	// bool GetNavLinkCylinderLocation(class ANPCAINavLinkProxy* NavLink, int32_t RegionIndex, FVector& OutLocation);           // [0x2dc8c80] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavConnectivitySystem.GetLinkUsageCount
	// int32_t GetLinkUsageCount(FVector& SourceLocation, FVector& TargetLocation, int32_t& OutSourceRegionIndex, int32_t& OutTargetRegionIndex, int32_t& OutSourceRegionSize, int32_t& OutTargetRegionSize, EGetLinkUsageCountStatus& OutStatus); // [0x2dc88e0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavConnectivitySystem.GetDoorNavLinksInRegion
	// TArray<ANPCAINavLinkProxy*> GetDoorNavLinksInRegion(int32_t RegionIndex);                                                // [0x2dc8740] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavConnectivitySystem.GetDoorNavLinksBetweenAdjacentRegions
	// TArray<ANPCAINavLinkProxy*> GetDoorNavLinksBetweenAdjacentRegions(int32_t SourceRegionIndex, int32_t TargetRegionIndex); // [0x2dc8630] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/MFNPCAI.NPCAINavDebugSystem
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UNPCAINavDebugSystem : public UNPCAINavSubsystemBase
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.TestDoorPath
	// bool TestDoorPath(class UObject* WorldContextObject, class ANPCAINavLinkProxy* NavLinkProxy);                            // [0x2dc9e50] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.ProjectPointToNavMesh
	// bool ProjectPointToNavMesh(class UObject* WorldContextObject, FVector& Location, FVector& QueryExtent, int32_t& OutPolyIndex, FVector& OutProjectedLocation); // [0x2dc9bf0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.PrintNavMeshPolygonSlope
	// void PrintNavMeshPolygonSlope(class UObject* WorldContextObject, FVector& Location);                                     // [0x2dc9a90] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.PlaceActorsOnNodes
	// void PlaceActorsOnNodes(class UObject* WorldContextObject, FString NodeIndicesString, bool bUseNodeIndexAsPolyRef, TArray<AActor*>& OutActors); // [0x2dc98f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.LabelTiles
	// TArray<ENavMeshTileLabel> LabelTiles(class UObject* WorldContextObject, TMap<int32_t, int32_t>& LabeledPolys, bool bConsiderUnreachablePoints); // [0x2dc9300] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.LabelPolys
	// TMap<int32_t, int32_t> LabelPolys(class UObject* WorldContextObject, TArray<int32_t>& PolyIndices, TArray<FVector>& SeedLocations, FVector& QueryExtent, bool bHintProjection2D); // [0x2dc9090] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.IsLocationOnNavLinkDebug
	// void IsLocationOnNavLinkDebug(class UObject* WorldContextObject, FVector& Location);                                     // [0x2dc8e60] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.GetSeedTravelLocations
	// TArray<FVector> GetSeedTravelLocations(class UObject* WorldContextObject);                                               // [0x2dc8d90] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.GetLinkUsageCountDebug
	// void GetLinkUsageCountDebug(class UObject* WorldContextObject, FVector& SourceLocation, FVector& TargetLocation);        // [0x2dc8b60] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.GetDoorNavLinksInRegionDebug
	// void GetDoorNavLinksInRegionDebug(class UObject* WorldContextObject, FVector& SourceLocation);                           // [0x2dc8820] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.GetAllPolyIndices
	// TArray<int32_t> GetAllPolyIndices(class UObject* WorldContextObject);                                                    // [0x2dc8560] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.DestroyPlacedActors
	// void DestroyPlacedActors(TArray<AActor*>& OutActors);                                                                    // [0x2dc82b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavDebugSystem.CalculateBoundaryEdgeLength
	// void CalculateBoundaryEdgeLength(class UObject* WorldContextObject);                                                     // [0x2dc8230] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAINavExperimentSystem
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UNPCAINavExperimentSystem : public UNPCAINavSubsystemBase
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavExperimentSystem.TestRaycastToNavSkeletonPoints
	// TArray<bool> TestRaycastToNavSkeletonPoints(class UObject* WorldContextObject, FVector& StartLocation, TArray<int32_t>& PointIDs); // [0x2dca170] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavExperimentSystem.TestNavSkeletonFloodFrom
	// TArray<bool> TestNavSkeletonFloodFrom(class UObject* WorldContextObject, FVector& StartLocation, float MaxPathLength);   // [0x2dca020] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavExperimentSystem.TestNavRaycast
	// void TestNavRaycast(class UObject* WorldContextObject);                                                                  // [0x2dc9dd0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavExperimentSystem.TestMoveDirectly
	// void TestMoveDirectly(class UObject* WorldContextObject);                                                                // [0x2dc9fa0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavExperimentSystem.TestMoveAlongSurface
	// void TestMoveAlongSurface(class UObject* WorldContextObject);                                                            // [0x2dc9f20] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavExperimentSystem.TestLimitMoveInRegion
	// void TestLimitMoveInRegion(class UObject* WorldContextObject);                                                           // [0x2dc9dd0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavExperimentSystem.TestArrangeStandPositions
	// void TestArrangeStandPositions(class UObject* WorldContextObject);                                                       // [0x2dc9dd0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavExperimentSystem.TestAIMoveDirectly
	// void TestAIMoveDirectly(class UObject* WorldContextObject);                                                              // [0x2dc9dd0] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAINavigationStatics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNPCAINavigationStatics : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavigationStatics.PathNodesToNeighborPathNodes
	// void PathNodesToNeighborPathNodes(class UObject* WorldContext, TArray<int32_t>& TargetPathNodes, int32_t Step, TArray<int32_t>& Result); // [0x2dc9760] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavigationStatics.PathNodesToDistAndNeighborPathNodes
	// void PathNodesToDistAndNeighborPathNodes(class UObject* WorldContext, TArray<int32_t>& TargetPathNodes, float PathLength, TArray<int32_t>& NodesInPathLength, TArray<int32_t>& NodesNeighbor, bool& IsTimeOut); // [0x2dc9520] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavigationStatics.IsNavigationPlanarFloor
	// bool IsNavigationPlanarFloor(class UObject* WorldContext, FVector& StartPoint, FVector& Direction, float Distance);      // [0x2dc8f20] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavigationStatics.FindCloserToMePoints
	// void FindCloserToMePoints(class UObject* WorldContext, TArray<int32_t>& PathNodeIds, FVector& MyLocation, FVector& EnemyLocation, TArray<int32_t>& Result); // [0x2dc8370] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAINavigationSystem
/// Size: 0x0000 (0 bytes) (0x0015F8 - 0x0015F8) align 8 pad: 0x0000
class UNPCAINavigationSystem : public UNavigationSystemV1
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAINavigationSystemConfig
/// Size: 0x0000 (0 bytes) (0x000058 - 0x000058) align 8 pad: 0x0000
class UNPCAINavigationSystemConfig : public UNavigationSystemModuleConfig
{ 
public:
};

/// Struct /Script/MFNPCAI.NavSkeletonBuildSettings
/// Size: 0x008C (140 bytes) (0x000000 - 0x00008C) align 4 pad: 0x0000
struct FNavSkeletonBuildSettings
{ 
	FVector                                            NavQueryExtent;                                             // 0x0000   (0x000C)  
	float                                              SampleSpacing;                                              // 0x000C   (0x0004)  
	float                                              DeltaLength;                                                // 0x0010   (0x0004)  
	int32_t                                            GradientNeighbourRadius;                                    // 0x0014   (0x0004)  
	float                                              DivergenceFilterThreshold;                                  // 0x0018   (0x0004)  
	float                                              DivergenceNeighbourRadius;                                  // 0x001C   (0x0004)  
	float                                              CoarseCoverageNeighbourRadius;                              // 0x0020   (0x0004)  
	float                                              RefinedCoverageNeighbourRadius;                             // 0x0024   (0x0004)  
	float                                              PolylineSimplificationDistanceThreshold;                    // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	bool                                               bUseNewBuilder;                                             // 0x0030   (0x0001)  
	bool                                               bCheckEdgeOnNavMesh;                                        // 0x0031   (0x0001)  
	bool                                               bRemoveUnreachablePoints;                                   // 0x0032   (0x0001)  
	bool                                               bHintProjection2D;                                          // 0x0033   (0x0001)  
	bool                                               bAddRegionConnection;                                       // 0x0034   (0x0001)  
	bool                                               bEnableCollapseShortPolylines;                              // 0x0035   (0x0001)  
	bool                                               bEnableParallelFindWallsInNeighbourhood;                    // 0x0036   (0x0001)  
	bool                                               bEnableParallelCalculateWallDistance;                       // 0x0037   (0x0001)  
	bool                                               bEnableParallelGenerateRawPoints;                           // 0x0038   (0x0001)  
	bool                                               bEnableParallelCalculateGradient;                           // 0x0039   (0x0001)  
	bool                                               bEnableParallelCalculateDivergence;                         // 0x003A   (0x0001)  
	bool                                               bEnableParallelCalculateOutdoors;                           // 0x003B   (0x0001)  
	bool                                               bEnableParallelPruneSamplePoints;                           // 0x003C   (0x0001)  
	bool                                               bEnableParallelCalculateProtection;                         // 0x003D   (0x0001)  
	bool                                               bEnableParallelCalculateVisibility;                         // 0x003E   (0x0001)  
	bool                                               bEnableParallelCalculateThrowing;                           // 0x003F   (0x0001)  
	bool                                               bEnableParallelCalculateMoving;                             // 0x0040   (0x0001)  
	bool                                               bEnablePruneSamplePoints;                                   // 0x0041   (0x0001)  
	bool                                               bEnableRemoveTooCloseMainPointAtCoverageStage;              // 0x0042   (0x0001)  
	bool                                               bEnableRefineCoverage;                                      // 0x0043   (0x0001)  
	bool                                               bEnablePruneEndBranch;                                      // 0x0044   (0x0001)  
	bool                                               bEnableCalculateVisibilityStage;                            // 0x0045   (0x0001)  
	bool                                               bEnableCalculateThrowingStage;                              // 0x0046   (0x0001)  
	ENavSkeletonDivergenceMethod                       DivergenceMethod;                                           // 0x0047   (0x0001)  
	float                                              FindWallInRadius;                                           // 0x0048   (0x0004)  
	int32_t                                            MaxWallCount;                                               // 0x004C   (0x0004)  
	float                                              PolylineLengthLowerBound;                                   // 0x0050   (0x0004)  
	float                                              RegionConnectionDistanceTolerance;                          // 0x0054   (0x0004)  
	float                                              VisiblityQueryZExtent;                                      // 0x0058   (0x0004)  
	float                                              VisiblityTraceZOffset;                                      // 0x005C   (0x0004)  
	float                                              VisiblityMaxRange;                                          // 0x0060   (0x0004)  
	float                                              ProtectionTraceAngleStep;                                   // 0x0064   (0x0004)  
	float                                              ProtectionTraceZOffset;                                     // 0x0068   (0x0004)  
	float                                              ProtectionTraceMaxRange;                                    // 0x006C   (0x0004)  
	float                                              EndpointProtectionLowerBound;                               // 0x0070   (0x0004)  
	float                                              ThrowingInitialSpeed;                                       // 0x0074   (0x0004)  
	float                                              ThrowingMaxRange;                                           // 0x0078   (0x0004)  
	float                                              MovingMaxRange;                                             // 0x007C   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0080   (0x0004)  MISSED
	float                                              CheckOutdoorsRadius;                                        // 0x0084   (0x0004)  
	float                                              CheckOutdoorsHeight;                                        // 0x0088   (0x0004)  
};

/// Struct /Script/MFNPCAI.NavSkeletonPoint
/// Size: 0x0090 (144 bytes) (0x000010 - 0x0000A0) align 8 pad: 0x0000
struct FNavSkeletonPoint : FActionPointData
{ 
	bool                                               Outdoors;                                                   // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0011   (0x0003)  MISSED
	float                                              Radius;                                                     // 0x0014   (0x0004)  
	float                                              EffectiveRange;                                             // 0x0018   (0x0004)  
	int32_t                                            LinkID;                                                     // 0x001C   (0x0004)  
	uint64_t                                           AtPolyRef;                                                  // 0x0020   (0x0008)  
	FVector                                            ProtectionDirection;                                        // 0x0028   (0x000C)  
	float                                              ProtectionHalfAngle;                                        // 0x0034   (0x0004)  
	int32_t                                            BattleIntensityExpectation;                                 // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	TArray<int32_t>                                    NeighbourIndices;                                           // 0x0040   (0x0010)  
	TArray<float>                                      NeighbourDistances;                                         // 0x0050   (0x0010)  
	TArray<int32_t>                                    VisibleIndices;                                             // 0x0060   (0x0010)  
	TArray<int32_t>                                    ThrowableIndices;                                           // 0x0070   (0x0010)  
	TArray<int32_t>                                    MovableIndices;                                             // 0x0080   (0x0010)  
	TArray<int32_t>                                    FriendIndices;                                              // 0x0090   (0x0010)  
};

/// Struct /Script/MFNPCAI.NavSkeletonData
/// Size: 0x0060 (96 bytes) (0x000000 - 0x000060) align 8 pad: 0x0000
struct FNavSkeletonData
{ 
	TArray<FNavSkeletonPoint>                          Points;                                                     // 0x0000   (0x0010)  
	SDK_UNDEFINED(80,620) /* TMap<uint64_t, FNavSkeletonPatchedPath> */ __um(UnstableSegmentPatchPaths);           // 0x0010   (0x0050)  
};

/// Class /Script/MFNPCAI.NPCAINavMeshManager
/// Size: 0x02B0 (688 bytes) (0x0002E0 - 0x000590) align 8 pad: 0x0000
class ANPCAINavMeshManager : public AActor
{ 
public:
	unsigned char                                      UnknownData00_3[0x198];                                     // 0x02E0   (0x0198)  MISSED
	FNavSkeletonBuildSettings                          SkeletonBuildSettings;                                      // 0x0478   (0x008C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0504   (0x0004)  MISSED
	TArray<FNavSkeletonPoint>                          NavSkeletonPoints;                                          // 0x0508   (0x0010)  
	FNavSkeletonData                                   NavSkeletonData;                                            // 0x0518   (0x0060)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0578   (0x0008)  MISSED
	TArray<class ANPCAINavLinkProxy*>                  CachedNavLinkProxies;                                       // 0x0580   (0x0010)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavMeshManager.PrintSkeletonPointRadiusStat
	// void PrintSkeletonPointRadiusStat();                                                                                     // [0x2dc9bd0] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAINavMeshManager.PrintSkeletonPointDegreeStat
	// void PrintSkeletonPointDegreeStat();                                                                                     // [0x2dc9bb0] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAINavMeshManager.PrintSkeletonMemoryUsage
	// void PrintSkeletonMemoryUsage();                                                                                         // [0x2dc9b90] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAINavMeshManager.PrintSkeletonInfo
	// void PrintSkeletonInfo();                                                                                                // [0x2dc9b70] Final|Native|Public  
	// Function /Script/MFNPCAI.NPCAINavMeshManager.PrintSkeletonEdgeLengthStat
	// void PrintSkeletonEdgeLengthStat();                                                                                      // [0x2dc9b50] Final|Native|Public  
};

/// Class /Script/MFNPCAI.NPCAITestingRenderingComponent
/// Size: 0x0008 (8 bytes) (0x0005D8 - 0x0005E0) align 16 pad: 0x0000
class UNPCAITestingRenderingComponent : public UPrimitiveComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x05D8   (0x0008)  MISSED
};

/// Class /Script/MFNPCAI.NPCAINavMeshRenderingComponent
/// Size: 0x0000 (0 bytes) (0x0005E0 - 0x0005E0) align 16 pad: 0x0000
class UNPCAINavMeshRenderingComponent : public UNPCAITestingRenderingComponent
{ 
public:
};

/// Class /Script/MFNPCAI.NPCAITestingActor
/// Size: 0x0038 (56 bytes) (0x0002E0 - 0x000318) align 8 pad: 0x0000
class ANPCAITestingActor : public AActor
{ 
public:
	class UCapsuleComponent*                           CapsuleComponent;                                           // 0x02E0   (0x0008)  
	FNavAgentProperties                                NavAgentProps;                                              // 0x02E8   (0x0030)  
};

/// Class /Script/MFNPCAI.NPCAINavMeshTestingActor
/// Size: 0x03C8 (968 bytes) (0x000318 - 0x0006E0) align 16 pad: 0x0000
class ANPCAINavMeshTestingActor : public ANPCAITestingActor
{ 
public:
	float                                              ToWallCylinderHeight;                                       // 0x0318   (0x0004)  
	float                                              RadiusMultiplier;                                           // 0x031C   (0x0004)  
	float                                              DistanceHeightMultiplier;                                   // 0x0320   (0x0004)  
	float                                              DistanceLineThickness;                                      // 0x0324   (0x0004)  
	float                                              ShowGradientThreshold;                                      // 0x0328   (0x0004)  
	float                                              GradientZOffset;                                            // 0x032C   (0x0004)  
	float                                              UpdateGradientFlowAnimInterval;                             // 0x0330   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0334   (0x0004)  MISSED
	float                                              ShowDivergenceThreshold;                                    // 0x0338   (0x0004)  
	float                                              DivergenceHeightMultiplier;                                 // 0x033C   (0x0004)  
	float                                              DivergenceLineThickness;                                    // 0x0340   (0x0004)  
	float                                              ConnectionLineThickness;                                    // 0x0344   (0x0004)  
	float                                              SimlifiedConnectionZOffset;                                 // 0x0348   (0x0004)  
	int32_t                                            ShowCoverageLevel;                                          // 0x034C   (0x0004)  
	int32_t                                            ShowWallLevel;                                              // 0x0350   (0x0004)  
	bool                                               bEnableRefreshData : 1;                                     // 0x0354:0 (0x0001)  
	bool                                               bDrawSamplePoints : 1;                                      // 0x0354:1 (0x0001)  
	bool                                               bDrawWallCountMap : 1;                                      // 0x0354:2 (0x0001)  
	bool                                               bDrawDistanceMap : 1;                                       // 0x0354:3 (0x0001)  
	bool                                               bDrawGradient : 1;                                          // 0x0354:4 (0x0001)  
	bool                                               bShowAllGradient : 1;                                       // 0x0354:5 (0x0001)  
	bool                                               bDrawGradientFlowAnim : 1;                                  // 0x0354:6 (0x0001)  
	bool                                               bDrawCoverage : 1;                                          // 0x0354:7 (0x0001)  
	bool                                               bAlwaysShowMainCoverage : 1;                                // 0x0355:0 (0x0001)  
	bool                                               bDrawOriginalConnection : 1;                                // 0x0355:1 (0x0001)  
	bool                                               bDrawSimplifiedConnection : 1;                              // 0x0355:2 (0x0001)  
	bool                                               bOnlyDrawMainSimplifiedConnection : 1;                      // 0x0355:3 (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0356   (0x0002)  MISSED
	int32_t                                            NearestMainCoverageSampleIndex;                             // 0x0358   (0x0004)  
	int32_t                                            PolyMeshCount;                                              // 0x035C   (0x0004)  
	int32_t                                            PolylineCount;                                              // 0x0360   (0x0004)  
	int32_t                                            CurrentTileIndex;                                           // 0x0364   (0x0004)  
	FVector                                            ClosestPointOnWall;                                         // 0x0368   (0x000C)  
	unsigned char                                      UnknownData02_6[0x14];                                      // 0x0374   (0x0014)  MISSED
	int32_t                                            NeighbourWallEdgeCount;                                     // 0x0388   (0x0004)  
	float                                              DistanceToWall;                                             // 0x038C   (0x0004)  
	FVector4                                           SamplePointCountStat;                                       // 0x0390   (0x0010)  
	FVector4                                           WallStat;                                                   // 0x03A0   (0x0010)  
	FVector4                                           DistanceStat;                                               // 0x03B0   (0x0010)  
	FVector4                                           DivergenceStat;                                             // 0x03C0   (0x0010)  
	FVector4                                           FilteredDistanceStat;                                       // 0x03D0   (0x0010)  
	FVector4                                           FilteredDivergenceStat;                                     // 0x03E0   (0x0010)  
	int32_t                                            CoverageStats[5];                                           // 0x03F0   (0x0014)  
	int32_t                                            ConnectionStats[13];                                        // 0x0404   (0x0034)  
	float                                              MaxPathLength;                                              // 0x0438   (0x0004)  
	FNavSkeletonBuildSettings                          BuildSettings;                                              // 0x043C   (0x008C)  
	bool                                               bDrawPersistent : 1;                                        // 0x04C8:0 (0x0001)  
	bool                                               bDrawTextInfo : 1;                                          // 0x04C8:1 (0x0001)  
	bool                                               bDrawProtection : 1;                                        // 0x04C8:2 (0x0001)  
	bool                                               bDrawNearestPoint : 1;                                      // 0x04C8:3 (0x0001)  
	bool                                               bDrawPointNeighbours : 1;                                   // 0x04C8:4 (0x0001)  
	bool                                               bDrawFindResultPoints : 1;                                  // 0x04C8:5 (0x0001)  
	bool                                               bDrawOutDoorsPoints : 1;                                    // 0x04C8:6 (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x04C9   (0x0007)  MISSED
	FNavSkeletonPoint                                  NavSkeletonPoint;                                           // 0x04D0   (0x00A0)  
	FNavSkeletonPoint                                  TargetNavSkeletonPoint;                                     // 0x0570   (0x00A0)  
	TArray<int32_t>                                    FoundPointIDs;                                              // 0x0610   (0x0010)  
	float                                              CostLimit;                                                  // 0x0620   (0x0004)  
	float                                              HalfAngleOfView;                                            // 0x0624   (0x0004)  
	class AActor*                                      TargetDebugActor;                                           // 0x0628   (0x0008)  
	unsigned char                                      UnknownData04_7[0xB0];                                      // 0x0630   (0x00B0)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavMeshTestingActor.UpdateDrawing
	// void UpdateDrawing();                                                                                                    // [0xd906a0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAINavRuntimeSystem
/// Size: 0x0368 (872 bytes) (0x000030 - 0x000398) align 8 pad: 0x0000
class UNPCAINavRuntimeSystem : public UNPCAINavSubsystemBase
{ 
public:
	unsigned char                                      UnknownData00_3[0x48];                                      // 0x0030   (0x0048)  MISSED
	SDK_UNDEFINED(80,621) /* TMap<ENPCAIPerceptibleTile, FNavCostDescriptor> */ __um(PerceptibleTileToNavCostDescriptor); // 0x0078   (0x0050)  
	SDK_UNDEFINED(80,622) /* TMap<UObject*, FNavPolyRefArray> */ __um(BurningPolyRefs);                            // 0x00C8   (0x0050)  
	SDK_UNDEFINED(80,623) /* TMap<UObject*, FNavPolyRefArray> */ __um(TearGasPolyRefs);                            // 0x0118   (0x0050)  
	SDK_UNDEFINED(80,624) /* TMap<UObject*, FNavPolyRefArray> */ __um(TripMinePolyRefs);                           // 0x0168   (0x0050)  
	SDK_UNDEFINED(80,625) /* TMap<UObject*, FNavPolyRefArray> */ __um(ClaymorePolyRefs);                           // 0x01B8   (0x0050)  
	SDK_UNDEFINED(80,626) /* TMap<UObject*, FNavPolyRefArray> */ __um(ParadropPolyRefs);                           // 0x0208   (0x0050)  
	SDK_UNDEFINED(80,627) /* TMap<UObject*, ANPCAINavModifierVolume*> */ __um(ObjectToNavModifierVolume);          // 0x0258   (0x0050)  
	SDK_UNDEFINED(80,628) /* TMap<UObject*, FNavCostModifierSharedPointer> */ __um(ObjectToNavCostModifier);       // 0x02A8   (0x0050)  
	SDK_UNDEFINED(80,629) /* TMap<AVolume*, FNavPolyRefArray> */ __um(AvoidPolyRefs);                              // 0x02F8   (0x0050)  
	SDK_UNDEFINED(80,630) /* TMap<int32_t, ENPCAIPerceptibleTile> */ __um(AreaIDToPerceptibleTile);                // 0x0348   (0x0050)  


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.SetupTripMineAreas
	// void SetupTripMineAreas(class UObject* Object, FVector& StartPoint, FVector& EndPoint, bool bEnabled);                   // [0x2dd26c0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.SetupTearGasAreas
	// void SetupTearGasAreas(class UObject* TearGasObject, FVector& CenterPos, FVector& EffectExtent, bool bActiving);         // [0x2dd2540] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.SetupRegionWhereNavLinksNeedDisable
	// bool SetupRegionWhereNavLinksNeedDisable(class AActor* AIPawnOrController, int32_t RegionIndex);                         // [0x2dd2470] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.SetupBurningAreas
	// void SetupBurningAreas(class UObject* Object, TArray<FVector>& Centers, float Radius, bool bEnable);                     // [0x2dd22d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.SetupAvoidAreas
	// void SetupAvoidAreas(class AAIController* AIController, TArray<AVolume*>& Volumes, bool bAvoid);                         // [0x2dd21a0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.MapAreaIDToPerceptibleTile
	// ENPCAIPerceptibleTile MapAreaIDToPerceptibleTile(int32_t AreaID);                                                        // [0x2dd1440] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.IsAreaBombing
	// int32_t IsAreaBombing(FVector& Location, bool bCheckMolotov, bool bCheckTearGas);                                        // [0x2dd1310] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.GetNavRuntimeSystem
	// class UNPCAINavRuntimeSystem* GetNavRuntimeSystem(class UObject* WorldContextObject);                                    // [0x2dd1080] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAINavRuntimeSystem.ArrangeStandPositions
	// TArray<FAICandidateStandPosition> ArrangeStandPositions(class UObject* WorldContextObject, FVector& Location, float MaxRange, float MinGap); // [0x2dd00e0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAINavSkeletonSystem
/// Size: 0x00A8 (168 bytes) (0x000030 - 0x0000D8) align 8 pad: 0x0000
class UNPCAINavSkeletonSystem : public UNPCAINavSubsystemBase
{ 
public:
	unsigned char                                      UnknownData00_1[0xA8];                                      // 0x0030   (0x00A8)  MISSED


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.SetupTryBestToIncludePointIDs
	// FNavSkeletonGraphAStarFilter SetupTryBestToIncludePointIDs(FNavSkeletonGraphAStarFilter& Filter, TArray<int32_t>& PointIDs); // [0x2dd2840] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryVisiblePointIDs
	// TArray<int32_t> QueryVisiblePointIDs(FVector& Location, FVector& Direction, float HalfAngle, float MaxDistance);         // [0x2dd1fc0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryThrowablePointIDs
	// TArray<int32_t> QueryThrowablePointIDs(int32_t TargetPointID);                                                           // [0x2dd1ee0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryProtectablePointIDs
	// TArray<int32_t> QueryProtectablePointIDs(FVector& Location, float MaxPathLength, int32_t KeepTopK);                      // [0x2dd1d60] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryPointIDs
	// TArray<int32_t> QueryPointIDs(FVector& Location, float QueryLength);                                                     // [0x2dd1c40] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryOutdoorsPointIDs
	// TArray<int32_t> QueryOutdoorsPointIDs(FVector& Location, FVector& Extent);                                               // [0x2dd1b00] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryNearestPointIDs
	// TArray<int32_t> QueryNearestPointIDs(FVector& Location, float MaxPathLength);                                            // [0x2dd19e0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryNearestPointID
	// int32_t QueryNearestPointID(FVector& Location, float MaxPathLength);                                                     // [0x2dd1900] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryNearestDoorPointID
	// int32_t QueryNearestDoorPointID(FVector& Location, float MaxPathLength);                                                 // [0x2dd1820] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.QueryBranchyPointIDs
	// TArray<int32_t> QueryBranchyPointIDs(FVector& Location, float MaxPathLength, int32_t KeepTopK);                          // [0x2dd16a0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.OptimizePathResult
	// FNavSkeletonGraphFindResult OptimizePathResult(FNavSkeletonGraphFindResult& PathResult);                                 // [0x2dd1570] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.GetPointData
	// FNavSkeletonPoint GetPointData(int32_t PointID);                                                                         // [0x2dd11a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.GetNavSkeletonSystem
	// class UNPCAINavSkeletonSystem* GetNavSkeletonSystem(class UObject* WorldContextObject);                                  // [0x2dd1110] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.GetFindPathStatus
	// EGraphAStarResult GetFindPathStatus(class UObject* Querier);                                                             // [0x2dd0fe0] Final|Native|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.FloodFromPointID
	// TArray<int32_t> FloodFromPointID(int32_t PointID, FNavSkeletonGraphAStarFilter& Filter);                                 // [0x2dd0e50] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.FindStepBackPointIDs
	// FNavSkeletonGraphFindResult FindStepBackPointIDs(int32_t PointID, TArray<int32_t>& CandidatePointIDs, FNavSkeletonGraphAStarFilter& Filter); // [0x2dd0c60] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.FindPathAsync
	// bool FindPathAsync(int32_t StartPointID, int32_t EndPointID, FNavSkeletonGraphAStarFilter& Filter, FGraphAStarPolicy& Policy, FDelegateProperty Callback, class UObject* Caller); // [0x2dd09c0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.FindPath
	// FNavSkeletonGraphFindResult FindPath(int32_t StartPointID, int32_t EndPointID, FNavSkeletonGraphAStarFilter& Filter, class UObject* Caller); // [0x2dd07b0] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.FindOutsidePointIDs
	// FNavSkeletonGraphFindResult FindOutsidePointIDs(int32_t PointID, FNavSkeletonGraphAStarFilter& Filter);                  // [0x2dd0620] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.ClearUnreachablePointIDs
	// FNavSkeletonGraphAStarFilter ClearUnreachablePointIDs(FNavSkeletonGraphAStarFilter& Filter);                             // [0x2dd04d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.CalculatePathLengthToEachPoint
	// TArray<FNavSkeletonGraphResultNode> CalculatePathLengthToEachPoint(TArray<int32_t>& PointIDs, FVector& Location, float MaxPathLength); // [0x2dd0320] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.BuildSkeleton
	// void BuildSkeleton(class UObject* WorldContextObject);                                                                   // [0x2dd02a0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.AddUnreachablePointIDs
	// FNavSkeletonGraphAStarFilter AddUnreachablePointIDs(FNavSkeletonGraphAStarFilter& Filter, TArray<int32_t>& PointIDs);    // [0x2dcff30] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.AddUnreachablePointID
	// FNavSkeletonGraphAStarFilter AddUnreachablePointID(FNavSkeletonGraphAStarFilter& Filter, int32_t PointID);               // [0x2dcfda0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/MFNPCAI.NPCAINavSkeletonSystem.AbortFindPathRequest
	// bool AbortFindPathRequest(class UObject* Querier);                                                                       // [0x2dcfd00] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NPCAINavSteepZoneSystem
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UNPCAINavSteepZoneSystem : public UNPCAINavSubsystemBase
{ 
public:


	/// Functions
	// Function /Script/MFNPCAI.NPCAINavSteepZoneSystem.RunDeleter
	// void RunDeleter(FSteepZoneDeleteSettings& Settings);                                                                     // [0x2dd7460] Final|Native|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/MFNPCAI.NavArea_Burning
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Burning : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_TearGas
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_TearGas : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_TripMine
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_TripMine : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Claymore
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Claymore : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Paradrop
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Paradrop : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Avoid
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Avoid : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Color0
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Color0 : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Color1
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Color1 : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Color2
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Color2 : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Color3
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Color3 : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Color4
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Color4 : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Color5
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Color5 : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavArea_Color6
/// Size: 0x0000 (0 bytes) (0x000048 - 0x000048) align 8 pad: 0x0000
class UNavArea_Color6 : public UNavArea
{ 
public:
};

/// Class /Script/MFNPCAI.NavPathPointActor
/// Size: 0x0030 (48 bytes) (0x0002E0 - 0x000310) align 8 pad: 0x0000
class ANavPathPointActor : public ANote
{ 
public:
	int32_t                                            NodeIndex;                                                  // 0x02E0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02E4   (0x0004)  MISSED
	uint64_t                                           NodeRef;                                                    // 0x02E8   (0x0008)  
	FVector                                            NodeLocation;                                               // 0x02F0   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x02FC   (0x0004)  MISSED
	TArray<class ANavPathPointActor*>                  NextPathPointArray;                                         // 0x0300   (0x0010)  
};

/// Class /Script/MFNPCAI.NPCAINavUtilitySystem
/// Size: 0x0010 (16 bytes) (0x000030 - 0x000040) align 8 pad: 0x0000
class UNPCAINavUtilitySystem : public UNPCAINavSubsystemBase
{ 
public:
