
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine

/// Struct /Script/UADataTableModule.WxGameShareRewardConf
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 pad: 0x0000
struct FWxGameShareRewardConf
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
	uint32_t                                           is_black;                                                   // 0x0008   (0x0004)  
};

/// Struct /Script/UADataTableModule.WxGameShareConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FWxGameShareConfTableRow : FTableRowBase
{ 
	uint32_t                                           sys_id;                                                     // 0x0008   (0x0004)  
	uint32_t                                           Type;                                                       // 0x000C   (0x0004)  
	uint32_t                                           act_id;                                                     // 0x0010   (0x0004)  
	uint32_t                                           content_id;                                                 // 0x0014   (0x0004)  
	TArray<FWxGameShareRewardConf>                     share_reward;                                               // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.WhiteListConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FWhiteListConfTableRow : FTableRowBase
{ 
	uint64_t                                           GOpenID;                                                    // 0x0008   (0x0008)  
	uint32_t                                           Type;                                                       // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.WeeklyTaskSet
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FWeeklyTaskSet
{ 
	TArray<uint32_t>                                   task_ids;                                                   // 0x0000   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeeklyTaskRefreshConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FWeeklyTaskRefreshConfTableRow : FTableRowBase
{ 
	uint32_t                                           week_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FWeeklyTaskSet>                             task_set;                                                   // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeeklyTakeOutItemConfTableRow
/// Size: 0x00A0 (160 bytes) (0x000008 - 0x0000A8) align 8 pad: 0x0000
struct FWeeklyTakeOutItemConfTableRow : FTableRowBase
{ 
	uint32_t                                           task_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           target_id;                                                  // 0x000C   (0x0004)  
	TArray<uint32_t>                                   mode_ids;                                                   // 0x0010   (0x0010)  
	TArray<uint32_t>                                   map_ids;                                                    // 0x0020   (0x0010)  
	TArray<uint32_t>                                   rule_ids;                                                   // 0x0030   (0x0010)  
	TArray<uint32_t>                                   difficulties;                                               // 0x0040   (0x0010)  
	uint32_t                                           instigator_charactertype;                                   // 0x0050   (0x0004)  
	uint32_t                                           CountDownStartSeconds;                                      // 0x0054   (0x0004)  
	uint32_t                                           ChangeValueToCount;                                         // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	TArray<uint32_t>                                   TakeOutItemIDs;                                             // 0x0060   (0x0010)  
	uint32_t                                           Istakein;                                                   // 0x0070   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0074   (0x0004)  MISSED
	FText                                              instigator_stayvolume;                                      // 0x0078   (0x0018)  
	uint32_t                                           EquipItemType;                                              // 0x0090   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0094   (0x0004)  MISSED
	TArray<uint32_t>                                   EquipItemIDs;                                               // 0x0098   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeeklyKillTargetConfTableRow
/// Size: 0x00E8 (232 bytes) (0x000008 - 0x0000F0) align 8 pad: 0x0000
struct FWeeklyKillTargetConfTableRow : FTableRowBase
{ 
	uint32_t                                           task_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           target_id;                                                  // 0x000C   (0x0004)  
	TArray<uint32_t>                                   mode_ids;                                                   // 0x0010   (0x0010)  
	TArray<uint32_t>                                   map_ids;                                                    // 0x0020   (0x0010)  
	TArray<uint32_t>                                   rule_ids;                                                   // 0x0030   (0x0010)  
	TArray<uint32_t>                                   difficulties;                                               // 0x0040   (0x0010)  
	uint32_t                                           instigator_charactertype;                                   // 0x0050   (0x0004)  
	uint32_t                                           CountDownStartSeconds;                                      // 0x0054   (0x0004)  
	TArray<uint32_t>                                   killedplayer_charactertypes;                                // 0x0058   (0x0010)  
	FText                                              instigator_stayvolume;                                      // 0x0068   (0x0018)  
	FText                                              killedplayer_stayvolume;                                    // 0x0080   (0x0018)  
	TArray<uint32_t>                                   KillerWeaponIDs;                                            // 0x0098   (0x0010)  
	TArray<uint32_t>                                   RequireAdaptersIDs;                                         // 0x00A8   (0x0010)  
	uint32_t                                           EquipItemType;                                              // 0x00B8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00BC   (0x0004)  MISSED
	TArray<uint32_t>                                   EquipItemIDs;                                               // 0x00C0   (0x0010)  
	uint32_t                                           MinDistance;                                                // 0x00D0   (0x0004)  
	uint32_t                                           MaxDistance;                                                // 0x00D4   (0x0004)  
	TArray<uint32_t>                                   EnduranceTypes;                                             // 0x00D8   (0x0010)  
	uint32_t                                           WeaponZoomTpye;                                             // 0x00E8   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x00EC   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.WeeklyCollectItemConfTableRow
/// Size: 0x00A0 (160 bytes) (0x000008 - 0x0000A8) align 8 pad: 0x0000
struct FWeeklyCollectItemConfTableRow : FTableRowBase
{ 
	uint32_t                                           task_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           target_id;                                                  // 0x000C   (0x0004)  
	TArray<uint32_t>                                   mode_ids;                                                   // 0x0010   (0x0010)  
	TArray<uint32_t>                                   map_ids;                                                    // 0x0020   (0x0010)  
	TArray<uint32_t>                                   rule_ids;                                                   // 0x0030   (0x0010)  
	TArray<uint32_t>                                   difficulties;                                               // 0x0040   (0x0010)  
	uint32_t                                           instigator_charactertype;                                   // 0x0050   (0x0004)  
	uint32_t                                           CountDownStartSeconds;                                      // 0x0054   (0x0004)  
	uint32_t                                           CollectionType;                                             // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	TArray<uint32_t>                                   CollectItemIDs;                                             // 0x0060   (0x0010)  
	uint32_t                                           Istakein;                                                   // 0x0070   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0074   (0x0004)  MISSED
	FText                                              instigator_stayvolume;                                      // 0x0078   (0x0018)  
	uint32_t                                           EquipItemType;                                              // 0x0090   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0094   (0x0004)  MISSED
	TArray<uint32_t>                                   EquipItemIDs;                                               // 0x0098   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeeklyClearVirtualItemConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FWeeklyClearVirtualItemConfTableRow : FTableRowBase
{ 
	uint32_t                                           item_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           remain_num;                                                 // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.SkinMaterialInfo
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FSkinMaterialInfo
{ 
	uint32_t                                           Index;                                                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FSoftObjectPath                                    OverrideMaterial;                                           // 0x0008   (0x0018)  
};

/// Struct /Script/UADataTableModule.WeaponSkinConfTableRow
/// Size: 0x0080 (128 bytes) (0x000008 - 0x000088) align 8 pad: 0x0000
struct FWeaponSkinConfTableRow : FTableRowBase
{ 
	uint32_t                                           SkinID;                                                     // 0x0008   (0x0004)  
	uint32_t                                           ItemID;                                                     // 0x000C   (0x0004)  
	uint32_t                                           SkinAssemble;                                               // 0x0010   (0x0004)  
	bool                                               IsStaticMesh;                                               // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0015   (0x0003)  MISSED
	FSoftObjectPath                                    MeshPathGame;                                               // 0x0018   (0x0018)  
	FSoftObjectPath                                    MeshPathLobby;                                              // 0x0030   (0x0018)  
	TArray<FSkinMaterialInfo>                          OverrideMaterials;                                          // 0x0048   (0x0010)  
	FSoftObjectPath                                    OverrideCheckWeaponHand;                                    // 0x0058   (0x0018)  
	FSoftObjectPath                                    OverrideCheckWeaponGun;                                     // 0x0070   (0x0018)  
};

/// Struct /Script/UADataTableModule.WeaponSocket
/// Size: 0x0058 (88 bytes) (0x000000 - 0x000058) align 8 pad: 0x0000
struct FWeaponSocket
{ 
	FString                                            SocketName;                                                 // 0x0000   (0x0010)  
	FText                                              PartName;                                                   // 0x0010   (0x0018)  
	TArray<FString>                                    SupportAdapterTagList;                                      // 0x0028   (0x0010)  
	TArray<uint64_t>                                   masks;                                                      // 0x0038   (0x0010)  
	TArray<uint64_t>                                   Types;                                                      // 0x0048   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponTag
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FWeaponTag
{ 
	TArray<uint64_t>                                   masks;                                                      // 0x0000   (0x0010)  
	TArray<uint64_t>                                   Types;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponRuleWDCFTableRow
/// Size: 0x01B8 (440 bytes) (0x000008 - 0x0001C0) align 8 pad: 0x0000
struct FWeaponRuleWDCFTableRow : FTableRowBase
{ 
	uint32_t                                           ItemID;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              BulletSize;                                                 // 0x0010   (0x0018)  
	uint32_t                                           AmmoCapacity;                                               // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<uint32_t>                                   size_ext;                                                   // 0x0030   (0x0010)  
	uint32_t                                           CanFold;                                                    // 0x0040   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0044   (0x0004)  MISSED
	FString                                            AssembleTag;                                                // 0x0048   (0x0010)  
	FString                                            SubAssembleTag;                                             // 0x0058   (0x0010)  
	uint64_t                                           slot_type;                                                  // 0x0068   (0x0008)  
	uint64_t                                           sub_slot_type;                                              // 0x0070   (0x0008)  
	TArray<FWeaponSocket>                              Sockets;                                                    // 0x0078   (0x0010)  
	TArray<uint32_t>                                   ConflictedItemIds;                                          // 0x0088   (0x0010)  
	float                                              Engonomics;                                                 // 0x0098   (0x0004)  
	float                                              Accuracy;                                                   // 0x009C   (0x0004)  
	float                                              MoaScale;                                                   // 0x00A0   (0x0004)  
	float                                              AdsMoaX;                                                    // 0x00A4   (0x0004)  
	float                                              AdsMoaY;                                                    // 0x00A8   (0x0004)  
	float                                              HorizontalRecoil;                                           // 0x00AC   (0x0004)  
	float                                              VerticalRecoil;                                             // 0x00B0   (0x0004)  
	float                                              SightRange;                                                 // 0x00B4   (0x0004)  
	float                                              MuzzleVelocity;                                             // 0x00B8   (0x0004)  
	uint32_t                                           RaceStrategy;                                               // 0x00BC   (0x0004)  
	float                                              MaxCount;                                                   // 0x00C0   (0x0004)  
	float                                              Recoil;                                                     // 0x00C4   (0x0004)  
	float                                              ZeroDropDistance;                                           // 0x00C8   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x00CC   (0x0004)  MISSED
	FText                                              TypesOfFire;                                                // 0x00D0   (0x0018)  
	FText                                              Caliber;                                                    // 0x00E8   (0x0018)  
	FString                                            FireRate;                                                   // 0x0100   (0x0010)  
	FString                                            EffectiveDistance;                                          // 0x0110   (0x0010)  
	TArray<FString>                                    FireRequireTags;                                            // 0x0120   (0x0010)  
	TArray<FWeaponTag>                                 fi_require_tags;                                            // 0x0130   (0x0010)  
	TArray<FString>                                    AdapterFireRequireTags;                                     // 0x0140   (0x0010)  
	TArray<FWeaponTag>                                 ad_require_tags;                                            // 0x0150   (0x0010)  
	FString                                            FireRequireTagsDecrease;                                    // 0x0160   (0x0010)  
	TArray<FWeaponTag>                                 de_require_tags;                                            // 0x0170   (0x0010)  
	int8_t                                             ShouldReloadByOne;                                          // 0x0180   (0x0001)  
	unsigned char                                      UnknownData04_6[0x7];                                       // 0x0181   (0x0007)  MISSED
	FString                                            AccessoryType;                                              // 0x0188   (0x0010)  
	float                                              AdapterAdjustDamage;                                        // 0x0198   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x019C   (0x0004)  MISSED
	FString                                            Scope;                                                      // 0x01A0   (0x0010)  
	float                                              ReloadSpeedRatio;                                           // 0x01B0   (0x0004)  
	float                                              ADSMoveSpeedRatio;                                          // 0x01B4   (0x0004)  
	float                                              MoveSpeedRatio;                                             // 0x01B8   (0x0004)  
	unsigned char                                      UnknownData06_7[0x4];                                       // 0x01BC   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.WeaponRuleWDCTableRow
/// Size: 0x01B8 (440 bytes) (0x000008 - 0x0001C0) align 8 pad: 0x0000
struct FWeaponRuleWDCTableRow : FTableRowBase
{ 
	uint32_t                                           ItemID;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              BulletSize;                                                 // 0x0010   (0x0018)  
	uint32_t                                           AmmoCapacity;                                               // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<uint32_t>                                   size_ext;                                                   // 0x0030   (0x0010)  
	uint32_t                                           CanFold;                                                    // 0x0040   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0044   (0x0004)  MISSED
	FString                                            AssembleTag;                                                // 0x0048   (0x0010)  
	FString                                            SubAssembleTag;                                             // 0x0058   (0x0010)  
	uint64_t                                           slot_type;                                                  // 0x0068   (0x0008)  
	uint64_t                                           sub_slot_type;                                              // 0x0070   (0x0008)  
	TArray<FWeaponSocket>                              Sockets;                                                    // 0x0078   (0x0010)  
	TArray<uint32_t>                                   ConflictedItemIds;                                          // 0x0088   (0x0010)  
	float                                              Engonomics;                                                 // 0x0098   (0x0004)  
	float                                              Accuracy;                                                   // 0x009C   (0x0004)  
	float                                              MoaScale;                                                   // 0x00A0   (0x0004)  
	float                                              AdsMoaX;                                                    // 0x00A4   (0x0004)  
	float                                              AdsMoaY;                                                    // 0x00A8   (0x0004)  
	float                                              HorizontalRecoil;                                           // 0x00AC   (0x0004)  
	float                                              VerticalRecoil;                                             // 0x00B0   (0x0004)  
	float                                              SightRange;                                                 // 0x00B4   (0x0004)  
	float                                              MuzzleVelocity;                                             // 0x00B8   (0x0004)  
	uint32_t                                           RaceStrategy;                                               // 0x00BC   (0x0004)  
	float                                              MaxCount;                                                   // 0x00C0   (0x0004)  
	float                                              Recoil;                                                     // 0x00C4   (0x0004)  
	float                                              ZeroDropDistance;                                           // 0x00C8   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x00CC   (0x0004)  MISSED
	FText                                              TypesOfFire;                                                // 0x00D0   (0x0018)  
	FText                                              Caliber;                                                    // 0x00E8   (0x0018)  
	FString                                            FireRate;                                                   // 0x0100   (0x0010)  
	FString                                            EffectiveDistance;                                          // 0x0110   (0x0010)  
	TArray<FString>                                    FireRequireTags;                                            // 0x0120   (0x0010)  
	TArray<FWeaponTag>                                 fi_require_tags;                                            // 0x0130   (0x0010)  
	TArray<FString>                                    AdapterFireRequireTags;                                     // 0x0140   (0x0010)  
	TArray<FWeaponTag>                                 ad_require_tags;                                            // 0x0150   (0x0010)  
	FString                                            FireRequireTagsDecrease;                                    // 0x0160   (0x0010)  
	TArray<FWeaponTag>                                 de_require_tags;                                            // 0x0170   (0x0010)  
	int8_t                                             ShouldReloadByOne;                                          // 0x0180   (0x0001)  
	unsigned char                                      UnknownData04_6[0x7];                                       // 0x0181   (0x0007)  MISSED
	FString                                            AccessoryType;                                              // 0x0188   (0x0010)  
	float                                              AdapterAdjustDamage;                                        // 0x0198   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x019C   (0x0004)  MISSED
	FString                                            Scope;                                                      // 0x01A0   (0x0010)  
	float                                              ReloadSpeedRatio;                                           // 0x01B0   (0x0004)  
	float                                              ADSMoveSpeedRatio;                                          // 0x01B4   (0x0004)  
	float                                              MoveSpeedRatio;                                             // 0x01B8   (0x0004)  
	unsigned char                                      UnknownData06_7[0x4];                                       // 0x01BC   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RuleConf
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FRuleConf
{ 
	uint32_t                                           cond;                                                       // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<uint32_t>                                   cond_ids;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponRuleConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FWeaponRuleConfTableRow : FTableRowBase
{ 
	uint32_t                                           base_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FRuleConf>                                  rules;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponRecommendWeaponConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FWeaponRecommendWeaponConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           max_num;                                                    // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RecommendWeaponItemConf
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 4 pad: 0x0000
struct FRecommendWeaponItemConf
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
	uint32_t                                           slot_index;                                                 // 0x0008   (0x0004)  
	uint32_t                                           Parent;                                                     // 0x000C   (0x0004)  
	uint32_t                                           parent_idx;                                                 // 0x0010   (0x0004)  
};

/// Struct /Script/UADataTableModule.WeaponRecommendConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FWeaponRecommendConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FRecommendWeaponItemConf>                   Items;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponRecommendArgConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FWeaponRecommendArgConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<uint32_t>                                   Blacklist;                                                  // 0x0010   (0x0010)  
	uint32_t                                           design_prob;                                                // 0x0020   (0x0004)  
	uint32_t                                           ds_out_prob;                                                // 0x0024   (0x0004)  
};

/// Struct /Script/UADataTableModule.WeaponPresetConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FWeaponPresetConfTableRow : FTableRowBase
{ 
	uint64_t                                           ID;                                                         // 0x0008   (0x0008)  
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	uint32_t                                           isSuper;                                                    // 0x0028   (0x0004)  
	uint32_t                                           baseId;                                                     // 0x002C   (0x0004)  
};

/// Struct /Script/UADataTableModule.WeaponNumConfTableRow
/// Size: 0x0000 (0 bytes) (0x000008 - 0x000008) align 8 pad: 0x0000
struct FWeaponNumConfTableRow : FTableRowBase
{ 
};

/// Struct /Script/UADataTableModule.WeaponFilterItemsConfTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FWeaponFilterItemsConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	TArray<uint32_t>                                   arr;                                                        // 0x0028   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponDetailValueToAttributeTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FWeaponDetailValueToAttributeTableRow : FTableRowBase
{ 
	FString                                            DetailValueName;                                            // 0x0008   (0x0010)  
	FString                                            AttributeName;                                              // 0x0018   (0x0010)  
	uint32_t                                           ModOp;                                                      // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.WeaponDetailConfTableRow
/// Size: 0x0250 (592 bytes) (0x000008 - 0x000258) align 8 pad: 0x0000
struct FWeaponDetailConfTableRow : FTableRowBase
{ 
	uint32_t                                           ItemID;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              BulletSize;                                                 // 0x0010   (0x0018)  
	TArray<uint32_t>                                   size_ext;                                                   // 0x0028   (0x0010)  
	FText                                              TypesOfFire;                                                // 0x0038   (0x0018)  
	FString                                            FireRate;                                                   // 0x0050   (0x0010)  
	float                                              MuzzleVelocity;                                             // 0x0060   (0x0004)  
	float                                              AdapterAdjustDamage;                                        // 0x0064   (0x0004)  
	FText                                              FiringPowerDisplay;                                         // 0x0068   (0x0018)  
	float                                              Engonomics;                                                 // 0x0080   (0x0004)  
	float                                              Accuracy;                                                   // 0x0084   (0x0004)  
	float                                              ZeroDropDistance;                                           // 0x0088   (0x0004)  
	float                                              MoaScale;                                                   // 0x008C   (0x0004)  
	float                                              AdsMoaX;                                                    // 0x0090   (0x0004)  
	float                                              AdsMoaY;                                                    // 0x0094   (0x0004)  
	float                                              HorizontalRecoil;                                           // 0x0098   (0x0004)  
	float                                              VerticalRecoil;                                             // 0x009C   (0x0004)  
	float                                              Recoil;                                                     // 0x00A0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00A4   (0x0004)  MISSED
	FString                                            EffectiveDistance;                                          // 0x00A8   (0x0010)  
	float                                              ADSMoveSpeedRatio;                                          // 0x00B8   (0x0004)  
	float                                              MoveSpeedRatio;                                             // 0x00BC   (0x0004)  
	float                                              CheckMagRatio;                                              // 0x00C0   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00C4   (0x0004)  MISSED
	FText                                              SuppressorSoundShow;                                        // 0x00C8   (0x0018)  
	char                                               SilencerType;                                               // 0x00E0   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x00E1   (0x0003)  MISSED
	float                                              RunSpeedRatio;                                              // 0x00E4   (0x0004)  
	float                                              SprintSpeedRatio;                                           // 0x00E8   (0x0004)  
	float                                              SilentWalkSpeedRatio;                                       // 0x00EC   (0x0004)  
	float                                              AccuracyPunishRatio;                                        // 0x00F0   (0x0004)  
	float                                              LeanRatio;                                                  // 0x00F4   (0x0004)  
	int8_t                                             ShouldReloadByOne;                                          // 0x00F8   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x00F9   (0x0003)  MISSED
	uint32_t                                           CanFold;                                                    // 0x00FC   (0x0004)  
	FString                                            Scope;                                                      // 0x0100   (0x0010)  
	uint32_t                                           AmmoCapacity;                                               // 0x0110   (0x0004)  
	uint32_t                                           RaceStrategy;                                               // 0x0114   (0x0004)  
	FString                                            LightIntensityDisplay;                                      // 0x0118   (0x0010)  
	float                                              EnergyCostPerFire;                                          // 0x0128   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x012C   (0x0004)  MISSED
	FString                                            AdapterArmorLevel;                                          // 0x0130   (0x0010)  
	FText                                              Caliber;                                                    // 0x0140   (0x0018)  
	FString                                            AccessoryType;                                              // 0x0158   (0x0010)  
	float                                              ReloadSpeedRatio;                                           // 0x0168   (0x0004)  
	float                                              MaxCount;                                                   // 0x016C   (0x0004)  
	float                                              SightRange;                                                 // 0x0170   (0x0004)  
	float                                              SprintToIdle;                                               // 0x0174   (0x0004)  
	TArray<FString>                                    FireRequireTags;                                            // 0x0178   (0x0010)  
	TArray<FWeaponTag>                                 fi_require_tags;                                            // 0x0188   (0x0010)  
	TArray<FString>                                    AdapterFireRequireTags;                                     // 0x0198   (0x0010)  
	TArray<FWeaponTag>                                 ad_require_tags;                                            // 0x01A8   (0x0010)  
	FString                                            FireRequireTagsDecrease;                                    // 0x01B8   (0x0010)  
	TArray<FWeaponTag>                                 de_require_tags;                                            // 0x01C8   (0x0010)  
	FString                                            AssembleTag;                                                // 0x01D8   (0x0010)  
	FString                                            SubAssembleTag;                                             // 0x01E8   (0x0010)  
	TArray<uint32_t>                                   ConflictedItemIds;                                          // 0x01F8   (0x0010)  
	uint64_t                                           slot_type;                                                  // 0x0208   (0x0008)  
	uint64_t                                           sub_slot_type;                                              // 0x0210   (0x0008)  
	FString                                            DurabilityAccuracyCurvePath;                                // 0x0218   (0x0010)  
	FString                                            DurabilityMalfunctionCurvePath;                             // 0x0228   (0x0010)  
	FString                                            DurabilityMoaCurvePath;                                     // 0x0238   (0x0010)  
	TArray<FWeaponSocket>                              Sockets;                                                    // 0x0248   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponClassifyConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FWeaponClassifyConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            iconPath;                                                   // 0x0010   (0x0010)  
	FText                                              Name;                                                       // 0x0020   (0x0018)  
	uint32_t                                           ItemType;                                                   // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.BulletTag
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FBulletTag
{ 
	FString                                            bullet_tag;                                                 // 0x0000   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponBulletMatchConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FWeaponBulletMatchConfTableRow : FTableRowBase
{ 
	uint32_t                                           item_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FBulletTag>                                 bullet_tags;                                                // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeaponAvatarSetCfgTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FWeaponAvatarSetCfgTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<uint32_t>                                   avatar_set;                                                 // 0x0010   (0x0010)  
	uint32_t                                           SkinAssemble;                                               // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.WeaponItemConf
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 4 pad: 0x0000
struct FWeaponItemConf
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
	uint32_t                                           slot_index;                                                 // 0x0008   (0x0004)  
	uint32_t                                           Parent;                                                     // 0x000C   (0x0004)  
	uint32_t                                           parent_idx;                                                 // 0x0010   (0x0004)  
	uint32_t                                           spray_item_id;                                              // 0x0014   (0x0004)  
};

/// Struct /Script/UADataTableModule.WeaponAssembleConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FWeaponAssembleConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           col_size;                                                   // 0x000C   (0x0004)  
	uint32_t                                           row_size;                                                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            unique_id;                                                  // 0x0018   (0x0010)  
	uint32_t                                           can_fire;                                                   // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<FWeaponItemConf>                            Items;                                                      // 0x0030   (0x0010)  
};

/// Struct /Script/UADataTableModule.WealthTagConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FWealthTagConfTableRow : FTableRowBase
{ 
	uint32_t                                           wealth_conf_type;                                           // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	int64_t                                            Param;                                                      // 0x0010   (0x0008)  
	int32_t                                            possibility;                                                // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.WarmScoreConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FWarmScoreConfTableRow : FTableRowBase
{ 
	uint32_t                                           score_type;                                                 // 0x0008   (0x0004)  
	uint32_t                                           Val;                                                        // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.WarmProfitConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FWarmProfitConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	int32_t                                            profit_rate;                                                // 0x000C   (0x0004)  
	int32_t                                            profit_score;                                               // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.WarmLossConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FWarmLossConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	int32_t                                            loss_rate;                                                  // 0x000C   (0x0004)  
	int32_t                                            loss_score;                                                 // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.WarmLevelConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FWarmLevelConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Level;                                                      // 0x000C   (0x0004)  
	uint32_t                                           add_level_rate;                                             // 0x0010   (0x0004)  
	uint32_t                                           del_level_rate;                                             // 0x0014   (0x0004)  
};

/// Struct /Script/UADataTableModule.WarmExpConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FWarmExpConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Exp;                                                        // 0x000C   (0x0004)  
	uint32_t                                           add_exp_rate;                                               // 0x0010   (0x0004)  
	uint32_t                                           del_exp_rate;                                               // 0x0014   (0x0004)  
};

/// Struct /Script/UADataTableModule.WarmContinuousLoseConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FWarmContinuousLoseConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           continuous_lose;                                            // 0x000C   (0x0004)  
	uint32_t                                           add_continuous_lose_rate;                                   // 0x0010   (0x0004)  
	uint32_t                                           del_continuous_lose_rate;                                   // 0x0014   (0x0004)  
	int32_t                                            extra_score;                                                // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.VoiceIconSoundTableRow
/// Size: 0x0080 (128 bytes) (0x000008 - 0x000088) align 8 pad: 0x0000
struct FVoiceIconSoundTableRow : FTableRowBase
{ 
	int32_t                                            ItemID;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            VoiceIconPath;                                              // 0x0010   (0x0010)  
	FText                                              VoiceDescription;                                           // 0x0020   (0x0018)  
	TArray<FString>                                    VoiceSoundPaths;                                            // 0x0038   (0x0010)  
	TArray<FString>                                    WanderVoiceSoundPaths;                                      // 0x0048   (0x0010)  
	TArray<uint32_t>                                   jump_goto;                                                  // 0x0058   (0x0010)  
	FText                                              no_source_description;                                      // 0x0068   (0x0018)  
	uint32_t                                           ActiveStatus;                                               // 0x0080   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0084   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ValueDistributionConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FValueDistributionConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Inclination;                                                // 0x000C   (0x0004)  
	uint32_t                                           Gun;                                                        // 0x0010   (0x0004)  
	uint32_t                                           ContainerArmor;                                             // 0x0014   (0x0004)  
	uint32_t                                           head;                                                       // 0x0018   (0x0004)  
	uint32_t                                           Bullet;                                                     // 0x001C   (0x0004)  
	uint32_t                                           Consumables;                                                // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.UserTagVarParamTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FUserTagVarParamTableRow : FTableRowBase
{ 
	FText                                              ID;                                                         // 0x0008   (0x0018)  
	uint32_t                                           Param;                                                      // 0x0020   (0x0004)  
	uint32_t                                           Param0;                                                     // 0x0024   (0x0004)  
	uint32_t                                           Param1;                                                     // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ConditionItem
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FConditionItem
{ 
	FText                                              expresion;                                                  // 0x0000   (0x0018)  
	uint32_t                                           Op;                                                         // 0x0018   (0x0004)  
	uint32_t                                           Value;                                                      // 0x001C   (0x0004)  
};

/// Struct /Script/UADataTableModule.UserTagTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FUserTagTableRow : FTableRowBase
{ 
	uint32_t                                           tag_id;                                                     // 0x0008   (0x0004)  
	uint32_t                                           tag_type;                                                   // 0x000C   (0x0004)  
	FText                                              tag_name;                                                   // 0x0010   (0x0018)  
	uint32_t                                           tag_priority;                                               // 0x0028   (0x0004)  
	uint32_t                                           tag_param;                                                  // 0x002C   (0x0004)  
	TArray<FConditionItem>                             Conditions;                                                 // 0x0030   (0x0010)  
};

/// Struct /Script/UADataTableModule.UpgradeUnlockTableRow
/// Size: 0x00C8 (200 bytes) (0x000008 - 0x0000D0) align 8 pad: 0x0000
struct FUpgradeUnlockTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Type;                                                       // 0x000C   (0x0004)  
	uint32_t                                           function_control_id;                                        // 0x0010   (0x0004)  
	uint32_t                                           preview_level;                                              // 0x0014   (0x0004)  
	uint32_t                                           sort;                                                       // 0x0018   (0x0004)  
	uint32_t                                           sys_id;                                                     // 0x001C   (0x0004)  
	FText                                              unlock_tip;                                                 // 0x0020   (0x0018)  
	FText                                              preview_label;                                              // 0x0038   (0x0018)  
	FText                                              preview_desc;                                               // 0x0050   (0x0018)  
	FText                                              label;                                                      // 0x0068   (0x0018)  
	FText                                              desc1;                                                      // 0x0080   (0x0018)  
	FString                                            image_path;                                                 // 0x0098   (0x0010)  
	FString                                            small_image_path;                                           // 0x00A8   (0x0010)  
	FText                                              robot_help_key;                                             // 0x00B8   (0x0018)  
};

/// Struct /Script/UADataTableModule.TrialCardConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FTrialCardConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           avatar_id;                                                  // 0x000C   (0x0004)  
	uint32_t                                           expire_time;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.TraderScaleConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FTraderScaleConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	float                                              DistancePercentA;                                           // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.TradeItemClassifyConfTableRow
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000060) align 8 pad: 0x0000
struct FTradeItemClassifyConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           bussinessman_id;                                            // 0x000C   (0x0004)  
	FText                                              icon_path;                                                  // 0x0010   (0x0018)  
	FText                                              Name;                                                       // 0x0028   (0x0018)  
	TArray<uint64_t>                                   item_types;                                                 // 0x0040   (0x0010)  
	uint32_t                                           classify_type;                                              // 0x0050   (0x0004)  
	uint32_t                                           is_act_classify;                                            // 0x0054   (0x0004)  
	uint32_t                                           show_classify;                                              // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x005C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.BusinessHeadConf
/// Size: 0x00D0 (208 bytes) (0x000000 - 0x0000D0) align 8 pad: 0x0000
struct FBusinessHeadConf
{ 
	FString                                            Path;                                                       // 0x0000   (0x0010)  
	FString                                            Path0;                                                      // 0x0010   (0x0010)  
	FString                                            Path1;                                                      // 0x0020   (0x0010)  
	FString                                            Path2;                                                      // 0x0030   (0x0010)  
	FString                                            Path3;                                                      // 0x0040   (0x0010)  
	FString                                            Path4;                                                      // 0x0050   (0x0010)  
	FString                                            Path5;                                                      // 0x0060   (0x0010)  
	FString                                            Path6;                                                      // 0x0070   (0x0010)  
	FString                                            Path7;                                                      // 0x0080   (0x0010)  
	FString                                            Path8;                                                      // 0x0090   (0x0010)  
	FString                                            Path9;                                                      // 0x00A0   (0x0010)  
	FString                                            Path10;                                                     // 0x00B0   (0x0010)  
	FString                                            Path11;                                                     // 0x00C0   (0x0010)  
};

/// Struct /Script/UADataTableModule.TradeHeadIconTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FTradeHeadIconTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           businessman_id;                                             // 0x000C   (0x0004)  
	FString                                            BusinessHead_Path;                                          // 0x0010   (0x0010)  
	TArray<FBusinessHeadConf>                          stage_head_vec;                                             // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.TradeDialogVoiceConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FTradeDialogVoiceConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           businessman_id;                                             // 0x000C   (0x0004)  
	FString                                            DialogTypeDef;                                              // 0x0010   (0x0010)  
	FString                                            AudioSourceName;                                            // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.ExchangeItemConf
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FExchangeItemConf
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.TradeConfTableRow
/// Size: 0x0098 (152 bytes) (0x000008 - 0x0000A0) align 8 pad: 0x0000
struct FTradeConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           businessman_id;                                             // 0x000C   (0x0004)  
	uint32_t                                           classify_id;                                                // 0x0010   (0x0004)  
	uint32_t                                           seq;                                                        // 0x0014   (0x0004)  
	uint32_t                                           loyalty_level;                                              // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FText                                              lock_desc;                                                  // 0x0020   (0x0018)  
	uint32_t                                           is_hide;                                                    // 0x0038   (0x0004)  
	uint32_t                                           task_id;                                                    // 0x003C   (0x0004)  
	uint32_t                                           businessman_reputation;                                     // 0x0040   (0x0004)  
	uint32_t                                           Level;                                                      // 0x0044   (0x0004)  
	uint32_t                                           have_item;                                                  // 0x0048   (0x0004)  
	uint32_t                                           buy_limit;                                                  // 0x004C   (0x0004)  
	FDateTime                                          refresh_begin_time;                                         // 0x0050   (0x0008)  
	uint32_t                                           refresh_period;                                             // 0x0058   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	FDateTime                                          limit_refresh_begin_time;                                   // 0x0060   (0x0008)  
	uint32_t                                           limit_refresh_period;                                       // 0x0068   (0x0004)  
	uint32_t                                           sell_item_id;                                               // 0x006C   (0x0004)  
	uint32_t                                           sell_num;                                                   // 0x0070   (0x0004)  
	uint32_t                                           is_faction;                                                 // 0x0074   (0x0004)  
	FText                                              sellItemName;                                               // 0x0078   (0x0018)  
	TArray<FExchangeItemConf>                          exchange_item_vec;                                          // 0x0090   (0x0010)  
};

/// Struct /Script/UADataTableModule.TpnsPushConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FTpnsPushConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            Title;                                                      // 0x0010   (0x0010)  
	FString                                            Content;                                                    // 0x0020   (0x0010)  
	FString                                            ios_subtitle;                                               // 0x0030   (0x0010)  
};

/// Struct /Script/UADataTableModule.TitleItemConfTableRow
/// Size: 0x0068 (104 bytes) (0x000008 - 0x000070) align 8 pad: 0x0000
struct FTitleItemConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FDateTime                                          start_time;                                                 // 0x0010   (0x0008)  
	FDateTime                                          end_time;                                                   // 0x0018   (0x0008)  
	uint32_t                                           JumpId;                                                     // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	FText                                              JumpDesc;                                                   // 0x0028   (0x0018)  
	FText                                              CannotGetDesc;                                              // 0x0040   (0x0018)  
	uint32_t                                           MaxAddStarNum;                                              // 0x0058   (0x0004)  
	uint32_t                                           ShowNormalGetPanel;                                         // 0x005C   (0x0004)  
	uint32_t                                           is_off_sale;                                                // 0x0060   (0x0004)  
	uint32_t                                           can_add_star;                                               // 0x0064   (0x0004)  
	uint32_t                                           show_get_time;                                              // 0x0068   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x006C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.TicketConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FTicketConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x000C   (0x0004)  
	uint32_t                                           cast_num;                                                   // 0x0010   (0x0004)  
	int32_t                                            tip_id;                                                     // 0x0014   (0x0004)  
};

/// Struct /Script/UADataTableModule.ThrowableWeaponDetailTableRow
/// Size: 0x0098 (152 bytes) (0x000008 - 0x0000A0) align 8 pad: 0x0000
struct FThrowableWeaponDetailTableRow : FTableRowBase
{ 
	uint64_t                                           ItemID;                                                     // 0x0008   (0x0008)  
	TArray<float>                                      DelayEffect;                                                // 0x0010   (0x0010)  
	FText                                              EffectRange;                                                // 0x0020   (0x0018)  
	float                                              EffectTime;                                                 // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	FText                                              ArmorDamage;                                                // 0x0040   (0x0018)  
	FText                                              Penetration;                                                // 0x0058   (0x0018)  
	FText                                              PieceCount;                                                 // 0x0070   (0x0018)  
	FText                                              PieceType;                                                  // 0x0088   (0x0018)  
};

/// Struct /Script/UADataTableModule.TeamVoiceTableRow
/// Size: 0x0070 (112 bytes) (0x000008 - 0x000078) align 8 pad: 0x0000
struct FTeamVoiceTableRow : FTableRowBase
{ 
	int32_t                                            ItemID;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              VoiceDesc;                                                  // 0x0010   (0x0018)  
	FString                                            VoicePath;                                                  // 0x0028   (0x0010)  
	FText                                              VoiceContent;                                               // 0x0038   (0x0018)  
	FString                                            WanderPath;                                                 // 0x0050   (0x0010)  
	FString                                            WanderContent;                                              // 0x0060   (0x0010)  
	int32_t                                            VoiceType;                                                  // 0x0070   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0074   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.TeamConfVersionRange
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FTeamConfVersionRange
{ 
	FString                                            min_version;                                                // 0x0000   (0x0010)  
	FString                                            max_version;                                                // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.TeamVersionConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FTeamVersionConfTableRow : FTableRowBase
{ 
	uint32_t                                           env_id;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FTeamConfVersionRange>                      version_ranges;                                             // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.TeamTargetConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FTeamTargetConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              target_name;                                                // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.TeamStyleConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FTeamStyleConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              style_name;                                                 // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.TeamRatingCommConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FTeamRatingCommConfTableRow : FTableRowBase
{ 
	uint32_t                                           conf_type;                                                  // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	int64_t                                            Val;                                                        // 0x0010   (0x0008)  
};

/// Struct /Script/UADataTableModule.RatingConditionConf
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FRatingConditionConf
{ 
	FText                                              expression;                                                 // 0x0000   (0x0018)  
	uint32_t                                           Op;                                                         // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	int64_t                                            Val;                                                        // 0x0020   (0x0008)  
};

/// Struct /Script/UADataTableModule.TeamRatingBattleConfTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FTeamRatingBattleConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x000C   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	int64_t                                            rating_change;                                              // 0x0018   (0x0008)  
	int64_t                                            rating_limit_change;                                        // 0x0020   (0x0008)  
	TArray<FRatingConditionConf>                       Conditions;                                                 // 0x0028   (0x0010)  
};

/// Struct /Script/UADataTableModule.TeamPlayerEnterConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FTeamPlayerEnterConfTableRow : FTableRowBase
{ 
	uint32_t                                           team_player_enter_type;                                     // 0x0008   (0x0004)  
	uint32_t                                           Val;                                                        // 0x000C   (0x0004)  
	int32_t                                            tip_id;                                                     // 0x0010   (0x0004)  
	uint32_t                                           Priority;                                                   // 0x0014   (0x0004)  
};

/// Struct /Script/UADataTableModule.TeamOptionTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FTeamOptionTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	uint32_t                                           DefaultValue;                                               // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.TeamListTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FTeamListTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	uint32_t                                           Type;                                                       // 0x0028   (0x0004)  
	uint32_t                                           DefaultValue;                                               // 0x002C   (0x0004)  
	uint32_t                                           Param1;                                                     // 0x0030   (0x0004)  
	uint32_t                                           Param2;                                                     // 0x0034   (0x0004)  
};

/// Struct /Script/UADataTableModule.TeamLendConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FTeamLendConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Val;                                                        // 0x000C   (0x0004)  
	TArray<uint32_t>                                   ary;                                                        // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.TeamDegreeConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FTeamDegreeConfTableRow : FTableRowBase
{ 
	uint32_t                                           hall_degree_type;                                           // 0x0008   (0x0004)  
	uint32_t                                           ID;                                                         // 0x000C   (0x0004)  
	int32_t                                            Val;                                                        // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.TeamConvenientMacthTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FTeamConvenientMacthTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	uint32_t                                           Type;                                                       // 0x0028   (0x0004)  
	uint32_t                                           DefaultValue;                                               // 0x002C   (0x0004)  
	uint32_t                                           Param1;                                                     // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.TaskTargetGroupConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FTaskTargetGroupConfTableRow : FTableRowBase
{ 
	uint32_t                                           group_id;                                                   // 0x0008   (0x0004)  
	uint32_t                                           target_id;                                                  // 0x000C   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.CommonItemConfItem
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FCommonItemConfItem
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.TaskTargetConfTableRow
/// Size: 0x00A0 (160 bytes) (0x000008 - 0x0000A8) align 8 pad: 0x0000
struct FTaskTargetConfTableRow : FTableRowBase
{ 
	uint32_t                                           target_id;                                                  // 0x0008   (0x0004)  
	uint32_t                                           target_type;                                                // 0x000C   (0x0004)  
	FText                                              desc;                                                       // 0x0010   (0x0018)  
	uint32_t                                           jump_goto;                                                  // 0x0028   (0x0004)  
	uint32_t                                           Progress;                                                   // 0x002C   (0x0004)  
	int64_t                                            Param1;                                                     // 0x0030   (0x0008)  
	int64_t                                            Param2;                                                     // 0x0038   (0x0008)  
	int64_t                                            param3;                                                     // 0x0040   (0x0008)  
	uint32_t                                           team_share;                                                 // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x004C   (0x0004)  MISSED
	int64_t                                            icon_item_id;                                               // 0x0050   (0x0008)  
	TArray<int64_t>                                    item_list;                                                  // 0x0058   (0x0010)  
	uint32_t                                           big_type;                                                   // 0x0068   (0x0004)  
	uint32_t                                           mid_type;                                                   // 0x006C   (0x0004)  
	uint32_t                                           sub_type;                                                   // 0x0070   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0074   (0x0004)  MISSED
	TArray<FCommonItemConfItem>                        rewards;                                                    // 0x0078   (0x0010)  
	TArray<uint32_t>                                   prev_target;                                                // 0x0088   (0x0010)  
	uint32_t                                           prev_type;                                                  // 0x0098   (0x0004)  
	uint32_t                                           fail_when_next_fail;                                        // 0x009C   (0x0004)  
	uint32_t                                           node_type;                                                  // 0x00A0   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x00A4   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.TaskReportConfTableRow
/// Size: 0x0060 (96 bytes) (0x000008 - 0x000068) align 8 pad: 0x0000
struct FTaskReportConfTableRow : FTableRowBase
{ 
	uint32_t                                           report_id;                                                  // 0x0008   (0x0004)  
	uint32_t                                           target_id;                                                  // 0x000C   (0x0004)  
	uint32_t                                           State;                                                      // 0x0010   (0x0004)  
	uint32_t                                           businessman_id;                                             // 0x0014   (0x0004)  
	FText                                              Title;                                                      // 0x0018   (0x0018)  
	FText                                              Content;                                                    // 0x0030   (0x0018)  
	float                                              report_time;                                                // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x004C   (0x0004)  MISSED
	FText                                              sound_url;                                                  // 0x0050   (0x0018)  
};

/// Struct /Script/UADataTableModule.ActLink
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FActLink
{ 
	uint32_t                                           link_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Index;                                                      // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.TaskLinkConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FTaskLinkConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FActLink>                                   Links;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.TaskDialogueTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FTaskDialogueTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              conversation;                                               // 0x0010   (0x0018)  
	FText                                              Title;                                                      // 0x0028   (0x0018)  
	uint32_t                                           NPC;                                                        // 0x0040   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0044   (0x0004)  MISSED
	TArray<FCommonItemConfItem>                        gifts;                                                      // 0x0048   (0x0010)  
};

/// Struct /Script/UADataTableModule.UnlockCondtionRef
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FUnlockCondtionRef
{ 
	uint32_t                                           cond_type;                                                  // 0x0000   (0x0004)  
	uint32_t                                           cond_value;                                                 // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.TaskTargetRefItem
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 pad: 0x0000
struct FTaskTargetRefItem
{ 
	uint32_t                                           target_id;                                                  // 0x0000   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x0004   (0x0004)  
	uint32_t                                           Property;                                                   // 0x0008   (0x0004)  
};

/// Struct /Script/UADataTableModule.AwardItemConf
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 pad: 0x0000
struct FAwardItemConf
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
	uint32_t                                           is_black;                                                   // 0x0008   (0x0004)  
	uint32_t                                           is_faction;                                                 // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.TaskConfTableRow
/// Size: 0x0168 (360 bytes) (0x000008 - 0x000170) align 8 pad: 0x0000
struct FTaskConfTableRow : FTableRowBase
{ 
	uint32_t                                           task_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           Type;                                                       // 0x000C   (0x0004)  
	uint32_t                                           label_type;                                                 // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FText                                              disp_title;                                                 // 0x0018   (0x0018)  
	uint32_t                                           season_id;                                                  // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	FText                                              chapter_name;                                               // 0x0038   (0x0018)  
	uint32_t                                           disp_type;                                                  // 0x0050   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0054   (0x0004)  MISSED
	FText                                              disp_desc;                                                  // 0x0058   (0x0018)  
	FText                                              disp_detail;                                                // 0x0070   (0x0018)  
	uint32_t                                           disp_address;                                               // 0x0088   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x008C   (0x0004)  MISSED
	FText                                              chapter;                                                    // 0x0090   (0x0018)  
	FDateTime                                          unlock_time;                                                // 0x00A8   (0x0008)  
	TArray<FUnlockCondtionRef>                         unlock_condtions;                                           // 0x00B0   (0x0010)  
	TArray<uint32_t>                                   pre_tasks;                                                  // 0x00C0   (0x0010)  
	uint32_t                                           pre_logic;                                                  // 0x00D0   (0x0004)  
	uint32_t                                           source_type;                                                // 0x00D4   (0x0004)  
	uint32_t                                           source_id;                                                  // 0x00D8   (0x0004)  
	uint32_t                                           faction_icon;                                               // 0x00DC   (0x0004)  
	uint32_t                                           Faction;                                                    // 0x00E0   (0x0004)  
	uint32_t                                           show_specified_businessman_stage;                           // 0x00E4   (0x0004)  
	uint32_t                                           businessman_stage;                                          // 0x00E8   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x00EC   (0x0004)  MISSED
	TArray<FTaskTargetRefItem>                         Targets;                                                    // 0x00F0   (0x0010)  
	uint32_t                                           need_finish_num;                                            // 0x0100   (0x0004)  
	uint32_t                                           hide_day;                                                   // 0x0104   (0x0004)  
	FText                                              kw_desc;                                                    // 0x0108   (0x0018)  
	uint32_t                                           gift_exp;                                                   // 0x0120   (0x0004)  
	uint32_t                                           gift_ruble;                                                 // 0x0124   (0x0004)  
	TArray<FAwardItemConf>                             rewards;                                                    // 0x0128   (0x0010)  
	uint32_t                                           prev_type;                                                  // 0x0138   (0x0004)  
	uint32_t                                           reaccept_if_failed;                                         // 0x013C   (0x0004)  
	uint32_t                                           accept_dialog_start_id;                                     // 0x0140   (0x0004)  
	uint32_t                                           finish_dialog_start_id;                                     // 0x0144   (0x0004)  
	uint32_t                                           task_difficult;                                             // 0x0148   (0x0004)  
	bool                                               complete_in_one_battle;                                     // 0x014C   (0x0001)  
	unsigned char                                      UnknownData05_6[0x3];                                       // 0x014D   (0x0003)  MISSED
	uint32_t                                           sort_weight;                                                // 0x0150   (0x0004)  
	uint32_t                                           activity_id;                                                // 0x0154   (0x0004)  
	TArray<int32_t>                                    reports_id;                                                 // 0x0158   (0x0010)  
	bool                                               gradually_unlock;                                           // 0x0168   (0x0001)  
	unsigned char                                      UnknownData06_7[0x7];                                       // 0x0169   (0x0007)  MISSED
};

/// Struct /Script/UADataTableModule.TaskCommitTargetConfTableRow
/// Size: 0x0150 (336 bytes) (0x000008 - 0x000158) align 8 pad: 0x0000
struct FTaskCommitTargetConfTableRow : FTableRowBase
{ 
	uint32_t                                           target_id;                                                  // 0x0008   (0x0004)  
	uint32_t                                           commit_type;                                                // 0x000C   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	TArray<uint32_t>                                   item_list;                                                  // 0x0018   (0x0010)  
	uint32_t                                           big_type;                                                   // 0x0028   (0x0004)  
	uint32_t                                           mid_type;                                                   // 0x002C   (0x0004)  
	uint32_t                                           sub_type;                                                   // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	TArray<uint32_t>                                   size_x;                                                     // 0x0038   (0x0010)  
	TArray<uint32_t>                                   size_y;                                                     // 0x0048   (0x0010)  
	TArray<uint32_t>                                   size_all;                                                   // 0x0058   (0x0010)  
	uint32_t                                           is_raidloot;                                                // 0x0068   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x006C   (0x0004)  MISSED
	TArray<uint32_t>                                   Durability;                                                 // 0x0070   (0x0010)  
	TArray<uint32_t>                                   durability_limit;                                           // 0x0080   (0x0010)  
	TArray<uint32_t>                                   Engonomics;                                                 // 0x0090   (0x0010)  
	TArray<uint32_t>                                   Accuracy;                                                   // 0x00A0   (0x0010)  
	TArray<uint32_t>                                   ads_moa_y;                                                  // 0x00B0   (0x0010)  
	TArray<uint32_t>                                   horizontal_recoil;                                          // 0x00C0   (0x0010)  
	TArray<uint32_t>                                   vertical_recoil;                                            // 0x00D0   (0x0010)  
	TArray<uint32_t>                                   sight_range;                                                // 0x00E0   (0x0010)  
	TArray<uint32_t>                                   muzzle_velocity;                                            // 0x00F0   (0x0010)  
	TArray<uint32_t>                                   max_count;                                                  // 0x0100   (0x0010)  
	TArray<uint32_t>                                   Recoil;                                                     // 0x0110   (0x0010)  
	uint32_t                                           fire_type;                                                  // 0x0120   (0x0004)  
	uint32_t                                           Caliber;                                                    // 0x0124   (0x0004)  
	TArray<uint32_t>                                   fire_rate;                                                  // 0x0128   (0x0010)  
	TArray<uint32_t>                                   effect_dist;                                                // 0x0138   (0x0010)  
	TArray<uint32_t>                                   Components;                                                 // 0x0148   (0x0010)  
};

/// Struct /Script/UADataTableModule.TaskActTargetDescParamConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FTaskActTargetDescParamConfTableRow : FTableRowBase
{ 
	int64_t                                            ID;                                                         // 0x0008   (0x0008)  
	FText                                              desc;                                                       // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.TaskActTargetDescConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FTaskActTargetDescConfTableRow : FTableRowBase
{ 
	uint32_t                                           target_type;                                                // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              target_desc;                                                // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.TaskActDescConfTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FTaskActDescConfTableRow : FTableRowBase
{ 
	uint32_t                                           task_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              task_title;                                                 // 0x0010   (0x0018)  
	FText                                              task_detail;                                                // 0x0028   (0x0018)  
	TArray<FAwardItemConf>                             rewards;                                                    // 0x0040   (0x0010)  
	uint32_t                                           need_reissue;                                               // 0x0050   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0054   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ActTargetRef
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 pad: 0x0000
struct FActTargetRef
{ 
	uint32_t                                           target_type;                                                // 0x0000   (0x0004)  
	uint32_t                                           max_progress;                                               // 0x0004   (0x0004)  
	int64_t                                            Param1;                                                     // 0x0008   (0x0008)  
	int64_t                                            Param2;                                                     // 0x0010   (0x0008)  
	int64_t                                            param3;                                                     // 0x0018   (0x0008)  
	int64_t                                            param4;                                                     // 0x0020   (0x0008)  
	FString                                            param5;                                                     // 0x0028   (0x0010)  
	FDateTime                                          param6;                                                     // 0x0038   (0x0008)  
	int64_t                                            param7;                                                     // 0x0040   (0x0008)  
	uint32_t                                           Difficulty;                                                 // 0x0048   (0x0004)  
	uint32_t                                           jump_id;                                                    // 0x004C   (0x0004)  
};

/// Struct /Script/UADataTableModule.TaskActConfTableRow
/// Size: 0x0088 (136 bytes) (0x000008 - 0x000090) align 8 pad: 0x0000
struct FTaskActConfTableRow : FTableRowBase
{ 
	uint32_t                                           task_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              task_title;                                                 // 0x0010   (0x0018)  
	uint32_t                                           begin_day;                                                  // 0x0028   (0x0004)  
	uint32_t                                           end_day;                                                    // 0x002C   (0x0004)  
	FString                                            begin_time;                                                 // 0x0030   (0x0010)  
	FString                                            end_time;                                                   // 0x0040   (0x0010)  
	FDateTime                                          abs_begin_time;                                             // 0x0050   (0x0008)  
	FDateTime                                          abs_end_time;                                               // 0x0058   (0x0008)  
	TArray<FActTargetRef>                              Targets;                                                    // 0x0060   (0x0010)  
	TArray<FAwardItemConf>                             rewards;                                                    // 0x0070   (0x0010)  
	uint32_t                                           need_reissue;                                               // 0x0080   (0x0004)  
	uint32_t                                           reissue_mail_id;                                            // 0x0084   (0x0004)  
	uint32_t                                           map_need;                                                   // 0x0088   (0x0004)  
	uint32_t                                           show_in_game;                                               // 0x008C   (0x0004)  
};

/// Struct /Script/UADataTableModule.TargetArmorTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FTargetArmorTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x000C   (0x0004)  
	uint32_t                                           unlock_item;                                                // 0x0010   (0x0004)  
	uint32_t                                           is_default;                                                 // 0x0014   (0x0004)  
};

/// Struct /Script/UADataTableModule.TagSheet2TableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FTagSheet2TableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            SocketName;                                                 // 0x0010   (0x0010)  
	FText                                              PartName;                                                   // 0x0020   (0x0018)  
};

/// Struct /Script/UADataTableModule.TagSheet1TableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FTagSheet1TableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            Tag;                                                        // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.TagMatchedConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FTagMatchedConfTableRow : FTableRowBase
{ 
	FString                                            Tag;                                                        // 0x0008   (0x0010)  
	TArray<uint32_t>                                   matchedItemIDs;                                             // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.item
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct Fitem
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           item_num;                                                   // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.SurveyConfTableRow
/// Size: 0x00C0 (192 bytes) (0x000008 - 0x0000C8) align 8 pad: 0x0000
struct FSurveyConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Priority;                                                   // 0x000C   (0x0004)  
	FText                                              Title;                                                      // 0x0010   (0x0018)  
	FText                                              Content;                                                    // 0x0028   (0x0018)  
	FDateTime                                          begin_time;                                                 // 0x0040   (0x0008)  
	FDateTime                                          end_time;                                                   // 0x0048   (0x0008)  
	uint32_t                                           vaild_time;                                                 // 0x0050   (0x0004)  
	uint32_t                                           TaskId;                                                     // 0x0054   (0x0004)  
	FText                                              sid;                                                        // 0x0058   (0x0018)  
	FText                                              URL;                                                        // 0x0070   (0x0018)  
	FText                                              code;                                                       // 0x0088   (0x0018)  
	uint32_t                                           Type;                                                       // 0x00A0   (0x0004)  
	uint32_t                                           cirle;                                                      // 0x00A4   (0x0004)  
	uint32_t                                           Limit;                                                      // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00AC   (0x0004)  MISSED
	TArray<Fitem>                                      gifts;                                                      // 0x00B0   (0x0010)  
	uint32_t                                           svr_limit_id;                                               // 0x00C0   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x00C4   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RewardItem
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 pad: 0x0000
struct FRewardItem
{ 
	uint32_t                                           ID;                                                         // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
	uint32_t                                           is_black;                                                   // 0x0008   (0x0004)  
};

/// Struct /Script/UADataTableModule.SupplyCardRewardConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FSupplyCardRewardConfTableRow : FTableRowBase
{ 
	uint32_t                                           reward_id;                                                  // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              reward_name;                                                // 0x0010   (0x0018)  
	uint32_t                                           buy_mall_id;                                                // 0x0028   (0x0004)  
	uint32_t                                           reward_mall_id;                                             // 0x002C   (0x0004)  
	TArray<FRewardItem>                                immediate_reward_list;                                      // 0x0030   (0x0010)  
};

/// Struct /Script/UADataTableModule.SupplyCardConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FSupplyCardConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           reward_id;                                                  // 0x000C   (0x0004)  
	uint32_t                                           effective_days;                                             // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.SubsBlacklistConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FSubsBlacklistConfTableRow : FTableRowBase
{ 
	uint32_t                                           item_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.StreakExpTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FStreakExpTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Exp;                                                        // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.StashSlotConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FStashSlotConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           money_id;                                                   // 0x000C   (0x0004)  
	uint32_t                                           money_num;                                                  // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.StandaloneWeatherTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FStandaloneWeatherTableRow : FTableRowBase
{ 
	uint32_t                                           PlaymModeID;                                                // 0x0008   (0x0004)  
	uint32_t                                           Weather1;                                                   // 0x000C   (0x0004)  
	uint32_t                                           Weather2;                                                   // 0x0010   (0x0004)  
	uint32_t                                           Weather3;                                                   // 0x0014   (0x0004)  
	uint32_t                                           Weather4;                                                   // 0x0018   (0x0004)  
	uint32_t                                           Weather5;                                                   // 0x001C   (0x0004)  
	uint32_t                                           Weather6;                                                   // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.SprayIconTextureTableRow
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000060) align 8 pad: 0x0000
struct FSprayIconTextureTableRow : FTableRowBase
{ 
	uint32_t                                           ItemID;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            SprayIconPath;                                              // 0x0010   (0x0010)  
	FString                                            SprayTexture;                                               // 0x0020   (0x0010)  
	TArray<uint32_t>                                   jump_goto;                                                  // 0x0030   (0x0010)  
	FText                                              no_source_description;                                      // 0x0040   (0x0018)  
	uint32_t                                           ActiveStatus;                                               // 0x0058   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x005C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.SpeechConfTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FSpeechConfTableRow : FTableRowBase
{ 
	uint32_t                                           SpeechID;                                                   // 0x0008   (0x0004)  
	uint32_t                                           NPCID;                                                      // 0x000C   (0x0004)  
	TArray<uint32_t>                                   Npc_stage;                                                  // 0x0010   (0x0010)  
	uint32_t                                           SpeechType;                                                 // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	FText                                              SpeechText;                                                 // 0x0028   (0x0018)  
	TArray<uint32_t>                                   Level;                                                      // 0x0040   (0x0010)  
	uint32_t                                           QuestID;                                                    // 0x0050   (0x0004)  
	uint32_t                                           QspeechType;                                                // 0x0054   (0x0004)  
};

/// Struct /Script/UADataTableModule.SpecialGroupIdConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FSpecialGroupIdConfTableRow : FTableRowBase
{ 
	uint32_t                                           Kind;                                                       // 0x0008   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.SoundConfTableRow
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000050) align 8 pad: 0x0000
struct FSoundConfTableRow : FTableRowBase
{ 
	FName                                              sound_name;                                                 // 0x0008   (0x0008)  
	FText                                              chn_name;                                                   // 0x0010   (0x0018)  
	FText                                              desc;                                                       // 0x0028   (0x0018)  
	FString                                            sound_ak_event;                                             // 0x0040   (0x0010)  
};

/// Struct /Script/UADataTableModule.SkipTutorialTableRow
/// Size: 0x0060 (96 bytes) (0x000008 - 0x000068) align 8 pad: 0x0000
struct FSkipTutorialTableRow : FTableRowBase
{ 
	uint32_t                                           QuestionId;                                                 // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            Question;                                                   // 0x0010   (0x0010)  
	FString                                            Option1;                                                    // 0x0020   (0x0010)  
	FString                                            Option2;                                                    // 0x0030   (0x0010)  
	FString                                            Option3;                                                    // 0x0040   (0x0010)  
	FString                                            Option4;                                                    // 0x0050   (0x0010)  
	uint32_t                                           Answer;                                                     // 0x0060   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0064   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.SideClashConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FSideClashConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           show_type;                                                  // 0x000C   (0x0004)  
	FText                                              Content;                                                    // 0x0010   (0x0018)  
	uint32_t                                           per_unit_score;                                             // 0x0028   (0x0004)  
	uint32_t                                           Limit;                                                      // 0x002C   (0x0004)  
	uint32_t                                           win_condition;                                              // 0x0030   (0x0004)  
	uint32_t                                           win_coeff;                                                  // 0x0034   (0x0004)  
	uint32_t                                           lose_coeff;                                                 // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ShowExtendConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FShowExtendConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Lower_Price;                                                // 0x000C   (0x0004)  
	uint32_t                                           Upper_Price;                                                // 0x0010   (0x0004)  
	uint32_t                                           Lower_Extend;                                               // 0x0014   (0x0004)  
	uint32_t                                           Upper_Extend;                                               // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ShowDetailTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FShowDetailTableRow : FTableRowBase
{ 
	uint64_t                                           ItemID;                                                     // 0x0008   (0x0008)  
	uint32_t                                           ShowDetailType;                                             // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            ResourcePath;                                               // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.ShockConfTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FShockConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            ShockPath;                                                  // 0x0010   (0x0010)  
	float                                              Duration;                                                   // 0x0020   (0x0004)  
	uint32_t                                           Amplitude;                                                  // 0x0024   (0x0004)  
	float                                              CoolDownTime;                                               // 0x0028   (0x0004)  
	uint32_t                                           Default;                                                    // 0x002C   (0x0004)  
	uint32_t                                           Loop;                                                       // 0x0030   (0x0004)  
	uint32_t                                           Interval;                                                   // 0x0034   (0x0004)  
};

/// Struct /Script/UADataTableModule.ShareTextTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FShareTextTableRow : FTableRowBase
{ 
	uint64_t                                           ID;                                                         // 0x0008   (0x0008)  
	FText                                              Text;                                                       // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.ShareTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FShareTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              pic_desc;                                                   // 0x0010   (0x0018)  
	FString                                            pic;                                                        // 0x0028   (0x0010)  
};

/// Struct /Script/UADataTableModule.SetItemDuraConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FSetItemDuraConfTableRow : FTableRowBase
{ 
	uint32_t                                           is_npc;                                                     // 0x0008   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x000C   (0x0004)  
	uint32_t                                           class_id;                                                   // 0x0010   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x0014   (0x0004)  
	uint32_t                                           max_durability;                                             // 0x0018   (0x0004)  
	uint32_t                                           min_durabiliy;                                              // 0x001C   (0x0004)  
	uint32_t                                           max_real_durability;                                        // 0x0020   (0x0004)  
	uint32_t                                           min_real_durability;                                        // 0x0024   (0x0004)  
};

/// Struct /Script/UADataTableModule.ServerLimitConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FServerLimitConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<uint32_t>                                   hourly_refresh_time;                                        // 0x0010   (0x0010)  
	uint32_t                                           hourly_limit_num;                                           // 0x0020   (0x0004)  
	uint32_t                                           daily_limit_num;                                            // 0x0024   (0x0004)  
	uint32_t                                           weekly_limit_num;                                           // 0x0028   (0x0004)  
	uint32_t                                           monthly_limit_num;                                          // 0x002C   (0x0004)  
	uint32_t                                           season_limit_num;                                           // 0x0030   (0x0004)  
	uint32_t                                           permanent_limit_num;                                        // 0x0034   (0x0004)  
	uint32_t                                           num_type;                                                   // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ServerKey2TextTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FServerKey2TextTableRow : FTableRowBase
{ 
	FString                                            ServerKey;                                                  // 0x0008   (0x0010)  
	FText                                              ServerText;                                                 // 0x0018   (0x0018)  
};

/// Struct /Script/UADataTableModule.ServerInfoTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FServerInfoTableRow : FTableRowBase
{ 
	uint32_t                                           ServerCode;                                                 // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Describe;                                                   // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.SeasonShopConfTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FSeasonShopConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           sell_item_id;                                               // 0x000C   (0x0004)  
	uint32_t                                           sell_num;                                                   // 0x0010   (0x0004)  
	uint32_t                                           cost_num;                                                   // 0x0014   (0x0004)  
	uint32_t                                           buy_limit;                                                  // 0x0018   (0x0004)  
	uint32_t                                           buy_limit_season;                                           // 0x001C   (0x0004)  
	uint32_t                                           ranked_Level;                                               // 0x0020   (0x0004)  
	uint32_t                                           bind_season;                                                // 0x0024   (0x0004)  
	FDateTime                                          unlock_time;                                                // 0x0028   (0x0008)  
	uint32_t                                           sort_param;                                                 // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.SeasonPublicityTableRow
/// Size: 0x0088 (136 bytes) (0x000008 - 0x000090) align 8 pad: 0x0000
struct FSeasonPublicityTableRow : FTableRowBase
{ 
	uint32_t                                           info_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           info_type;                                                  // 0x000C   (0x0004)  
	FString                                            info_picture;                                               // 0x0010   (0x0010)  
	FText                                              info_big_title;                                             // 0x0020   (0x0018)  
	FText                                              info_small_title;                                           // 0x0038   (0x0018)  
	FText                                              info_describe1;                                             // 0x0050   (0x0018)  
	FText                                              info_describe2;                                             // 0x0068   (0x0018)  
	FString                                            info_path;                                                  // 0x0080   (0x0010)  
};

/// Struct /Script/UADataTableModule.ScreenEffectPaddingTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FScreenEffectPaddingTableRow : FTableRowBase
{ 
	FString                                            AssetName;                                                  // 0x0008   (0x0010)  
	float                                              Left;                                                       // 0x0018   (0x0004)  
	float                                              Top;                                                        // 0x001C   (0x0004)  
	float                                              Right;                                                      // 0x0020   (0x0004)  
	float                                              Bottom;                                                     // 0x0024   (0x0004)  
	float                                              MarginLeft;                                                 // 0x0028   (0x0004)  
	float                                              MarginTop;                                                  // 0x002C   (0x0004)  
	float                                              MarginRight;                                                // 0x0030   (0x0004)  
	float                                              MarginBottom;                                               // 0x0034   (0x0004)  
};

/// Struct /Script/UADataTableModule.WeaponScopeScale
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 pad: 0x0000
struct FWeaponScopeScale
{ 
	uint64_t                                           ID;                                                         // 0x0000   (0x0008)  
	FText                                              WeaponName;                                                 // 0x0008   (0x0018)  
	float                                              RoScale;                                                    // 0x0020   (0x0004)  
	float                                              LoScale;                                                    // 0x0024   (0x0004)  
	float                                              ADSGunKickScale;                                            // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ScopeScaleConfigTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FScopeScaleConfigTableRow : FTableRowBase
{ 
	uint64_t                                           ID;                                                         // 0x0008   (0x0008)  
	TArray<FWeaponScopeScale>                          WeaponScopeScale;                                           // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.Scheme703060006TableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FScheme703060006TableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Vest;                                                       // 0x000C   (0x0004)  
	uint32_t                                           Armor;                                                      // 0x0010   (0x0004)  
	uint32_t                                           Backpack;                                                   // 0x0014   (0x0004)  
	uint32_t                                           Helmet;                                                     // 0x0018   (0x0004)  
	uint32_t                                           Visor;                                                      // 0x001C   (0x0004)  
	uint32_t                                           Headset;                                                    // 0x0020   (0x0004)  
	uint32_t                                           Mask;                                                       // 0x0024   (0x0004)  
};

/// Struct /Script/UADataTableModule.Scheme703060005TableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FScheme703060005TableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Vest;                                                       // 0x000C   (0x0004)  
	uint32_t                                           Armor;                                                      // 0x0010   (0x0004)  
	uint32_t                                           Backpack;                                                   // 0x0014   (0x0004)  
	uint32_t                                           Helmet;                                                     // 0x0018   (0x0004)  
	uint32_t                                           Visor;                                                      // 0x001C   (0x0004)  
	uint32_t                                           Headset;                                                    // 0x0020   (0x0004)  
	uint32_t                                           Mask;                                                       // 0x0024   (0x0004)  
};

/// Struct /Script/UADataTableModule.Scheme703060004TableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FScheme703060004TableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Vest;                                                       // 0x000C   (0x0004)  
	uint32_t                                           Armor;                                                      // 0x0010   (0x0004)  
	uint32_t                                           Backpack;                                                   // 0x0014   (0x0004)  
	uint32_t                                           Helmet;                                                     // 0x0018   (0x0004)  
	uint32_t                                           Visor;                                                      // 0x001C   (0x0004)  
	uint32_t                                           Headset;                                                    // 0x0020   (0x0004)  
	uint32_t                                           Mask;                                                       // 0x0024   (0x0004)  
};

/// Struct /Script/UADataTableModule.Scheme703060003TableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FScheme703060003TableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Vest;                                                       // 0x000C   (0x0004)  
	uint32_t                                           Armor;                                                      // 0x0010   (0x0004)  
	uint32_t                                           Backpack;                                                   // 0x0014   (0x0004)  
	uint32_t                                           Helmet;                                                     // 0x0018   (0x0004)  
	uint32_t                                           Visor;                                                      // 0x001C   (0x0004)  
	uint32_t                                           Headset;                                                    // 0x0020   (0x0004)  
	uint32_t                                           Mask;                                                       // 0x0024   (0x0004)  
};

/// Struct /Script/UADataTableModule.Scheme703060002TableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FScheme703060002TableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Vest;                                                       // 0x000C   (0x0004)  
	uint32_t                                           Armor;                                                      // 0x0010   (0x0004)  
	uint32_t                                           Backpack;                                                   // 0x0014   (0x0004)  
	uint32_t                                           Helmet;                                                     // 0x0018   (0x0004)  
	uint32_t                                           Visor;                                                      // 0x001C   (0x0004)  
	uint32_t                                           Headset;                                                    // 0x0020   (0x0004)  
	uint32_t                                           Mask;                                                       // 0x0024   (0x0004)  
};

/// Struct /Script/UADataTableModule.Scheme703060001TableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FScheme703060001TableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Vest;                                                       // 0x000C   (0x0004)  
	uint32_t                                           Armor;                                                      // 0x0010   (0x0004)  
	uint32_t                                           Backpack;                                                   // 0x0014   (0x0004)  
	uint32_t                                           Helmet;                                                     // 0x0018   (0x0004)  
	uint32_t                                           Visor;                                                      // 0x001C   (0x0004)  
	uint32_t                                           Headset;                                                    // 0x0020   (0x0004)  
	uint32_t                                           Mask;                                                       // 0x0024   (0x0004)  
};

/// Struct /Script/UADataTableModule.ScavScoreMappingTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FScavScoreMappingTableRow : FTableRowBase
{ 
	int32_t                                            Score;                                                      // 0x0008   (0x0004)  
	int32_t                                            group_id;                                                   // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.ScavScoreConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FScavScoreConfTableRow : FTableRowBase
{ 
	uint32_t                                           score_id;                                                   // 0x0008   (0x0004)  
	int32_t                                            Value;                                                      // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.ScavExpFactorTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FScavExpFactorTableRow : FTableRowBase
{ 
	FString                                            ID;                                                         // 0x0008   (0x0010)  
	uint32_t                                           Factor;                                                     // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ExtEquipConf
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 pad: 0x0000
struct FExtEquipConf
{ 
	uint32_t                                           ID;                                                         // 0x0000   (0x0004)  
	uint32_t                                           Type;                                                       // 0x0004   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0008   (0x0004)  
};

/// Struct /Script/UADataTableModule.ScavEquipConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FScavEquipConfTableRow : FTableRowBase
{ 
	uint32_t                                           is_npc;                                                     // 0x0008   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x000C   (0x0004)  
	uint32_t                                           class_id;                                                   // 0x0010   (0x0004)  
	uint32_t                                           slot_index;                                                 // 0x0014   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x0018   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x001C   (0x0004)  
	TArray<FExtEquipConf>                              exts;                                                       // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.CntrItemConf
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 pad: 0x0000
struct FCntrItemConf
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
	uint32_t                                           min_dura;                                                   // 0x0008   (0x0004)  
	uint32_t                                           max_dura;                                                   // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.ScavContainerConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FScavContainerConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x000C   (0x0004)  
	TArray<FCntrItemConf>                              Items;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.ScavAIDynamicLimitTableRow
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000048) align 8 pad: 0x0000
struct FScavAIDynamicLimitTableRow : FTableRowBase
{ 
	int32_t                                            ConfigID;                                                   // 0x0008   (0x0004)  
	int32_t                                            MapID;                                                      // 0x000C   (0x0004)  
	TArray<int32_t>                                    AISpawnConfigID;                                            // 0x0010   (0x0010)  
	int32_t                                            eventId;                                                    // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	TArray<float>                                      Weather;                                                    // 0x0028   (0x0010)  
	int32_t                                            ExpectedPMCPlayerNum;                                       // 0x0038   (0x0004)  
	float                                              ScavAIDynamicLimitStartTime;                                // 0x003C   (0x0004)  
	int32_t                                            ScavLimitPerPMCPlayer;                                      // 0x0040   (0x0004)  
	int32_t                                            ScavLimitBase;                                              // 0x0044   (0x0004)  
};

/// Struct /Script/UADataTableModule.LimitPoolConf
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 4 pad: 0x0000
struct FLimitPoolConf
{ 
	uint32_t                                           shield_type;                                                // 0x0000   (0x0004)  
	uint32_t                                           sub_item_id;                                                // 0x0004   (0x0004)  
	uint32_t                                           sub_item_num;                                               // 0x0008   (0x0004)  
	uint32_t                                           Probability;                                                // 0x000C   (0x0004)  
	uint32_t                                           pool_id;                                                    // 0x0010   (0x0004)  
};

/// Struct /Script/UADataTableModule.SafeLootLimitTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FSafeLootLimitTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FLimitPoolConf>                             PoolLists;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.SafeBoxConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FSafeBoxConfTableRow : FTableRowBase
{ 
	uint32_t                                           container_id;                                               // 0x0008   (0x0004)  
	uint32_t                                           show_index;                                                 // 0x000C   (0x0004)  
	uint32_t                                           day_price;                                                  // 0x0010   (0x0004)  
	uint32_t                                           is_hidden;                                                  // 0x0014   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x0018   (0x0004)  
	uint32_t                                           is_time;                                                    // 0x001C   (0x0004)  
	FText                                              list_desc;                                                  // 0x0020   (0x0018)  
	uint32_t                                           jump_goto;                                                  // 0x0038   (0x0004)  
	uint32_t                                           price;                                                      // 0x003C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RookirTriggerSummaryConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FRookirTriggerSummaryConfTableRow : FTableRowBase
{ 
	uint32_t                                           trigger_id;                                                 // 0x0008   (0x0004)  
	uint32_t                                           repetition_allowed;                                         // 0x000C   (0x0004)  
	FText                                              desc;                                                       // 0x0010   (0x0018)  
	TArray<uint32_t>                                   check_play_mode;                                            // 0x0028   (0x0010)  
	uint32_t                                           trigger_level;                                              // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RookieTriggerTypeConfTableRow
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000060) align 8 pad: 0x0000
struct FRookieTriggerTypeConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           season_clear;                                               // 0x000C   (0x0004)  
	uint32_t                                           trigger_id;                                                 // 0x0010   (0x0004)  
	uint32_t                                           rookieTriggerType;                                          // 0x0014   (0x0004)  
	TArray<uint64_t>                                   ItemID;                                                     // 0x0018   (0x0010)  
	TArray<uint32_t>                                   tagid;                                                      // 0x0028   (0x0010)  
	uint32_t                                           traderid;                                                   // 0x0038   (0x0004)  
	uint32_t                                           AttachType;                                                 // 0x003C   (0x0004)  
	uint32_t                                           Priority;                                                   // 0x0040   (0x0004)  
	uint32_t                                           triggertimes;                                               // 0x0044   (0x0004)  
	uint32_t                                           cdtimes;                                                    // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x004C   (0x0004)  MISSED
	TArray<uint32_t>                                   List;                                                       // 0x0050   (0x0010)  
};

/// Struct /Script/UADataTableModule.RookieTriggerIdConfTableRow
/// Size: 0x0068 (104 bytes) (0x000008 - 0x000070) align 8 pad: 0x0000
struct FRookieTriggerIdConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           season_clear;                                               // 0x000C   (0x0004)  
	uint32_t                                           trigger_id;                                                 // 0x0010   (0x0004)  
	uint32_t                                           trigger_type;                                               // 0x0014   (0x0004)  
	uint32_t                                           is_pop_after_unlock;                                        // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	TArray<uint64_t>                                   cond_value;                                                 // 0x0020   (0x0010)  
	TArray<uint32_t>                                   extra_param;                                                // 0x0030   (0x0010)  
	char                                               trigger_level;                                              // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0041   (0x0003)  MISSED
	uint32_t                                           Priority;                                                   // 0x0044   (0x0004)  
	uint32_t                                           triggertimes;                                               // 0x0048   (0x0004)  
	uint32_t                                           cdtimes;                                                    // 0x004C   (0x0004)  
	FString                                            trigger_panel;                                              // 0x0050   (0x0010)  
	TArray<uint32_t>                                   List;                                                       // 0x0060   (0x0010)  
};

/// Struct /Script/UADataTableModule.TriggerRookieItem
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FTriggerRookieItem
{ 
	uint32_t                                           ID;                                                         // 0x0000   (0x0004)  
	uint32_t                                           break_jump;                                                 // 0x0004   (0x0004)  
	TArray<uint32_t>                                   get_itemid;                                                 // 0x0008   (0x0010)  
	uint32_t                                           ItemID;                                                     // 0x0018   (0x0004)  
	uint32_t                                           trade_id;                                                   // 0x001C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RookieTriggerConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FRookieTriggerConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           arg;                                                        // 0x000C   (0x0004)  
	uint32_t                                           season_clear;                                               // 0x0010   (0x0004)  
	uint32_t                                           trigger_id;                                                 // 0x0014   (0x0004)  
	uint32_t                                           trigger_type;                                               // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	uint64_t                                           cond_value;                                                 // 0x0020   (0x0008)  
	uint32_t                                           sys_id;                                                     // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<FTriggerRookieItem>                         List;                                                       // 0x0030   (0x0010)  
};

/// Struct /Script/UADataTableModule.RookieTraderUnlockConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRookieTraderUnlockConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           traderid;                                                   // 0x000C   (0x0004)  
	uint32_t                                           season_clear;                                               // 0x0010   (0x0004)  
	uint32_t                                           trigger_id;                                                 // 0x0014   (0x0004)  
	TArray<uint32_t>                                   List;                                                       // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.RookieTaskDoneConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FRookieTaskDoneConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           TaskId;                                                     // 0x000C   (0x0004)  
	uint32_t                                           season_clear;                                               // 0x0010   (0x0004)  
	uint32_t                                           trigger_id;                                                 // 0x0014   (0x0004)  
	uint32_t                                           State;                                                      // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	TArray<uint32_t>                                   List;                                                       // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.RookieStepConfTableRow
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000060) align 8 pad: 0x0000
struct FRookieStepConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           pre_taskid;                                                 // 0x000C   (0x0004)  
	uint32_t                                           forceguildtype;                                             // 0x0010   (0x0004)  
	uint32_t                                           jump_id;                                                    // 0x0014   (0x0004)  
	uint32_t                                           break_jump;                                                 // 0x0018   (0x0004)  
	uint32_t                                           protected_jump;                                             // 0x001C   (0x0004)  
	uint32_t                                           is_effective;                                               // 0x0020   (0x0004)  
	uint32_t                                           is_repeatable;                                              // 0x0024   (0x0004)  
	TArray<uint32_t>                                   get_itemid;                                                 // 0x0028   (0x0010)  
	uint32_t                                           ItemID;                                                     // 0x0038   (0x0004)  
	uint32_t                                           trade_id;                                                   // 0x003C   (0x0004)  
	TArray<uint32_t>                                   block_action;                                               // 0x0040   (0x0010)  
	TArray<uint32_t>                                   tips_list;                                                  // 0x0050   (0x0010)  
};

/// Struct /Script/UADataTableModule.RookieSendItemBackConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FRookieSendItemBackConfTableRow : FTableRowBase
{ 
	uint32_t                                           item_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           Num;                                                        // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RookieMailReceiveConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRookieMailReceiveConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           mailType;                                                   // 0x000C   (0x0004)  
	uint32_t                                           season_clear;                                               // 0x0010   (0x0004)  
	uint32_t                                           trigger_id;                                                 // 0x0014   (0x0004)  
	TArray<uint32_t>                                   List;                                                       // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.RookieItemPickConfTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FRookieItemPickConfTableRow : FTableRowBase
{ 
	uint32_t                                           ItemIdIndex;                                                // 0x0008   (0x0004)  
	uint32_t                                           season_clear;                                               // 0x000C   (0x0004)  
	uint32_t                                           trigger_id;                                                 // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	TArray<uint64_t>                                   itemIdAndType;                                              // 0x0018   (0x0010)  
	uint32_t                                           classifytype;                                               // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<uint32_t>                                   takescope;                                                  // 0x0030   (0x0010)  
	uint32_t                                           triggertimes;                                               // 0x0040   (0x0004)  
	uint32_t                                           cdtimes;                                                    // 0x0044   (0x0004)  
	TArray<uint32_t>                                   List;                                                       // 0x0048   (0x0010)  
};

/// Struct /Script/UADataTableModule.RookieGunCheckConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRookieGunCheckConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	uint64_t                                           ItemID;                                                     // 0x0010   (0x0008)  
	TArray<uint32_t>                                   List;                                                       // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.RookieDetailConfTableRow
/// Size: 0x0190 (400 bytes) (0x000008 - 0x000198) align 8 pad: 0x0000
struct FRookieDetailConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Type;                                                       // 0x000C   (0x0004)  
	FText                                              desc;                                                       // 0x0010   (0x0018)  
	FText                                              desc1;                                                      // 0x0028   (0x0018)  
	uint32_t                                           subtype;                                                    // 0x0040   (0x0004)  
	float                                              positionX;                                                  // 0x0044   (0x0004)  
	float                                              positionY;                                                  // 0x0048   (0x0004)  
	float                                              SizeX;                                                      // 0x004C   (0x0004)  
	float                                              SizeY;                                                      // 0x0050   (0x0004)  
	float                                              offsetX;                                                    // 0x0054   (0x0004)  
	uint32_t                                           unloadchecktype;                                            // 0x0058   (0x0004)  
	uint32_t                                           AttachType;                                                 // 0x005C   (0x0004)  
	uint32_t                                           CheckCondition;                                             // 0x0060   (0x0004)  
	float                                              EffectScale;                                                // 0x0064   (0x0004)  
	uint32_t                                           buttonSizeX;                                                // 0x0068   (0x0004)  
	uint32_t                                           buttonSizeY;                                                // 0x006C   (0x0004)  
	FString                                            panelName;                                                  // 0x0070   (0x0010)  
	uint32_t                                           TaskId;                                                     // 0x0080   (0x0004)  
	uint32_t                                           businessId;                                                 // 0x0084   (0x0004)  
	uint32_t                                           classifyId;                                                 // 0x0088   (0x0004)  
	uint32_t                                           warehousesubid;                                             // 0x008C   (0x0004)  
	uint32_t                                           prepareid;                                                  // 0x0090   (0x0004)  
	uint32_t                                           prepareTab;                                                 // 0x0094   (0x0004)  
	uint32_t                                           mapRuleType;                                                // 0x0098   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x009C   (0x0004)  MISSED
	FString                                            btnName;                                                    // 0x00A0   (0x0010)  
	uint32_t                                           itemSpaceType;                                              // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00B4   (0x0004)  MISSED
	FString                                            waitPanelName;                                              // 0x00B8   (0x0010)  
	FString                                            backPanelName;                                              // 0x00C8   (0x0010)  
	FString                                            waitSubPanelName;                                           // 0x00D8   (0x0010)  
	FString                                            waitClosePanelName;                                         // 0x00E8   (0x0010)  
	uint64_t                                           dragItemid;                                                 // 0x00F8   (0x0008)  
	uint64_t                                           ParentID;                                                   // 0x0100   (0x0008)  
	uint32_t                                           movieid;                                                    // 0x0108   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x010C   (0x0004)  MISSED
	TArray<uint32_t>                                   pptid;                                                      // 0x0110   (0x0010)  
	uint32_t                                           pptemptyclose;                                              // 0x0120   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0124   (0x0004)  MISSED
	FText                                              DisplayName;                                                // 0x0128   (0x0018)  
	uint32_t                                           displayType;                                                // 0x0140   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x0144   (0x0004)  MISSED
	FString                                            sound_name;                                                 // 0x0148   (0x0010)  
	uint32_t                                           attachCheckType;                                            // 0x0158   (0x0004)  
	uint32_t                                           passCheck;                                                  // 0x015C   (0x0004)  
	FText                                              floatTitle;                                                 // 0x0160   (0x0018)  
	TArray<FText>                                      floatContent;                                               // 0x0178   (0x0010)  
	uint32_t                                           isfloating;                                                 // 0x0188   (0x0004)  
	uint32_t                                           isShowpromptly;                                             // 0x018C   (0x0004)  
	uint32_t                                           talkcharacter;                                              // 0x0190   (0x0004)  
	uint32_t                                           scrollAttachType;                                           // 0x0194   (0x0004)  
};

/// Struct /Script/UADataTableModule.RoleIdentityConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRoleIdentityConfTableRow : FTableRowBase
{ 
	uint32_t                                           IdentityId;                                                 // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Describe;                                                   // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.RobotNamePoolTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRobotNamePoolTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Group;                                                      // 0x000C   (0x0004)  
	FText                                              Name;                                                       // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.BlackItemConf
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 pad: 0x0000
struct FBlackItemConf
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0004   (0x0004)  
	uint32_t                                           is_black;                                                   // 0x0008   (0x0004)  
};

/// Struct /Script/UADataTableModule.RewardsConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FRewardsConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FBlackItemConf>                             rewards;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.RewardShareConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRewardShareConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<uint32_t>                                   avatar_set;                                                 // 0x0010   (0x0010)  
	uint32_t                                           is_after;                                                   // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ResourceTypeIconConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FResourceTypeIconConfTableRow : FTableRowBase
{ 
	uint32_t                                           typeId;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            icon;                                                       // 0x0010   (0x0010)  
	uint32_t                                           IsDefault;                                                  // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ResourceListConfTableRow
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000050) align 8 pad: 0x0000
struct FResourceListConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	FString                                            icon;                                                       // 0x0028   (0x0010)  
	char                                               rare;                                                       // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0039   (0x0007)  MISSED
	TArray<uint32_t>                                   typeId;                                                     // 0x0040   (0x0010)  
};

/// Struct /Script/UADataTableModule.ResourceAreaConfTableRow
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000050) align 8 pad: 0x0000
struct FResourceAreaConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           MapID;                                                      // 0x000C   (0x0004)  
	uint32_t                                           tagid;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FText                                              TagName;                                                    // 0x0018   (0x0018)  
	uint32_t                                           MapVolumeId;                                                // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	TArray<uint32_t>                                   ShowLootVolumeId;                                           // 0x0038   (0x0010)  
	uint32_t                                           IsShowAll;                                                  // 0x0048   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.ReportReasonConfTableRow
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000050) align 8 pad: 0x0000
struct FReportReasonConfTableRow : FTableRowBase
{ 
	uint32_t                                           reason_id;                                                  // 0x0008   (0x0004)  
	uint32_t                                           Category;                                                   // 0x000C   (0x0004)  
	TArray<uint32_t>                                   use_scene;                                                  // 0x0010   (0x0010)  
	FText                                              Content;                                                    // 0x0020   (0x0018)  
	FText                                              desc;                                                       // 0x0038   (0x0018)  
};

/// Struct /Script/UADataTableModule.RepairMaterialConfTableRow
/// Size: 0x0088 (136 bytes) (0x000008 - 0x000090) align 8 pad: 0x0000
struct FRepairMaterialConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              material_name;                                              // 0x0010   (0x0018)  
	float                                              low_repair_coef;                                            // 0x0028   (0x0004)  
	float                                              low_tech_coef;                                              // 0x002C   (0x0004)  
	TArray<uint32_t>                                   low_repair_businessman_ids;                                 // 0x0030   (0x0010)  
	float                                              mid_repair_coef;                                            // 0x0040   (0x0004)  
	float                                              mid_tech_coef;                                              // 0x0044   (0x0004)  
	TArray<uint32_t>                                   mid_repair_businessman_ids;                                 // 0x0048   (0x0010)  
	float                                              high_repair_coef;                                           // 0x0058   (0x0004)  
	float                                              high_tech_coef;                                             // 0x005C   (0x0004)  
	TArray<uint32_t>                                   high_repair_businessman_ids;                                // 0x0060   (0x0010)  
	float                                              unit_repair_price_coef;                                     // 0x0070   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0074   (0x0004)  MISSED
	FText                                              repairability;                                              // 0x0078   (0x0018)  
};

/// Struct /Script/UADataTableModule.DurabilityPriceConf
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FDurabilityPriceConf
{ 
	uint32_t                                           armor_level;                                                // 0x0000   (0x0004)  
	uint32_t                                           durability_price;                                           // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.RepairDurabilityConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FRepairDurabilityConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FDurabilityPriceConf>                       durability_price_conf;                                      // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.RegistWhiteListConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FRegistWhiteListConfTableRow : FTableRowBase
{ 
	uint64_t                                           GOpenID;                                                    // 0x0008   (0x0008)  
	uint32_t                                           ignore_open;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RegistLimitConfTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FRegistLimitConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FDateTime                                          begin_time;                                                 // 0x0010   (0x0008)  
	FDateTime                                          end_time;                                                   // 0x0018   (0x0008)  
	uint32_t                                           qq_total;                                                   // 0x0020   (0x0004)  
	uint32_t                                           qq_ios;                                                     // 0x0024   (0x0004)  
	uint32_t                                           qq_adroid;                                                  // 0x0028   (0x0004)  
	uint32_t                                           wx_total;                                                   // 0x002C   (0x0004)  
	uint32_t                                           wx_ios;                                                     // 0x0030   (0x0004)  
	uint32_t                                           wx_adroid;                                                  // 0x0034   (0x0004)  
};

/// Struct /Script/UADataTableModule.RegistEquipConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FRegistEquipConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Index;                                                      // 0x000C   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x0010   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0014   (0x0004)  
	uint32_t                                           is_black;                                                   // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	TArray<FBlackItemConf>                             Items;                                                      // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.RegionConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FRegionConfTableRow : FTableRowBase
{ 
	uint32_t                                           Region;                                                     // 0x0008   (0x0004)  
	uint32_t                                           Open;                                                       // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RedPointConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRedPointConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Type;                                                       // 0x000C   (0x0004)  
	TArray<uint32_t>                                   sub_id;                                                     // 0x0010   (0x0010)  
	uint32_t                                           is_external;                                                // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RedPacketConfTableRow
/// Size: 0x00C8 (200 bytes) (0x000008 - 0x0000D0) align 8 pad: 0x0000
struct FRedPacketConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           daily_limit;                                                // 0x000C   (0x0004)  
	FDateTime                                          start_time;                                                 // 0x0010   (0x0008)  
	FDateTime                                          end_time;                                                   // 0x0018   (0x0008)  
	FString                                            red_packet_pic;                                             // 0x0020   (0x0010)  
	uint32_t                                           show_pop_up;                                                // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	FString                                            ntf_pic;                                                    // 0x0038   (0x0010)  
	FString                                            show_title;                                                 // 0x0048   (0x0010)  
	FString                                            show_tips;                                                  // 0x0058   (0x0010)  
	FString                                            show_button;                                                // 0x0068   (0x0010)  
	uint32_t                                           show_win;                                                   // 0x0078   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x007C   (0x0004)  MISSED
	FString                                            des_win;                                                    // 0x0080   (0x0010)  
	FString                                            jump_win;                                                   // 0x0090   (0x0010)  
	FString                                            Tips;                                                       // 0x00A0   (0x0010)  
	FString                                            msg_title;                                                  // 0x00B0   (0x0010)  
	FString                                            msg_content;                                                // 0x00C0   (0x0010)  
};

/// Struct /Script/UADataTableModule.RechargeConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FRechargeConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           recharge_money;                                             // 0x000C   (0x0004)  
	uint32_t                                           recharge_reward;                                            // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RankedWeekRewardConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRankedWeekRewardConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Level;                                                      // 0x000C   (0x0004)  
	uint32_t                                           active_point;                                               // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	TArray<FCommonItemConfItem>                        rewards;                                                    // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.RankedTopRankRewardConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRankedTopRankRewardConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           start_rank;                                                 // 0x000C   (0x0004)  
	uint32_t                                           end_rank;                                                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	TArray<FCommonItemConfItem>                        rewards;                                                    // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.RankedTeamScoreConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FRankedTeamScoreConfTableRow : FTableRowBase
{ 
	uint32_t                                           Rank;                                                       // 0x0008   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RankedSettleScoreConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FRankedSettleScoreConfTableRow : FTableRowBase
{ 
	uint32_t                                           Level;                                                      // 0x0008   (0x0004)  
	uint32_t                                           kill_pmc_score_limit;                                       // 0x000C   (0x0004)  
	uint32_t                                           kill_scav_score_limit;                                      // 0x0010   (0x0004)  
	uint32_t                                           loot_value_score_limit;                                     // 0x0014   (0x0004)  
	uint32_t                                           loot_times_score_limit;                                     // 0x0018   (0x0004)  
	uint32_t                                           survial_score_limit;                                        // 0x001C   (0x0004)  
	int32_t                                            penalty_score;                                              // 0x0020   (0x0004)  
	int32_t                                            chall_coin_factor;                                          // 0x0024   (0x0004)  
	int32_t                                            chall_coin_bonus;                                           // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RankedSeasonRewardConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FRankedSeasonRewardConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FCommonItemConfItem>                        rewards;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.RankedSeasonConfTableRow
/// Size: 0x0070 (112 bytes) (0x000008 - 0x000078) align 8 pad: 0x0000
struct FRankedSeasonConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FDateTime                                          begin_time;                                                 // 0x0010   (0x0008)  
	FDateTime                                          warmup_end_time;                                            // 0x0018   (0x0008)  
	FDateTime                                          end_time;                                                   // 0x0020   (0x0008)  
	FDateTime                                          carnival_end_time;                                          // 0x0028   (0x0008)  
	FDateTime                                          season_end_time;                                            // 0x0030   (0x0008)  
	FText                                              desc;                                                       // 0x0038   (0x0018)  
	uint32_t                                           is_delay_start;                                             // 0x0050   (0x0004)  
	uint32_t                                           show_season_id;                                             // 0x0054   (0x0004)  
	uint32_t                                           season_reward_base;                                         // 0x0058   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	FDateTime                                          countdown_time;                                             // 0x0060   (0x0008)  
	uint32_t                                           bp_lv_award_group_id;                                       // 0x0068   (0x0004)  
	uint32_t                                           ranked_lv_award_group_id;                                   // 0x006C   (0x0004)  
	uint32_t                                           badge_group_id;                                             // 0x0070   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x0074   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RankedRankingFactorConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FRankedRankingFactorConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           is_win;                                                     // 0x000C   (0x0004)  
	uint32_t                                           is_season_ranking_low;                                      // 0x0010   (0x0004)  
	uint32_t                                           ranking_diff;                                               // 0x0014   (0x0004)  
	uint32_t                                           ranking_m_factor;                                           // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RankedRankingConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FRankedRankingConfTableRow : FTableRowBase
{ 
	uint32_t                                           conf_type;                                                  // 0x0008   (0x0004)  
	int32_t                                            Val;                                                        // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RankedRankingBackConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FRankedRankingBackConfTableRow : FTableRowBase
{ 
	uint32_t                                           lower;                                                      // 0x0008   (0x0004)  
	uint32_t                                           upper;                                                      // 0x000C   (0x0004)  
	uint32_t                                           new_ranking;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RankedMapConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FRankedMapConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FDateTime                                          begin_time;                                                 // 0x0010   (0x0008)  
	FDateTime                                          end_time;                                                   // 0x0018   (0x0008)  
	TArray<uint32_t>                                   ranked_map_list;                                            // 0x0020   (0x0010)  
	TArray<uint32_t>                                   factor_list;                                                // 0x0030   (0x0010)  
};

/// Struct /Script/UADataTableModule.RankedLevelRangeConfTableRow
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000048) align 8 pad: 0x0000
struct FRankedLevelRangeConfTableRow : FTableRowBase
{ 
	uint32_t                                           rangeid;                                                    // 0x0008   (0x0004)  
	uint32_t                                           rangecount;                                                 // 0x000C   (0x0004)  
	uint32_t                                           StageId;                                                    // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FText                                              main_name;                                                  // 0x0018   (0x0018)  
	FText                                              sub_name;                                                   // 0x0030   (0x0018)  
};

/// Struct /Script/UADataTableModule.RankedLevelConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FRankedLevelConfTableRow : FTableRowBase
{ 
	uint32_t                                           Level;                                                      // 0x0008   (0x0004)  
	uint32_t                                           upgrade_score;                                              // 0x000C   (0x0004)  
	FText                                              TitleDesc;                                                  // 0x0010   (0x0018)  
	uint32_t                                           ranking_k_factor;                                           // 0x0028   (0x0004)  
	uint32_t                                           icon;                                                       // 0x002C   (0x0004)  
	uint32_t                                           nextseason_level;                                           // 0x0030   (0x0004)  
	uint32_t                                           dogtag_itemid;                                              // 0x0034   (0x0004)  
	uint32_t                                           ranked_level_type;                                          // 0x0038   (0x0004)  
	uint32_t                                           price;                                                      // 0x003C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RankedLevelAwardConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FRankedLevelAwardConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x000C   (0x0004)  
	uint32_t                                           Level;                                                      // 0x0010   (0x0004)  
	uint32_t                                           task_rw_id;                                                 // 0x0014   (0x0004)  
	uint32_t                                           task_rw_num;                                                // 0x0018   (0x0004)  
	uint32_t                                           task_show_type;                                             // 0x001C   (0x0004)  
	uint32_t                                           task_show_main;                                             // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RankedLeaderboardSaleConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FRankedLeaderboardSaleConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           lowindex;                                                   // 0x000C   (0x0004)  
	uint32_t                                           Ratio;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.RankedKillScoreConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FRankedKillScoreConfTableRow : FTableRowBase
{ 
	int32_t                                            ranked_level_diff;                                          // 0x0008   (0x0004)  
	int32_t                                            bonus_score;                                                // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RankedHistoryInfoConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FRankedHistoryInfoConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              field_text;                                                 // 0x0010   (0x0018)  
	FString                                            Field;                                                      // 0x0028   (0x0010)  
	uint32_t                                           Type;                                                       // 0x0038   (0x0004)  
	uint32_t                                           Priority;                                                   // 0x003C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RankedCommonConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FRankedCommonConfTableRow : FTableRowBase
{ 
	uint32_t                                           Ranked_conf_type;                                           // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            Val;                                                        // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.RankedBoxConfTableRow
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000038) align 8 pad: 0x0000
struct FRankedBoxConfTableRow : FTableRowBase
{ 
	uint32_t                                           item_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           Level;                                                      // 0x000C   (0x0004)  
	uint32_t                                           equip_num;                                                  // 0x0010   (0x0004)  
	uint32_t                                           def_num;                                                    // 0x0014   (0x0004)  
	uint32_t                                           use_num;                                                    // 0x0018   (0x0004)  
	uint32_t                                           etc_num;                                                    // 0x001C   (0x0004)  
	FText                                              desc;                                                       // 0x0020   (0x0018)  
};

/// Struct /Script/UADataTableModule.RandomForgeConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FRandomForgeConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Val;                                                        // 0x000C   (0x0004)  
	TArray<uint32_t>                                   ary;                                                        // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.RandClassConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FRandClassConfTableRow : FTableRowBase
{ 
	uint32_t                                           is_npc;                                                     // 0x0008   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x000C   (0x0004)  
	uint32_t                                           class_id;                                                   // 0x0010   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x0014   (0x0004)  
	uint32_t                                           weapon_comb_type;                                           // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.QuickSortContainerPriorityTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FQuickSortContainerPriorityTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Priority;                                                   // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.RefreshCostVec
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FRefreshCostVec
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<uint32_t>                                   cost_num_array;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/UADataTableModule.EnterCostVec
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FEnterCostVec
{ 
	uint32_t                                           item_id;                                                    // 0x0000   (0x0004)  
	uint32_t                                           cost_num;                                                   // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.QuickModeRefreshCostConfTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FQuickModeRefreshCostConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           map_mode_id;                                                // 0x000C   (0x0004)  
	uint32_t                                           index_id;                                                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FText                                              index_name;                                                 // 0x0018   (0x0018)  
	TArray<FRefreshCostVec>                            refresh_cost_vec;                                           // 0x0030   (0x0010)  
	TArray<FEnterCostVec>                              enter_cost_vec;                                             // 0x0040   (0x0010)  
	uint32_t                                           refresh_group_id;                                           // 0x0050   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0054   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.QuickGiveConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FQuickGiveConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           sell_item_id;                                               // 0x000C   (0x0004)  
	uint32_t                                           exchange_item_id;                                           // 0x0010   (0x0004)  
	uint32_t                                           exchange_num;                                               // 0x0014   (0x0004)  
};

/// Struct /Script/UADataTableModule.QuickChatDataStaticsTableRow
/// Size: 0x0088 (136 bytes) (0x000008 - 0x000090) align 8 pad: 0x0000
struct FQuickChatDataStaticsTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Key;                                                        // 0x0010   (0x0018)  
	FText                                              BattleInfoTable;                                            // 0x0028   (0x0018)  
	FText                                              BattleInfoCalculate;                                        // 0x0040   (0x0018)  
	FText                                              Format;                                                     // 0x0058   (0x0018)  
	FText                                              Operation;                                                  // 0x0070   (0x0018)  
	uint32_t                                           Factor;                                                     // 0x0088   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x008C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.QuickChatTableRow
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000048) align 8 pad: 0x0000
struct FQuickChatTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Content;                                                    // 0x0010   (0x0018)  
	uint32_t                                           isLeader;                                                   // 0x0028   (0x0004)  
	uint32_t                                           isBattleInfo;                                               // 0x002C   (0x0004)  
	FText                                              BattleInfoField;                                            // 0x0030   (0x0018)  
};

/// Struct /Script/UADataTableModule.PurchaseConfTableRow
/// Size: 0x0098 (152 bytes) (0x000008 - 0x0000A0) align 8 pad: 0x0000
struct FPurchaseConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Type;                                                       // 0x000C   (0x0004)  
	uint32_t                                           is_for_act;                                                 // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            product_id;                                                 // 0x0018   (0x0010)  
	uint32_t                                           price;                                                      // 0x0028   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x002C   (0x0004)  
	uint32_t                                           item_num;                                                   // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	FText                                              item_name;                                                  // 0x0038   (0x0018)  
	FText                                              item_desc;                                                  // 0x0050   (0x0018)  
	uint32_t                                           sell_type;                                                  // 0x0068   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x006C   (0x0004)  MISSED
	FText                                              service_code;                                               // 0x0070   (0x0018)  
	FText                                              service_name;                                               // 0x0088   (0x0018)  
};

/// Struct /Script/UADataTableModule.ProvinceConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FProvinceConfTableRow : FTableRowBase
{ 
	uint32_t                                           ADCode;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            ip_show;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.ProtectionTypeConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FProtectionTypeConfTableRow : FTableRowBase
{ 
	uint32_t                                           ProtectionType;                                             // 0x0008   (0x0004)  
	uint32_t                                           ProtectionTime;                                             // 0x000C   (0x0004)  
	uint32_t                                           ProtectionDuraction;                                        // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.PrivilegeItemConfTableRow
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000060) align 8 pad: 0x0000
struct FPrivilegeItemConfTableRow : FTableRowBase
{ 
	uint32_t                                           active_item;                                                // 0x0008   (0x0004)  
	uint32_t                                           Type;                                                       // 0x000C   (0x0004)  
	FText                                              get_item;                                                   // 0x0010   (0x0018)  
	FText                                              season_get_item;                                            // 0x0028   (0x0018)  
	FText                                              daily_item;                                                 // 0x0040   (0x0018)  
	uint32_t                                           Value;                                                      // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x005C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.PrivilegeDesConfTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FPrivilegeDesConfTableRow : FTableRowBase
{ 
	uint32_t                                           dataid;                                                     // 0x0008   (0x0004)  
	uint32_t                                           vip_id;                                                     // 0x000C   (0x0004)  
	uint32_t                                           vipsubitem_id;                                              // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FText                                              privilegedes;                                               // 0x0018   (0x0018)  
	FText                                              bubbledes;                                                  // 0x0030   (0x0018)  
	FString                                            icon_name;                                                  // 0x0048   (0x0010)  
};

/// Struct /Script/UADataTableModule.PrivilegeConfTableRow
/// Size: 0x0068 (104 bytes) (0x000008 - 0x000070) align 8 pad: 0x0000
struct FPrivilegeConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           cost_num;                                                   // 0x000C   (0x0004)  
	uint32_t                                           Duration;                                                   // 0x0010   (0x0004)  
	uint32_t                                           cost_num2;                                                  // 0x0014   (0x0004)  
	uint32_t                                           duration2;                                                  // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FText                                              icon;                                                       // 0x0020   (0x0018)  
	uint32_t                                           rest_renew_days;                                            // 0x0038   (0x0004)  
	uint32_t                                           active_card;                                                // 0x003C   (0x0004)  
	FText                                              renewal_face_pic;                                           // 0x0040   (0x0018)  
	uint32_t                                           jumpgotoid;                                                 // 0x0058   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	TArray<uint32_t>                                   item_list;                                                  // 0x0060   (0x0010)  
};

/// Struct /Script/UADataTableModule.PrivilegeBubbleConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FPrivilegeBubbleConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           vip_id;                                                     // 0x000C   (0x0004)  
	uint32_t                                           bubble_type;                                                // 0x0010   (0x0004)  
	float                                              bubble_pos_x;                                               // 0x0014   (0x0004)  
	float                                              bubble_pos_y;                                               // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FText                                              bubble_des;                                                 // 0x0020   (0x0018)  
	uint32_t                                           is_work;                                                    // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.PriceConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FPriceConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           price;                                                      // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.PoolLimitValueTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FPoolLimitValueTableRow : FTableRowBase
{ 
	uint32_t                                           pool_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           value_limit;                                                // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.PmcEquipConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FPmcEquipConfTableRow : FTableRowBase
{ 
	uint32_t                                           is_npc;                                                     // 0x0008   (0x0004)  
	uint32_t                                           group_id;                                                   // 0x000C   (0x0004)  
	uint32_t                                           class_id;                                                   // 0x0010   (0x0004)  
	uint32_t                                           slot_index;                                                 // 0x0014   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x0018   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x001C   (0x0004)  
	TArray<FExtEquipConf>                              exts;                                                       // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.PmcContainerConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FPmcContainerConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x000C   (0x0004)  
	TArray<FCntrItemConf>                              Items;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.PmcAiScoreConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FPmcAiScoreConfTableRow : FTableRowBase
{ 
	uint32_t                                           Level;                                                      // 0x0008   (0x0004)  
	uint32_t                                           min_val;                                                    // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.PmcAiLimitItemConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FPmcAiLimitItemConfTableRow : FTableRowBase
{ 
	uint32_t                                           item_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.PmcAiConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FPmcAiConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	uint64_t                                           Openid;                                                     // 0x0010   (0x0008)  
	uint32_t                                           Level;                                                      // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FString                                            Name;                                                       // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.PlayerNamePoolTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FPlayerNamePoolTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Group;                                                      // 0x000C   (0x0004)  
	FText                                              Name;                                                       // 0x0010   (0x0018)  
};

/// Struct /Script/UADataTableModule.PlayerListTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FPlayerListTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	uint32_t                                           Type;                                                       // 0x0028   (0x0004)  
	uint32_t                                           DefaultValue;                                               // 0x002C   (0x0004)  
	FString                                            Param1;                                                     // 0x0030   (0x0010)  
	FText                                              OptionsName;                                                // 0x0040   (0x0018)  
};

/// Struct /Script/UADataTableModule.PlayerAvatarPopupMenuButtonTableRow
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000060) align 8 pad: 0x0000
struct FPlayerAvatarPopupMenuButtonTableRow : FTableRowBase
{ 
	uint16_t                                           ID;                                                         // 0x0008   (0x0002)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x000A   (0x0006)  MISSED
	FText                                              DisplayName;                                                // 0x0010   (0x0018)  
	FString                                            IconName;                                                   // 0x0028   (0x0010)  
	char                                               displayType;                                                // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0039   (0x0007)  MISSED
	FString                                            ExecFunc;                                                   // 0x0040   (0x0010)  
	TArray<uint16_t>                                   ForbiddenMode;                                              // 0x0050   (0x0010)  
};

/// Struct /Script/UADataTableModule.PlayerAvatarPopupMenuTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FPlayerAvatarPopupMenuTableRow : FTableRowBase
{ 
	uint16_t                                           ID;                                                         // 0x0008   (0x0002)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x000A   (0x0002)  MISSED
	uint32_t                                           Type;                                                       // 0x000C   (0x0004)  
	uint32_t                                           sub_type;                                                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	TArray<uint16_t>                                   ButtonTypes;                                                // 0x0018   (0x0010)  
	uint32_t                                           InviteTeamType;                                             // 0x0028   (0x0004)  
	uint32_t                                           AddFriendType;                                              // 0x002C   (0x0004)  
};

/// Struct /Script/UADataTableModule.PlayModeTableRow
/// Size: 0x0068 (104 bytes) (0x000008 - 0x000070) align 8 pad: 0x0000
struct FPlayModeTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           mode_id;                                                    // 0x000C   (0x0004)  
	uint32_t                                           sub_mod_id;                                                 // 0x0010   (0x0004)  
	uint32_t                                           map_id;                                                     // 0x0014   (0x0004)  
	uint32_t                                           rule_id;                                                    // 0x0018   (0x0004)  
	uint32_t                                           difficult;                                                  // 0x001C   (0x0004)  
	uint32_t                                           Time;                                                       // 0x0020   (0x0004)  
	uint32_t                                           base_time;                                                  // 0x0024   (0x0004)  
	uint32_t                                           day_start_time;                                             // 0x0028   (0x0004)  
	uint32_t                                           day_end_time;                                               // 0x002C   (0x0004)  
	uint32_t                                           time_shift;                                                 // 0x0030   (0x0004)  
	uint32_t                                           min_pmc;                                                    // 0x0034   (0x0004)  
	uint32_t                                           max_pmc;                                                    // 0x0038   (0x0004)  
	uint32_t                                           max_pmc_team;                                               // 0x003C   (0x0004)  
	uint32_t                                           pmc_team_num;                                               // 0x0040   (0x0004)  
	uint32_t                                           scav_team_num;                                              // 0x0044   (0x0004)  
	uint32_t                                           NormalBeginTime;                                            // 0x0048   (0x0004)  
	uint32_t                                           NormalBeginPersonNum;                                       // 0x004C   (0x0004)  
	uint32_t                                           LongTimeBeginTime;                                          // 0x0050   (0x0004)  
	uint32_t                                           LongTimeBeginPersonNum;                                     // 0x0054   (0x0004)  
	uint32_t                                           TimeoutTime;                                                // 0x0058   (0x0004)  
	uint32_t                                           SpawnAIPersonPercent;                                       // 0x005C   (0x0004)  
	uint32_t                                           prefer_score;                                               // 0x0060   (0x0004)  
	uint32_t                                           ds_tick_rate;                                               // 0x0064   (0x0004)  
	uint32_t                                           Dynamic_Light;                                              // 0x0068   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x006C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.PersonalRadarMapTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FPersonalRadarMapTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<float>                                      score_list;                                                 // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.PersonalRadarFactorTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FPersonalRadarFactorTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	float                                              MapCoefficient;                                             // 0x000C   (0x0004)  
	uint32_t                                           IsSegment;                                                  // 0x0010   (0x0004)  
	uint32_t                                           RadarType;                                                  // 0x0014   (0x0004)  
	uint32_t                                           RadarDataSourceType;                                        // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FText                                              AppendId;                                                   // 0x0020   (0x0018)  
	uint32_t                                           Coefficient;                                                // 0x0038   (0x0004)  
	uint32_t                                           ConvertId;                                                  // 0x003C   (0x0004)  
};

/// Struct /Script/UADataTableModule.PersonalBattleOverviewTableRow
/// Size: 0x00A8 (168 bytes) (0x000008 - 0x0000B0) align 8 pad: 0x0000
struct FPersonalBattleOverviewTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              ShowName;                                                   // 0x0010   (0x0018)  
	FString                                            Name;                                                       // 0x0028   (0x0010)  
	FString                                            Format;                                                     // 0x0038   (0x0010)  
	FText                                              Suffix;                                                     // 0x0048   (0x0018)  
	FText                                              desc;                                                       // 0x0060   (0x0018)  
	uint32_t                                           CaculateType;                                               // 0x0078   (0x0004)  
	uint32_t                                           Show;                                                       // 0x007C   (0x0004)  
	uint32_t                                           Category;                                                   // 0x0080   (0x0004)  
	uint32_t                                           OuterWeight;                                                // 0x0084   (0x0004)  
	uint32_t                                           SubCategory;                                                // 0x0088   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x008C   (0x0004)  
	TArray<uint64_t>                                   AppendId;                                                   // 0x0090   (0x0010)  
	FString                                            ClientAppendId;                                             // 0x00A0   (0x0010)  
};

/// Struct /Script/UADataTableModule.PermitConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FPermitConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           check_svr;                                                  // 0x000C   (0x0004)  
	uint32_t                                           check_iparea;                                               // 0x0010   (0x0004)  
	uint32_t                                           check_alertip;                                              // 0x0014   (0x0004)  
	TArray<uint32_t>                                   env_list;                                                   // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.InflationRatio
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FInflationRatio
{ 
	uint32_t                                           start_day;                                                  // 0x0000   (0x0004)  
	uint32_t                                           Ratio;                                                      // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.PaybackConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FPaybackConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           payback_base_value;                                         // 0x000C   (0x0004)  
	uint32_t                                           payback_max_single_value;                                   // 0x0010   (0x0004)  
	uint32_t                                           is_protected;                                               // 0x0014   (0x0004)  
	uint32_t                                           min_protect_level;                                          // 0x0018   (0x0004)  
	uint32_t                                           payback_ratio;                                              // 0x001C   (0x0004)  
	TArray<FInflationRatio>                            inflation_ratio;                                            // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.PPTPageConfTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FPPTPageConfTableRow : FTableRowBase
{ 
	uint32_t                                           pageID;                                                     // 0x0008   (0x0004)  
	uint32_t                                           umgPath;                                                    // 0x000C   (0x0004)  
	TArray<FString>                                    animations;                                                 // 0x0010   (0x0010)  
	uint32_t                                           showDesc;                                                   // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	FText                                              Title;                                                      // 0x0028   (0x0018)  
	FText                                              desc;                                                       // 0x0040   (0x0018)  
};

/// Struct /Script/UADataTableModule.OverSaleValueTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FOverSaleValueTableRow : FTableRowBase
{ 
	uint32_t                                           Item_type;                                                  // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              type_name;                                                  // 0x0010   (0x0018)  
	FText                                              sale_warning_message;                                       // 0x0028   (0x0018)  
	FText                                              sale_warning_advice;                                        // 0x0040   (0x0018)  
};

/// Struct /Script/UADataTableModule.OverSaleNewbieLevelTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FOverSaleNewbieLevelTableRow : FTableRowBase
{ 
	uint32_t                                           newbie_level;                                               // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.OverSaleLackFundTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FOverSaleLackFundTableRow : FTableRowBase
{ 
	uint32_t                                           lack_fund_wealth1;                                          // 0x0008   (0x0004)  
	uint32_t                                           lack_fund_wealth2;                                          // 0x000C   (0x0004)  
	uint32_t                                           lack_fund_cash;                                             // 0x0010   (0x0004)  
	uint32_t                                           lack_fund_mud;                                              // 0x0014   (0x0004)  
	uint32_t                                           lack_fund_gold;                                             // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.OverConsumptionValueTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FOverConsumptionValueTableRow : FTableRowBase
{ 
	uint32_t                                           Item_type;                                                  // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              type_name;                                                  // 0x0010   (0x0018)  
	uint32_t                                           over_consumption_value;                                     // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.OnShelfConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FOnShelfConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           on_the_shelf;                                               // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.ObResetEquipConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FObResetEquipConfTableRow : FTableRowBase
{ 
	uint32_t                                           Index;                                                      // 0x0008   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x000C   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0010   (0x0004)  
	uint32_t                                           is_black;                                                   // 0x0014   (0x0004)  
	TArray<FBlackItemConf>                             Items;                                                      // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.ObRegistEquipConfTableRow
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000028) align 8 pad: 0x0000
struct FObRegistEquipConfTableRow : FTableRowBase
{ 
	uint32_t                                           Index;                                                      // 0x0008   (0x0004)  
	uint32_t                                           item_id;                                                    // 0x000C   (0x0004)  
	uint32_t                                           Num;                                                        // 0x0010   (0x0004)  
	uint32_t                                           is_black;                                                   // 0x0014   (0x0004)  
	TArray<FBlackItemConf>                             Items;                                                      // 0x0018   (0x0010)  
};

/// Struct /Script/UADataTableModule.ObRegistBasicConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FObRegistBasicConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           Level;                                                      // 0x000C   (0x0004)  
	uint32_t                                           are_all_tasks_done;                                         // 0x0010   (0x0004)  
	uint32_t                                           bullion;                                                    // 0x0014   (0x0004)  
	uint32_t                                           gold;                                                       // 0x0018   (0x0004)  
	uint32_t                                           whether_start_rookie;                                       // 0x001C   (0x0004)  
};

/// Struct /Script/UADataTableModule.ObBusinessmanBasicConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FObBusinessmanBasicConfTableRow : FTableRowBase
{ 
	uint32_t                                           businessman_id;                                             // 0x0008   (0x0004)  
	uint32_t                                           businessman_loyalty;                                        // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.NotSubsItemConfTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FNotSubsItemConfTableRow : FTableRowBase
{ 
	uint32_t                                           item_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.NormalGachaConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FNormalGachaConfTableRow : FTableRowBase
{ 
	uint32_t                                           gacha_id;                                                   // 0x0008   (0x0004)  
	uint32_t                                           pool_id;                                                    // 0x000C   (0x0004)  
	uint32_t                                           cost_item;                                                  // 0x0010   (0x0004)  
	uint32_t                                           cost_num;                                                   // 0x0014   (0x0004)  
	uint32_t                                           show_items_group;                                           // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.NewbieLevelTableRow
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000010) align 8 pad: 0x0000
struct FNewbieLevelTableRow : FTableRowBase
{ 
	uint32_t                                           newbie_level;                                               // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.NewGachaConfTableRow
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000050) align 8 pad: 0x0000
struct FNewGachaConfTableRow : FTableRowBase
{ 
	uint32_t                                           gacha_id;                                                   // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	uint32_t                                           Type;                                                       // 0x0028   (0x0004)  
	uint32_t                                           max_count;                                                  // 0x002C   (0x0004)  
	uint32_t                                           reset_type;                                                 // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	FText                                              icon;                                                       // 0x0038   (0x0018)  
};

/// Struct /Script/UADataTableModule.NationalFlagConfTableRow
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000040) align 8 pad: 0x0000
struct FNationalFlagConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              country_alpha;                                              // 0x0010   (0x0018)  
	FText                                              country_img_url;                                            // 0x0028   (0x0018)  
};

/// Struct /Script/UADataTableModule.MultiModeWidgetTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FMultiModeWidgetTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	FString                                            sysIds;                                                     // 0x0028   (0x0010)  
	bool                                               isShowMode;                                                 // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	uint32_t                                           use_ticket;                                                 // 0x003C   (0x0004)  
	uint32_t                                           need_take_in_threshold;                                     // 0x0040   (0x0004)  
	uint32_t                                           default_avatar_set_id;                                      // 0x0044   (0x0004)  
	uint32_t                                           use_self_equip;                                             // 0x0048   (0x0004)  
	uint32_t                                           use_self_avatar;                                            // 0x004C   (0x0004)  
	uint32_t                                           show_wash_white;                                            // 0x0050   (0x0004)  
	uint32_t                                           block_item_back_mail;                                       // 0x0054   (0x0004)  
};

/// Struct /Script/UADataTableModule.MomentTableRow
/// Size: 0x0070 (112 bytes) (0x000008 - 0x000078) align 8 pad: 0x0000
struct FMomentTableRow : FTableRowBase
{ 
	uint32_t                                           MomentId;                                                   // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              MomentTitle;                                                // 0x0010   (0x0018)  
	uint32_t                                           Proportion;                                                 // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	FText                                              Describe;                                                   // 0x0030   (0x0018)  
	FText                                              UrlTitle;                                                   // 0x0048   (0x0018)  
	FText                                              UrlDescribe;                                                // 0x0060   (0x0018)  
};

/// Struct /Script/UADataTableModule.MeticulousSmallGiftConfTableRow
/// Size: 0x0068 (104 bytes) (0x000008 - 0x000070) align 8 pad: 0x0000
struct FMeticulousSmallGiftConfTableRow : FTableRowBase
{ 
	uint32_t                                           gift_id;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	FText                                              desc;                                                       // 0x0028   (0x0018)  
	FText                                              pic;                                                        // 0x0040   (0x0018)  
	FText                                              reward_pic;                                                 // 0x0058   (0x0018)  
};

/// Struct /Script/UADataTableModule.MeticulousLotteryConfTableRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000058) align 8 pad: 0x0000
struct FMeticulousLotteryConfTableRow : FTableRowBase
{ 
	uint32_t                                           gift_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           exist_time;                                                 // 0x000C   (0x0004)  
	FText                                              Name;                                                       // 0x0010   (0x0018)  
	FText                                              desc;                                                       // 0x0028   (0x0018)  
	FText                                              pic;                                                        // 0x0040   (0x0018)  
};

/// Struct /Script/UADataTableModule.MeticulousGiftConfTableRow
/// Size: 0x0070 (112 bytes) (0x000008 - 0x000078) align 8 pad: 0x0000
struct FMeticulousGiftConfTableRow : FTableRowBase
{ 
	uint32_t                                           gift_id;                                                    // 0x0008   (0x0004)  
	uint32_t                                           exist_time;                                                 // 0x000C   (0x0004)  
	uint32_t                                           trigger_limit;                                              // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FText                                              Name;                                                       // 0x0018   (0x0018)  
	FText                                              desc;                                                       // 0x0030   (0x0018)  
	FText                                              pic;                                                        // 0x0048   (0x0018)  
	FText                                              reward_pic;                                                 // 0x0060   (0x0018)  
};

/// Struct /Script/UADataTableModule.MeleeWeaponDetailTableRow
/// Size: 0x00A0 (160 bytes) (0x000008 - 0x0000A8) align 8 pad: 0x0000
struct FMeleeWeaponDetailTableRow : FTableRowBase
{ 
	uint64_t                                           ItemID;                                                     // 0x0008   (0x0008)  
	TArray<float>                                      BaseDamage;                                                 // 0x0010   (0x0010)  
	float                                              ArmorDamage;                                                // 0x0020   (0x0004)  
	float                                              ArmorDamageRatio;                                           // 0x0024   (0x0004)  
	float                                              BleedChance;                                                // 0x0028   (0x0004)  
	float                                              EnergyConsume;                                              // 0x002C   (0x0004)  
	FText                                              AttackSpeed;                                                // 0x0030   (0x0018)  
	TArray<float>                                      DamageReduction;                                            // 0x0048   (0x0010)  
	float                                              TraceRange;                                                 // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	FText                                              BleedProbabilityDisplay;                                    // 0x0060   (0x0018)  
	FText                                              TraceRangeDisplay;                                          // 0x0078   (0x0018)  
	float                                              MeleeMoveSpeedRatio;                                        // 0x0090   (0x0004)  
	float                                              DamageScaleHead;                                            // 0x0094   (0x0004)  
	float                                              DamageScaleArms;                                            // 0x0098   (0x0004)  
	float                                              DamageScaleLegs;                                            // 0x009C   (0x0004)  
	float                                              DamageScaleStomach;                                         // 0x00A0   (0x0004)  
	float                                              DamageScaleChest;                                           // 0x00A4   (0x0004)  
};

/// Struct /Script/UADataTableModule.MedGuidePageConfTableRow
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000050) align 8 pad: 0x0000
struct FMedGuidePageConfTableRow : FTableRowBase
{ 
	uint32_t                                           IndexId;                                                    // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            icon;                                                       // 0x0010   (0x0010)  
	FText                                              desc;                                                       // 0x0020   (0x0018)  
	TArray<uint64_t>                                   CureItemId;                                                 // 0x0038   (0x0010)  
	uint32_t                                           ShowPage;                                                   // 0x0048   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.MatchRankScoreExpansionConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FMatchRankScoreExpansionConfTableRow : FTableRowBase
{ 
	uint32_t                                           rank_score;                                                 // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<uint32_t>                                   rank_score_expansion_val;                                   // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.MatchFactionTeamConf
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 pad: 0x0000
struct FMatchFactionTeamConf
{ 
	uint32_t                                           faction_id;                                                 // 0x0000   (0x0004)  
	uint32_t                                           role_num_ratio;                                             // 0x0004   (0x0004)  
	uint32_t                                           min_player_team;                                            // 0x0008   (0x0004)  
	uint32_t                                           max_player_team;                                            // 0x000C   (0x0004)  
};

/// Struct /Script/UADataTableModule.MatchPoolConfTableRow
/// Size: 0x0120 (288 bytes) (0x000008 - 0x000128) align 8 pad: 0x0000
struct FMatchPoolConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           play_mode_id;                                               // 0x000C   (0x0004)  
	uint32_t                                           matchsvr_division;                                          // 0x0010   (0x0004)  
	uint32_t                                           match_process;                                              // 0x0014   (0x0004)  
	uint32_t                                           wander_default_need_teammate;                               // 0x0018   (0x0004)  
	uint32_t                                           time_seg;                                                   // 0x001C   (0x0004)  
	TArray<uint32_t>                                   min_open_condition_time_array;                              // 0x0020   (0x0010)  
	TArray<uint32_t>                                   min_player_num_array;                                       // 0x0030   (0x0010)  
	uint32_t                                           max_player_num;                                             // 0x0040   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0044   (0x0004)  MISSED
	TArray<uint32_t>                                   min_team_num_array;                                         // 0x0048   (0x0010)  
	uint32_t                                           max_team_num;                                               // 0x0058   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	TArray<uint32_t>                                   min_wander_player_num_array;                                // 0x0060   (0x0010)  
	uint32_t                                           max_wander_player_num;                                      // 0x0070   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0074   (0x0004)  MISSED
	TArray<uint32_t>                                   min_wander_team_num_array;                                  // 0x0078   (0x0010)  
	uint32_t                                           max_wander_team_num;                                        // 0x0088   (0x0004)  
	uint32_t                                           wait_fill_time;                                             // 0x008C   (0x0004)  
	uint32_t                                           is_join_open;                                               // 0x0090   (0x0004)  
	uint32_t                                           join_time_begin;                                            // 0x0094   (0x0004)  
	uint32_t                                           join_time_end;                                              // 0x0098   (0x0004)  
	uint32_t                                           max_scav_join_num;                                          // 0x009C   (0x0004)  
	uint32_t                                           max_wait_style_teammate_time;                               // 0x00A0   (0x0004)  
	uint32_t                                           max_wait_teammate_time;                                     // 0x00A4   (0x0004)  
	uint32_t                                           min_player_team;                                            // 0x00A8   (0x0004)  
	uint32_t                                           max_player_team;                                            // 0x00AC   (0x0004)  
	uint32_t                                           min_wander_player_team;                                     // 0x00B0   (0x0004)  
	uint32_t                                           max_wander_player_team;                                     // 0x00B4   (0x0004)  
	TArray<uint32_t>                                   rank_score_expansion_time;                                  // 0x00B8   (0x0010)  
	uint32_t                                           match_dismiss_time;                                         // 0x00C8   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x00CC   (0x0004)  MISSED
	TArray<uint32_t>                                   begin_time_array;                                           // 0x00D0   (0x0010)  
	TArray<uint32_t>                                   begin_time_score_array;                                     // 0x00E0   (0x0010)  
	uint32_t                                           max_wait_country_time;                                      // 0x00F0   (0x0004)  
	uint32_t                                           max_wait_region_time;                                       // 0x00F4   (0x0004)  
	uint32_t                                           jump_pool_time;                                             // 0x00F8   (0x0004)  
	uint32_t                                           jump_pool_id;                                               // 0x00FC   (0x0004)  
	uint32_t                                           match_param_total_value;                                    // 0x0100   (0x0004)  
	uint32_t                                           max_wait_idc_time;                                          // 0x0104   (0x0004)  
	TArray<uint32_t>                                   faction_open_condition_array;                               // 0x0108   (0x0010)  
	TArray<FMatchFactionTeamConf>                      match_faction_team_vec;                                     // 0x0118   (0x0010)  
};

/// Struct /Script/UADataTableModule.MatchDailyTimeConf
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FMatchDailyTimeConf
{ 
	FString                                            daily_begin_time;                                           // 0x0000   (0x0010)  
	FString                                            daily_end_time;                                             // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.MatchPoolConditionConfTableRow
/// Size: 0x0090 (144 bytes) (0x000008 - 0x000098) align 8 pad: 0x0000
struct FMatchPoolConditionConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           match_pool_id;                                              // 0x000C   (0x0004)  
	uint32_t                                           match_type;                                                 // 0x0010   (0x0004)  
	uint32_t                                           min_level;                                                  // 0x0014   (0x0004)  
	uint32_t                                           max_level;                                                  // 0x0018   (0x0004)  
	uint32_t                                           min_pmc_battle_cnt;                                         // 0x001C   (0x0004)  
	uint32_t                                           max_pmc_battle_cnt;                                         // 0x0020   (0x0004)  
	uint32_t                                           match_isolation_type;                                       // 0x0024   (0x0004)  
	TArray<uint32_t>                                   need_step_array;                                            // 0x0028   (0x0010)  
	TArray<uint32_t>                                   step_transfer_pool_array;                                   // 0x0038   (0x0010)  
	TArray<uint32_t>                                   high_ratio_type_array;                                      // 0x0048   (0x0010)  
	TArray<uint32_t>                                   high_ratio_transfer_pool_array;                             // 0x0058   (0x0010)  
	uint32_t                                           transfer_pool_id;                                           // 0x0068   (0x0004)  
	uint32_t                                           wealth_transfer_pool_id;                                    // 0x006C   (0x0004)  
	uint32_t                                           time_transfer_pool_id;                                      // 0x0070   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0074   (0x0004)  MISSED
	FDateTime                                          begin_time;                                                 // 0x0078   (0x0008)  
	FDateTime                                          end_time;                                                   // 0x0080   (0x0008)  
	TArray<FMatchDailyTimeConf>                        daily_time_vec;                                             // 0x0088   (0x0010)  
};

/// Struct /Script/UADataTableModule.MatchMapReplaceItemConf
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FMatchMapReplaceItemConf
{ 
	uint32_t                                           map_mode_id;                                                // 0x0000   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.MatchMapReplaceConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FMatchMapReplaceConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FMatchMapReplaceItemConf>                   map_mode_list;                                              // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.MatchLineUpConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FMatchLineUpConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           min_player_team;                                            // 0x000C   (0x0004)  
	uint32_t                                           max_player_team;                                            // 0x0010   (0x0004)  
	uint32_t                                           min_team_num;                                               // 0x0014   (0x0004)  
	uint32_t                                           max_team_num;                                               // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.MatchHallTeamDegreeConfTableRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000018) align 8 pad: 0x0000
struct FMatchHallTeamDegreeConfTableRow : FTableRowBase
{ 
	uint32_t                                           match_hall_team_degree_type;                                // 0x0008   (0x0004)  
	uint32_t                                           ID;                                                         // 0x000C   (0x0004)  
	int32_t                                            Val;                                                        // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UADataTableModule.MatchFactionOpenConf
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FMatchFactionOpenConf
{ 
	uint32_t                                           faction_id;                                                 // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<uint32_t>                                   team_num_array;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/UADataTableModule.MatchFactionOpenConditionConfTableRow
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000030) align 8 pad: 0x0000
struct FMatchFactionOpenConditionConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<uint32_t>                                   min_open_condition_time_array;                              // 0x0010   (0x0010)  
	TArray<FMatchFactionOpenConf>                      match_faction_vec;                                          // 0x0020   (0x0010)  
};

/// Struct /Script/UADataTableModule.MatchCommonConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FMatchCommonConfTableRow : FTableRowBase
{ 
	uint32_t                                           match_conf_type;                                            // 0x0008   (0x0004)  
	uint32_t                                           Val;                                                        // 0x000C   (0x0004)  
	TArray<uint32_t>                                   vec;                                                        // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.MarqueeConfTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FMarqueeConfTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            Content;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.WeatherRateItem
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FWeatherRateItem
{ 
	uint32_t                                           Weather;                                                    // 0x0000   (0x0004)  
	uint32_t                                           Weight;                                                     // 0x0004   (0x0004)  
};

/// Struct /Script/UADataTableModule.MapWeatherTableRow
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000020) align 8 pad: 0x0000
struct FMapWeatherTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           cur_weather;                                                // 0x000C   (0x0004)  
	TArray<FWeatherRateItem>                           weather_list;                                               // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.MapUnlockDailyTimeConf
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FMapUnlockDailyTimeConf
{ 
	FString                                            daily_begin_time;                                           // 0x0000   (0x0010)  
	FString                                            daily_end_time;                                             // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.MapShowDailyTimeConf
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FMapShowDailyTimeConf
{ 
	FString                                            daily_begin_time;                                           // 0x0000   (0x0010)  
	FString                                            daily_end_time;                                             // 0x0010   (0x0010)  
};

/// Struct /Script/UADataTableModule.MapUnlockTableRow
/// Size: 0x0150 (336 bytes) (0x000008 - 0x000158) align 8 pad: 0x0000
struct FMapUnlockTableRow : FTableRowBase
{ 
	uint32_t                                           ID;                                                         // 0x0008   (0x0004)  
	uint32_t                                           mode_id;                                                    // 0x000C   (0x0004)  
	uint32_t                                           sub_mod_id;                                                 // 0x0010   (0x0004)  
	uint32_t                                           map_id;                                                     // 0x0014   (0x0004)  
	uint32_t                                           rule_id;                                                    // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FText                                              ShowName;                                                   // 0x0020   (0x0018)  
	uint32_t                                           ShowIndex;                                                  // 0x0038   (0x0004)  
	uint32_t                                           helpJumpId;                                                 // 0x003C   (0x0004)  
	uint32_t                                           unlock_type;                                                // 0x0040   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0044   (0x0004)  MISSED
	TArray<uint64_t>                                   unlock_param;                                               // 0x0048   (0x0010)  
	uint32_t                                           ticket;                                                     // 0x0058   (0x0004)  
	uint32_t                                           is_scav_unlock;                                             // 0x005C   (0x0004)  
	uint32_t                                           is_golden_scav_unlock;                                      // 0x0060   (0x0004)  
	uint32_t                                           act_ticket;                                                 // 0x0064   (0x0004)  
	uint32_t                                           act_id;                                                     // 0x0068   (0x0004)  
	uint32_t                                           take_in_threshold;                                          // 0x006C   (0x0004)  
	FString                                            sysIds;                                                     // 0x0070   (0x0010)  
	uint32_t                                           map_picture;                                                // 0x0080   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0084   (0x0004)  MISSED
	FString                                            typeIcon;                                                   // 0x0088   (0x0010)  
	uint32_t                                           map_plug;                                                   // 0x0098   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x009C   (0x0004)  MISSED
	FString                                            map_bg_name;                                                // 0x00A0   (0x0010)  
	uint32_t                                           ranked_level_limit;                                         // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x00B4   (0x0004)  MISSED
	FText                                              lockreason_out;                                             // 0x00B8   (0x0018)  
