
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AIModule
/// dependency: AkAudio
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: GameplayAbilities
/// dependency: GameplayTags
/// dependency: InputCore
/// dependency: LevelSequence
/// dependency: MediaAssets
/// dependency: MFBenchmark
/// dependency: MFClimateRuntime
/// dependency: MFDataVisualizer
/// dependency: MFGlobalEventParameterTags
/// dependency: MFGlobalEventTags
/// dependency: MFMission
/// dependency: MFMobileJoystick
/// dependency: MFNPCAI
/// dependency: MFPropsDestruction
/// dependency: MFQuestSystem
/// dependency: Niagara
/// dependency: PhysicsCore
/// dependency: ReplicationGraph
/// dependency: SGFramework
/// dependency: Slate
/// dependency: SlateCore
/// dependency: UACommon
/// dependency: UADataTableModule
/// dependency: UAMFClimateRuntime
/// dependency: UMG

/// Enum /Script/UAGame.ETutorialFlowBarType
/// Size: 0x01 (1 bytes)
enum class ETutorialFlowBarType : uint8_t
{
	ETutorialFlowBarType__TutorialFlowBarType_Text                                   = 0,
	ETutorialFlowBarType__TutorialFlowBarType_DynamicImage                           = 1,
	ETutorialFlowBarType__TutorialFlowBarType_Teammate                               = 2,
	ETutorialFlowBarType__TutorialFlowBarType_Arrow                                  = 3
};

/// Enum /Script/UAGame.ETutorialBagType
/// Size: 0x01 (1 bytes)
enum class ETutorialBagType : uint8_t
{
	ETutorialBagType__TutorialBagType_None                                           = 0,
	ETutorialBagType__TutorialBagType_Self                                           = 1,
	ETutorialBagType__TutorialBagType_Loot                                           = 2,
	ETutorialBagType__TutorialBagType_Corpse                                         = 3
};

/// Enum /Script/UAGame.ETutorialBagWidgetType
/// Size: 0x01 (1 bytes)
enum class ETutorialBagWidgetType : uint8_t
{
	ETutorialBagWidgetType__Undefined                                                = 0,
	ETutorialBagWidgetType__PickupsNearby                                            = 1,
	ETutorialBagWidgetType__MyBag                                                    = 2,
	ETutorialBagWidgetType__MyBagIcon                                                = 3,
	ETutorialBagWidgetType__VestBag                                                  = 4,
	ETutorialBagWidgetType__VestBagIcon                                              = 5,
	ETutorialBagWidgetType__PickBag                                                  = 6,
	ETutorialBagWidgetType__Character                                                = 7,
	ETutorialBagWidgetType__Inventory                                                = 8,
	ETutorialBagWidgetType__Adapter                                                  = 9,
	ETutorialBagWidgetType__FirstMainWeapon                                          = 10,
	ETutorialBagWidgetType__SecondMainWeapon                                         = 11,
	ETutorialBagWidgetType__AssistWeapon                                             = 12,
	ETutorialBagWidgetType__MeleeWeapon                                              = 13,
	ETutorialBagWidgetType__ThrowWeapon                                              = 14,
	ETutorialBagWidgetType__Armor_Helmet                                             = 15,
	ETutorialBagWidgetType__Armor_Vest                                               = 16,
	ETutorialBagWidgetType__Pocket                                                   = 17,
	ETutorialBagWidgetType__SafeBox                                                  = 18,
	ETutorialBagWidgetType__SafeBoxIcon                                              = 19,
	ETutorialBagWidgetType__Headset                                                  = 20,
	ETutorialBagWidgetType__FaceCover                                                = 21,
	ETutorialBagWidgetType__EyeWear                                                  = 22,
	ETutorialBagWidgetType__ArmBand                                                  = 23,
	ETutorialBagWidgetType__DogTag                                                   = 24,
	ETutorialBagWidgetType__SplitItemWindow                                          = 25,
	ETutorialBagWidgetType__RotateItemWindow                                         = 26
};

/// Enum /Script/UAGame.EActionPriority
/// Size: 0x01 (1 bytes)
enum class EActionPriority : uint8_t
{
	EActionPriority__EActionPriority_Default                                         = 0,
	EActionPriority__EActionPriority_High                                            = 1,
	EActionPriority__EActionPriority_Highest                                         = 2
};

/// Enum /Script/UAGame.EActionContext
/// Size: 0x01 (1 bytes)
enum class EActionContext : uint8_t
{
	EActionContext__EActionContext_Default                                           = 0,
	EActionContext__EActionContext_Grenade                                           = 1,
	EActionContext__EActionContext_Bag                                               = 2,
	EActionContext__EActionContext_ADS                                               = 3,
	EActionContext__EActionContext_QuickChat                                         = 4,
	EActionContext__EActionContext_LookAround                                        = 5,
	EActionContext__EActionContext_Settings                                          = 6,
	EActionContext__EActionContext_BattleResult                                      = 7,
	EActionContext__EActionContext_ChatBox                                           = 8,
	EActionContext__EActionContext_ThrowWeaponStarted                                = 9
};

/// Enum /Script/UAGame.InventoryDestroyedEffectType
/// Size: 0x01 (1 bytes)
enum class InventoryDestroyedEffectType : uint8_t
{
	InventoryDestroyedEffectType__QuestFailed                                        = 0
};

/// Enum /Script/UAGame.ETutorialCharacterStateCheckType
/// Size: 0x01 (1 bytes)
enum class ETutorialCharacterStateCheckType : uint8_t
{
	ETutorialCharacterStateCheckType__TutorialCharacterStateCheckType_None           = 0,
	ETutorialCharacterStateCheckType__TutorialCharacterStateCheckType_OnceInState    = 1,
	ETutorialCharacterStateCheckType__TutorialCharacterStateCheckType_AddProgressInState = 2
};

/// Enum /Script/UAGame.EQuestConditionCharacterType
/// Size: 0x01 (1 bytes)
enum class EQuestConditionCharacterType : uint8_t
{
	EQuestConditionCharacterType__ECharacterType_AI                                  = 0,
	EQuestConditionCharacterType__ECharacterType_TEAMMATE                            = 1
};

/// Enum /Script/UAGame.EQuestConditionCharacterStatus
/// Size: 0x01 (1 bytes)
enum class EQuestConditionCharacterStatus : uint8_t
{
	EQuestConditionCharacterStatus__ECharacterType_ALIVE_HAS                         = 0,
	EQuestConditionCharacterStatus__ECharacterType_ALIVE_ALL                         = 1,
	EQuestConditionCharacterStatus__ECharacterType_DIED_HAS                          = 2,
	EQuestConditionCharacterStatus__ECharacterType_DIED_ALL                          = 3
};

/// Enum /Script/UAGame.EQuestCheckCustomAttribute
/// Size: 0x01 (1 bytes)
enum class EQuestCheckCustomAttribute : uint8_t
{
	EQuestCheckCustomAttribute__TotalEndurance                                       = 0
};

/// Enum /Script/UAGame.ECheckItemType
/// Size: 0x01 (1 bytes)
enum class ECheckItemType : uint8_t
{
	ECheckItemType__Weapon                                                           = 0,
	ECheckItemType__Helmet                                                           = 1,
	ECheckItemType__Vest                                                             = 2,
	ECheckItemType__Headset                                                          = 3,
	ECheckItemType__FaceCover                                                        = 4,
	ECheckItemType__EyeWear                                                          = 5,
	ECheckItemType__VestBag                                                          = 6,
	ECheckItemType__Bag                                                              = 7
};

/// Enum /Script/UAGame.EGameplayTagCheckType
/// Size: 0x01 (1 bytes)
enum class EGameplayTagCheckType : uint8_t
{
	EGameplayTagCheckType__AnyMatching                                               = 0,
	EGameplayTagCheckType__AllMatching                                               = 1
};

/// Enum /Script/UAGame.EQuestTakeLimitLogicType
/// Size: 0x01 (1 bytes)
enum class EQuestTakeLimitLogicType : uint8_t
{
	EQuestTakeLimitLogicType__Enum_And                                               = 0,
	EQuestTakeLimitLogicType__Enum_Or                                                = 1
};

/// Enum /Script/UAGame.ETeamInfoCheckType
/// Size: 0x01 (1 bytes)
enum class ETeamInfoCheckType : uint8_t
{
	ETeamInfoCheckType__MaxCount                                                     = 0,
	ETeamInfoCheckType__AliveCount                                                   = 1,
	ETeamInfoCheckType__EscapeCount                                                  = 2,
	ETeamInfoCheckType__DiedCount                                                    = 3
};

/// Enum /Script/UAGame.ETimeLimitType
/// Size: 0x01 (1 bytes)
enum class ETimeLimitType : uint8_t
{
	ETimeLimitType__EnterGame                                                        = 0,
	ETimeLimitType__TimeRecord                                                       = 1
};

/// Enum /Script/UAGame.ETutorialBagState
/// Size: 0x01 (1 bytes)
enum class ETutorialBagState : uint8_t
{
	ETutorialBagState__BigMapState_None                                              = 0,
	ETutorialBagState__BigMapState_Open                                              = 1,
	ETutorialBagState__BigMapState_Close                                             = 2
};

/// Enum /Script/UAGame.EBigMapState
/// Size: 0x01 (1 bytes)
enum class EBigMapState : uint8_t
{
	EBigMapState__BigMapState_None                                                   = 0,
	EBigMapState__BigMapState_Open                                                   = 1,
	EBigMapState__BigMapState_Close                                                  = 2
};

/// Enum /Script/UAGame.ETutorialDoorState
/// Size: 0x01 (1 bytes)
enum class ETutorialDoorState : uint8_t
{
	ETutorialDoorState__TutorialDoorState_None                                       = 0,
	ETutorialDoorState__TutorialDoorState_Open                                       = 1,
	ETutorialDoorState__TutorialDoorState_Close                                      = 2
};

/// Enum /Script/UAGame.EFacePanelState
/// Size: 0x01 (1 bytes)
enum class EFacePanelState : uint8_t
{
	EFacePanelState__FacePanelState_None                                             = 0,
	EFacePanelState__FacePanelState_Open                                             = 1,
	EFacePanelState__FacePanelState_Close                                            = 2
};

/// Enum /Script/UAGame.ETutorialSettingState
/// Size: 0x01 (1 bytes)
enum class ETutorialSettingState : uint8_t
{
	ETutorialSettingState__SettingPannalState_None                                   = 0,
	ETutorialSettingState__SettingPannalState_Open                                   = 1,
	ETutorialSettingState__SettingPannalState_Close                                  = 2
};

/// Enum /Script/UAGame.ETutorialDamageType
/// Size: 0x01 (1 bytes)
enum class ETutorialDamageType : uint8_t
{
	ETutorialDamageType__ETutorialDamageType_None                                    = 0,
	ETutorialDamageType__ETutorialDamageType_Bullet                                  = 1,
	ETutorialDamageType__ETutorialDamageType_Grenade                                 = 2
};

/// Enum /Script/UAGame.EQuestInteractEnableType
/// Size: 0x01 (1 bytes)
enum class EQuestInteractEnableType : uint8_t
{
	EQuestInteractEnableType__Self                                                   = 0,
	EQuestInteractEnableType__Teammate                                               = 1,
	EQuestInteractEnableType__Anyone                                                 = 2
};

/// Enum /Script/UAGame.EQuestTraceMarkType
/// Size: 0x01 (1 bytes)
enum class EQuestTraceMarkType : uint8_t
{
	EQuestTraceMarkType__QuestInventory                                              = 0,
	EQuestTraceMarkType__InteractItem                                                = 1,
	EQuestTraceMarkType__Area                                                        = 2,
	EQuestTraceMarkType__EscapePoint                                                 = 3
};

/// Enum /Script/UAGame.ESoundDirType
/// Size: 0x01 (1 bytes)
enum class ESoundDirType : uint8_t
{
	ESoundDirType__None                                                              = 0,
	ESoundDirType__LEFT                                                              = 1,
	ESoundDirType__CENTER                                                            = 2,
	ESoundDirType__RIGHT                                                             = 3
};

/// Enum /Script/UAGame.EActivityDataCenterType
/// Size: 0x01 (1 bytes)
enum class EActivityDataCenterType : uint8_t
{
	EActivityDataCenterType__E_None                                                  = 0,
	EActivityDataCenterType__E_GameState                                             = 1,
	EActivityDataCenterType__E_TeamInfo                                              = 2,
	EActivityDataCenterType__E_PlayerState                                           = 3
};

/// Enum /Script/UAGame.ELootRandomItemType
/// Size: 0x01 (1 bytes)
enum class ELootRandomItemType : uint8_t
{
	ELootRandomItemType__MainSetting                                                 = 0,
	ELootRandomItemType__NormalItem                                                  = 1,
	ELootRandomItemType__SubItemTable                                                = 2,
	ELootRandomItemType__AssembledItem                                               = 3
};

/// Enum /Script/UAGame.ESGLootRandomItemOperation
/// Size: 0x01 (1 bytes)
enum class ESGLootRandomItemOperation : uint8_t
{
	ESGLootRandomItemOperation__And                                                  = 0,
	ESGLootRandomItemOperation__Or                                                   = 1
};

/// Enum /Script/UAGame.EUATutorialArrowTipType
/// Size: 0x01 (1 bytes)
enum class EUATutorialArrowTipType : uint8_t
{
	EUATutorialArrowTipType__Container                                               = 0,
	EUATutorialArrowTipType__FillAmmo                                                = 1
};

/// Enum /Script/UAGame.EUATutorialHighlightEffectType
/// Size: 0x01 (1 bytes)
enum class EUATutorialHighlightEffectType : uint8_t
{
	EUATutorialHighlightEffectType__Search                                           = 0,
	EUATutorialHighlightEffectType__GamePad                                          = 1,
	EUATutorialHighlightEffectType__SelectMenu                                       = 2,
	EUATutorialHighlightEffectType__SelectMenu_NotMine                               = 3
};

/// Enum /Script/UAGame.EUAMarkedType
/// Size: 0x01 (1 bytes)
enum class EUAMarkedType : uint8_t
{
	EUAMarkedType__EUAMarkedType_None                                                = 0,
	EUAMarkedType__EUAMarkedType_TitleInfo                                           = 1
};

/// Enum /Script/UAGame.EEscapeInteractVolumeState
/// Size: 0x01 (1 bytes)
enum class EEscapeInteractVolumeState : uint8_t
{
	EEscapeInteractVolumeState__EEscapeInteractVolumeState_None                      = 0,
	EEscapeInteractVolumeState__EEscapeInteractVolumeState_Unactivate                = 1,
	EEscapeInteractVolumeState__EEscapeInteractVolumeState_Activate                  = 2,
	EEscapeInteractVolumeState__EEscapeInteractVolumeState_Interacted                = 3
};

/// Enum /Script/UAGame.EUAEscapeTimeType
/// Size: 0x01 (1 bytes)
enum class EUAEscapeTimeType : uint8_t
{
	EUAEscapeTimeType__Locality                                                      = 0,
	EUAEscapeTimeType__Global                                                        = 1
};

/// Enum /Script/UAGame.EUATimeType
/// Size: 0x01 (1 bytes)
enum class EUATimeType : uint8_t
{
	EUATimeType__None                                                                = 0,
	EUATimeType__Open                                                                = 1,
	EUATimeType__Close                                                               = 2
};

/// Enum /Script/UAGame.EEscapeState
/// Size: 0x01 (1 bytes)
enum class EEscapeState : uint8_t
{
	EEscapeState__EEscapeState_None                                                  = 0,
	EEscapeState__EEscapeState_CanEscape                                             = 1,
	EEscapeState__EEscapeState_Close                                                 = 2,
	EEscapeState__EEscapeState_Open                                                  = 3,
	EEscapeState__EEscapeState_NotOpen                                               = 4
};

/// Enum /Script/UAGame.EEscapeVolumeStyle
/// Size: 0x01 (1 bytes)
enum class EEscapeVolumeStyle : uint8_t
{
	EEscapeVolumeStyle__Normal                                                       = 0,
	EEscapeVolumeStyle__ThemeActivity                                                = 1
};

/// Enum /Script/UAGame.EEscapeVolumeType
/// Size: 0x01 (1 bytes)
enum class EEscapeVolumeType : uint8_t
{
	EEscapeVolumeType__Locality                                                      = 0,
	EEscapeVolumeType__Global                                                        = 1
};

/// Enum /Script/UAGame.EChatacterVisibleState
/// Size: 0x01 (1 bytes)
enum class EChatacterVisibleState : uint8_t
{
	EChatacterVisibleState__EChatacterVisibleState_None                              = 0,
	EChatacterVisibleState__EChatacterVisibleState_Invisible                         = 1,
	EChatacterVisibleState__EChatacterVisibleState_Visible                           = 2
};

/// Enum /Script/UAGame.EUAFSMCompareType
/// Size: 0x01 (1 bytes)
enum class EUAFSMCompareType : uint8_t
{
	EUAFSMCompareType__UAFSMCompareType_None                                         = 0,
	EUAFSMCompareType__UAFSMCompareType_Less                                         = 1,
	EUAFSMCompareType__UAFSMCompareType_LessEqual                                    = 2,
	EUAFSMCompareType__UAFSMCompareType_Equals                                       = 3,
	EUAFSMCompareType__UAFSMCompareType_GreaterEqual                                 = 4,
	EUAFSMCompareType__UAFSMCompareType_Greater                                      = 5,
	EUAFSMCompareType__UAFSMCompareType_NotEqual                                     = 6,
	EUAFSMCompareType__UAFSMCompareType_Between                                      = 7
};

/// Enum /Script/UAGame.EUAFSMRelative
/// Size: 0x01 (1 bytes)
enum class EUAFSMRelative : uint8_t
{
	EUAFSMRelative__UAFSMRelative_None                                               = 0,
	EUAFSMRelative__UAFSMRelative_And                                                = 1,
	EUAFSMRelative__UAFSMRelative_Or                                                 = 2
};

/// Enum /Script/UAGame.EGameMapId
/// Size: 0x01 (1 bytes)
enum class EGameMapId : uint8_t
{
	EGameMapId__None                                                                 = 0,
	EGameMapId__Erangel                                                              = 1,
	EGameMapId__Desert                                                               = 2,
	EGameMapId__ErangelOrigin                                                        = 3,
	EGameMapId__Savage                                                               = 4,
	EGameMapId__Max                                                                  = 5
};

/// Enum /Script/UAGame.ESubGameModeType
/// Size: 0x02 (2 bytes)
enum class ESubGameModeType : uint16_t
{
	ESubGameModeType__None                                                           = 0,
	ESubGameModeType__Main                                                           = 100,
	ESubGameModeType__DeathPoisonFog                                                 = 200,
	ESubGameModeType__Compact                                                        = 201,
	ESubGameModeType__RandomMap                                                      = 300,
	ESubGameModeType__Fog                                                            = 301,
	ESubGameModeType__CustomItemSniper                                               = 400,
	ESubGameModeType__CustomItemColdArms                                             = 401,
	ESubGameModeType__CustomItem3xRich                                               = 402,
	ESubGameModeType__CustomItemPistol                                               = 403,
	ESubGameModeType__CustomItemShotgun                                              = 404,
	ESubGameModeType__CustomItemDrug                                                 = 405,
	ESubGameModeType__HardCore                                                       = 500,
	ESubGameModeType__FPP                                                            = 501,
	ESubGameModeType__BattleOfFiveArmies                                             = 502,
	ESubGameModeType__BattleOfThreeTeams                                             = 503
};

/// Enum /Script/UAGame.EMainGameModeType
/// Size: 0x01 (1 bytes)
enum class EMainGameModeType : uint8_t
{
	EMainGameModeType__None                                                          = 0,
	EMainGameModeType__ClassicPVP                                                    = 1,
	EMainGameModeType__LeisurePVP                                                    = 2
};

/// Enum /Script/UAGame.EGameTeamType
/// Size: 0x01 (1 bytes)
enum class EGameTeamType : uint8_t
{
	EGameTeamType__None                                                              = 0,
	EGameTeamType__OnePlayer                                                         = 1,
	EGameTeamType__TwoPlayers                                                        = 2,
	EGameTeamType__FourPlayers                                                       = 3,
	EGameTeamType__ThreeTeams                                                        = 4,
	EGameTeamType__FiveTeams                                                         = 5,
	EGameTeamType__Max                                                               = 6
};

/// Enum /Script/UAGame.EGameMatchType
/// Size: 0x01 (1 bytes)
enum class EGameMatchType : uint8_t
{
	EGameMatchType__None                                                             = 0,
	EGameMatchType__Normal                                                           = 1,
	EGameMatchType__Rank                                                             = 2,
	EGameMatchType__Custom                                                           = 3,
	EGameMatchType__Max                                                              = 4
};

/// Enum /Script/UAGame.EUARoleID
/// Size: 0x01 (1 bytes)
enum class EUARoleID : uint8_t
{
	EUARoleID__Sledge                                                                = 0,
	EUARoleID__Ash                                                                   = 1,
	EUARoleID__Bandit                                                                = 2,
	EUARoleID__Castle                                                                = 3,
	EUARoleID__Glaz                                                                  = 4,
	EUARoleID__Jager                                                                 = 5,
	EUARoleID__Kapkan                                                                = 6,
	EUARoleID__Rook                                                                  = 7,
	EUARoleID__Tharcher                                                              = 8,
	EUARoleID__Thermite                                                              = 9
};

/// Enum /Script/UAGame.EUATutorialDefaultInventory
/// Size: 0x01 (1 bytes)
enum class EUATutorialDefaultInventory : uint8_t
{
	EUATutorialDefaultInventory__None                                                = 0,
	EUATutorialDefaultInventory__TutorialAKM                                         = 1,
	EUATutorialDefaultInventory__TutorialHK416                                       = 2
};

/// Enum /Script/UAGame.ETutorialBagTabType
/// Size: 0x01 (1 bytes)
enum class ETutorialBagTabType : uint8_t
{
	ETutorialBagTabType__TutorialTabType_None                                        = 0,
	ETutorialBagTabType__TutorialTabType_Equipment                                   = 1,
	ETutorialBagTabType__TutorialTabType_VestBag                                     = 2,
	ETutorialBagTabType__TutorialTabType_Pockage                                     = 3,
	ETutorialBagTabType__TutorialTabType_Bag                                         = 4,
	ETutorialBagTabType__TutorialTabType_SafeBox                                     = 5,
	ETutorialBagTabType__TutorialTabType_Character                                   = 100,
	ETutorialBagTabType__TutorialTabType_Health                                      = 101,
	ETutorialBagTabType__TutorialTabType_Quest                                       = 102,
	ETutorialBagTabType__TutorialTabType_Map                                         = 103,
	ETutorialBagTabType__TutorialTabType_Season                                      = 104
};

/// Enum /Script/UAGame.ETutorialCharacterState
/// Size: 0x01 (1 bytes)
enum class ETutorialCharacterState : uint8_t
{
	ETutorialCharacterState__TutorialCharacterState_None                             = 0,
	ETutorialCharacterState__TutorialCharacterState_Stand                            = 1,
	ETutorialCharacterState__TutorialCharacterState_Jump                             = 2,
	ETutorialCharacterState__TutorialCharacterState_Crouch                           = 3,
	ETutorialCharacterState__TutorialCharacterState_Prone                            = 4,
	ETutorialCharacterState__TutorialCharacterState_Zooming                          = 5,
	ETutorialCharacterState__TutorialCharacterState_LoseEndurance                    = 6,
	ETutorialCharacterState__TutorialCharacterState_Sprint                           = 7,
	ETutorialCharacterState__TutorialCharacterState_SilentWalk                       = 8,
	ETutorialCharacterState__TutorialCharacterState_HoldingBreath                    = 9,
	ETutorialCharacterState__TutorialCharacterState_ChangeClip                       = 10
};

/// Enum /Script/UAGame.EBigMapTouchResponseType
/// Size: 0x01 (1 bytes)
enum class EBigMapTouchResponseType : uint8_t
{
	EBigMapTouchResponseType__None                                                   = 0,
	EBigMapTouchResponseType__Global                                                 = 1,
	EBigMapTouchResponseType__Locality                                               = 2
};

/// Enum /Script/UAGame.ENewMapDisplayModel
/// Size: 0x01 (1 bytes)
enum class ENewMapDisplayModel : uint8_t
{
	ENewMapDisplayModel__Free                                                        = 0,
	ENewMapDisplayModel__FollowViewCharacter                                         = 1
};

/// Enum /Script/UAGame.ENewMapTouchResponseType
/// Size: 0x01 (1 bytes)
enum class ENewMapTouchResponseType : uint8_t
{
	ENewMapTouchResponseType__None                                                   = 0,
	ENewMapTouchResponseType__Global                                                 = 1,
	ENewMapTouchResponseType__Locality                                               = 2
};

/// Enum /Script/UAGame.EHUDWeaponSlotType
/// Size: 0x01 (1 bytes)
enum class EHUDWeaponSlotType : uint8_t
{
	EHUDWeaponSlotType__FirstMainWeapon                                              = 0,
	EHUDWeaponSlotType__SecondMainWeapon                                             = 1,
	EHUDWeaponSlotType__AssistantWeapon                                              = 2,
	EHUDWeaponSlotType__MeleeWeapon                                                  = 3
};

/// Enum /Script/UAGame.EWidgetTopParentActorType
/// Size: 0x01 (1 bytes)
enum class EWidgetTopParentActorType : uint8_t
{
	EWidgetTopParentActorType__CharaterSelf                                          = 0,
	EWidgetTopParentActorType__LootBox                                               = 1,
	EWidgetTopParentActorType__CorpseBox                                             = 2,
	EWidgetTopParentActorType__BagBox                                                = 3
};

/// Enum /Script/UAGame.EUAHUDNewBagWidgetIdentification
/// Size: 0x01 (1 bytes)
enum class EUAHUDNewBagWidgetIdentification : uint8_t
{
	EUAHUDNewBagWidgetIdentification__Undefined                                      = 0,
	EUAHUDNewBagWidgetIdentification__PickupsNearby                                  = 1,
	EUAHUDNewBagWidgetIdentification__MyBag                                          = 2,
	EUAHUDNewBagWidgetIdentification__MyBagIcon                                      = 3,
	EUAHUDNewBagWidgetIdentification__VestBag                                        = 4,
	EUAHUDNewBagWidgetIdentification__VestBagIcon                                    = 5,
	EUAHUDNewBagWidgetIdentification__PickBag                                        = 6,
	EUAHUDNewBagWidgetIdentification__Character                                      = 7,
	EUAHUDNewBagWidgetIdentification__Inventory                                      = 8,
	EUAHUDNewBagWidgetIdentification__Adapter                                        = 9,
	EUAHUDNewBagWidgetIdentification__FirstMainWeapon                                = 10,
	EUAHUDNewBagWidgetIdentification__SecondMainWeapon                               = 11,
	EUAHUDNewBagWidgetIdentification__AssistWeapon                                   = 12,
	EUAHUDNewBagWidgetIdentification__MeleeWeapon                                    = 13,
	EUAHUDNewBagWidgetIdentification__ThrowWeapon                                    = 14,
	EUAHUDNewBagWidgetIdentification__Armor_Helmet                                   = 15,
	EUAHUDNewBagWidgetIdentification__Armor_Vest                                     = 16,
	EUAHUDNewBagWidgetIdentification__Pocket                                         = 17,
	EUAHUDNewBagWidgetIdentification__SafeBox                                        = 18,
	EUAHUDNewBagWidgetIdentification__SafeBoxIcon                                    = 19,
	EUAHUDNewBagWidgetIdentification__Headset                                        = 20,
	EUAHUDNewBagWidgetIdentification__FaceCover                                      = 21,
	EUAHUDNewBagWidgetIdentification__EyeWear                                        = 22,
	EUAHUDNewBagWidgetIdentification__ArmBand                                        = 23,
	EUAHUDNewBagWidgetIdentification__DogTag                                         = 24,
	EUAHUDNewBagWidgetIdentification__SplitItemWindow                                = 25,
	EUAHUDNewBagWidgetIdentification__RotateItemWindow                               = 26,
	EUAHUDNewBagWidgetIdentification__PickBagIcon                                    = 27,
	EUAHUDNewBagWidgetIdentification__KeyBagIcon                                     = 28,
	EUAHUDNewBagWidgetIdentification__KeyBag                                         = 29,
	EUAHUDNewBagWidgetIdentification__ShortcutBar                                    = 30
};

/// Enum /Script/UAGame.EUAHUDBagWidgetIdentification
/// Size: 0x01 (1 bytes)
enum class EUAHUDBagWidgetIdentification : uint8_t
{
	EUAHUDBagWidgetIdentification__Undefined                                         = 0,
	EUAHUDBagWidgetIdentification__PickupsNearby                                     = 1,
	EUAHUDBagWidgetIdentification__MyBag                                             = 2,
	EUAHUDBagWidgetIdentification__Weapons                                           = 3,
	EUAHUDBagWidgetIdentification__Apparel                                           = 4,
	EUAHUDBagWidgetIdentification__Inventory                                         = 5,
	EUAHUDBagWidgetIdentification__Adapter                                           = 6,
	EUAHUDBagWidgetIdentification__FirstMainWeapon                                   = 7,
	EUAHUDBagWidgetIdentification__SecondMainWeapon                                  = 8,
	EUAHUDBagWidgetIdentification__AssistWeapon                                      = 9,
	EUAHUDBagWidgetIdentification__MeleeWeapon                                       = 10,
	EUAHUDBagWidgetIdentification__ThrowWeapon                                       = 11,
	EUAHUDBagWidgetIdentification__Helmet                                            = 12,
	EUAHUDBagWidgetIdentification__FlatJacket                                        = 13,
	EUAHUDBagWidgetIdentification__Apparel_Hat                                       = 14,
	EUAHUDBagWidgetIdentification__Apparel_Glasses                                   = 15,
	EUAHUDBagWidgetIdentification__Apparel_UpShirt                                   = 16,
	EUAHUDBagWidgetIdentification__Apparel_Pants                                     = 17,
	EUAHUDBagWidgetIdentification__Apparel_Shoes                                     = 18,
	EUAHUDBagWidgetIdentification__Apparel_Ghillie                                   = 19
};

/// Enum /Script/UAGame.EItemAction
/// Size: 0x01 (1 bytes)
enum class EItemAction : uint8_t
{
	EItemAction__ActionNone                                                          = 0,
	EItemAction__ActionPickup                                                        = 1,
	EItemAction__ActionUse                                                           = 2,
	EItemAction__ActionAttach                                                        = 3,
	EItemAction__ActionReload                                                        = 4,
	EItemAction__ActionExchange                                                      = 5,
	EItemAction__ActionDetach                                                        = 6,
	EItemAction__ActionDiscard                                                       = 7,
	EItemAction__ActionPickupPart                                                    = 8,
	EItemAction__ActionDiscardPart                                                   = 9,
	EItemAction__ActionRevertSkin                                                    = 10,
	EItemAction__ActionPutonSkin                                                     = 11
};

/// Enum /Script/UAGame.EBRPlayerState
/// Size: 0x01 (1 bytes)
enum class EBRPlayerState : uint8_t
{
	EBRPlayerState__PlayerState_NONE                                                 = 0,
	EBRPlayerState__PlayerState_Normal                                               = 1,
	EBRPlayerState__PlayerState_Airplane                                             = 2,
	EBRPlayerState__PlayerState_Air                                                  = 3,
	EBRPlayerState__PlayerState_Drive                                                = 4,
	EBRPlayerState__PlayerState_Weak                                                 = 5,
	EBRPlayerState__PlayerState_OffLine                                              = 6,
	EBRPlayerState__PlayerState_Dead                                                 = 7,
	EBRPlayerState__PlayerState_Spectating                                           = 8
};

/// Enum /Script/UAGame.ELockLootContainerConditionType
/// Size: 0x01 (1 bytes)
enum class ELockLootContainerConditionType : uint8_t
{
	ELockLootContainerConditionType__None                                            = 0,
	ELockLootContainerConditionType__CostInventory                                   = 1,
	ELockLootContainerConditionType__CheckMissionStatues                             = 2
};

/// Enum /Script/UAGame.ETargetEscapeState
/// Size: 0x01 (1 bytes)
enum class ETargetEscapeState : uint8_t
{
	ETargetEscapeState__ETargetEscapeState_None                                      = 0,
	ETargetEscapeState__ETargetEscapeState_CanEscape                                 = 1,
	ETargetEscapeState__ETargetEscapeState_Close                                     = 2,
	ETargetEscapeState__ETargetEscapeState_Open                                      = 3,
	ETargetEscapeState__ETargetEscapeState_NotOpen                                   = 4
};

/// Enum /Script/UAGame.EFPSCCheckType
/// Size: 0x01 (1 bytes)
enum class EFPSCCheckType : uint8_t
{
	EFPSCCheckType__EFPSCCheckType_All                                               = 0,
	EFPSCCheckType__EFPSCCheckType_Farthest                                          = 1,
	EFPSCCheckType__EFPSCCheckType_Nearest                                           = 2,
	EFPSCCheckType__EFPSCCheckType_DistanceRange                                     = 3
};

/// Enum /Script/UAGame.EAISceneEventType
/// Size: 0x01 (1 bytes)
enum class EAISceneEventType : uint8_t
{
	EAISceneEventType__SceneEventTrigger                                             = 0,
	EAISceneEventType__SceneEventExpired                                             = 1,
	EAISceneEventType__SceneEventRemoved                                             = 2,
	EAISceneEventType__SceneEventCompleted                                           = 3
};

/// Enum /Script/UAGame.EMissionObjective_RandTimerType
/// Size: 0x01 (1 bytes)
enum class EMissionObjective_RandTimerType : uint8_t
{
	EMissionObjective_RandTimerType__GameBegin                                       = 0,
	EMissionObjective_RandTimerType__ObjectiveActivated                              = 1
};

/// Enum /Script/UAGame.EMissionConditionTeamInfoType
/// Size: 0x01 (1 bytes)
enum class EMissionConditionTeamInfoType : uint8_t
{
	EMissionConditionTeamInfoType__MaxCount                                          = 0,
	EMissionConditionTeamInfoType__AliveCount                                        = 1,
	EMissionConditionTeamInfoType__EscapeCount                                       = 2,
	EMissionConditionTeamInfoType__DiedCount                                         = 3
};

/// Enum /Script/UAGame.EMissionConditionCharacterType
/// Size: 0x01 (1 bytes)
enum class EMissionConditionCharacterType : uint8_t
{
	EMissionConditionCharacterType__ECharacterType_AI                                = 0,
	EMissionConditionCharacterType__ECharacterType_TEAMMATE                          = 1
};

/// Enum /Script/UAGame.EMissionConditionCharacterStatus
/// Size: 0x01 (1 bytes)
enum class EMissionConditionCharacterStatus : uint8_t
{
	EMissionConditionCharacterStatus__ECharacterType_ALIVE_HAS                       = 0,
	EMissionConditionCharacterStatus__ECharacterType_ALIVE_ALL                       = 1,
	EMissionConditionCharacterStatus__ECharacterType_DIED_HAS                        = 2,
	EMissionConditionCharacterStatus__ECharacterType_DIED_ALL                        = 3
};

/// Enum /Script/UAGame.EMissionConditionGameplayTagCheckType
/// Size: 0x01 (1 bytes)
enum class EMissionConditionGameplayTagCheckType : uint8_t
{
	EMissionConditionGameplayTagCheckType__AnyMatching                               = 0,
	EMissionConditionGameplayTagCheckType__AllMatching                               = 1
};

/// Enum /Script/UAGame.EMissionConditionItemType
/// Size: 0x01 (1 bytes)
enum class EMissionConditionItemType : uint8_t
{
	EMissionConditionItemType__Weapon                                                = 0,
	EMissionConditionItemType__Helmet                                                = 1,
	EMissionConditionItemType__Vest                                                  = 2,
	EMissionConditionItemType__Headset                                               = 3,
	EMissionConditionItemType__FaceCover                                             = 4,
	EMissionConditionItemType__EyeWear                                               = 5,
	EMissionConditionItemType__VestBag                                               = 6,
	EMissionConditionItemType__Bag                                                   = 7
};

/// Enum /Script/UAGame.EMissionConditionCustomAttribute
/// Size: 0x01 (1 bytes)
enum class EMissionConditionCustomAttribute : uint8_t
{
	EMissionConditionCustomAttribute__TotalEndurance                                 = 0
};

/// Enum /Script/UAGame.EMissionSubType
/// Size: 0x01 (1 bytes)
enum class EMissionSubType : uint8_t
{
	EMissionSubType__E_MISSION_SUB_TYPE_NONE                                         = 0,
	EMissionSubType__E_MISSION_SUB_TYPE_RANDOM_TASK                                  = 1,
	EMissionSubType__E_MISSION_SUB_TYPE_DUEL_TASK                                    = 2,
	EMissionSubType__E_MISSION_SUB_TYPE_GLOBAL_TASK                                  = 3,
	EMissionSubType__E_MISSION_SUB_TYPE_ACTIVITY_TASK                                = 4,
	EMissionSubType__E_MISSION_SUB_TYPE_RANDOM_EVENT                                 = 5,
	EMissionSubType__E_MISSION_SUB_TYPE_RESIDENT_EVENT                               = 6,
	EMissionSubType__E_MISSION_SUB_TYPE_ACTIVITY_EVENT                               = 7
};

/// Enum /Script/UAGame.EDistributeMissionType
/// Size: 0x01 (1 bytes)
enum class EDistributeMissionType : uint8_t
{
	EDistributeMissionType__UrgentTask                                               = 0,
	EDistributeMissionType__DynamicEvent                                             = 1,
	EDistributeMissionType__ActivityEvent                                            = 2
};

/// Enum /Script/UAGame.EUAParadropSupplyFrameMeshHideType
/// Size: 0x01 (1 bytes)
enum class EUAParadropSupplyFrameMeshHideType : uint8_t
{
	EUAParadropSupplyFrameMeshHideType__Never                                        = 0,
	EUAParadropSupplyFrameMeshHideType__AfterLanding                                 = 1,
	EUAParadropSupplyFrameMeshHideType__Always                                       = 2
};

/// Enum /Script/UAGame.EWaitingReportCallback
/// Size: 0x01 (1 bytes)
enum class EWaitingReportCallback : uint8_t
{
	EWaitingReportCallback__None                                                     = 0,
	EWaitingReportCallback__OnRep_ChaseActivityAvatarInfo                            = 1,
	EWaitingReportCallback__OnRep_ChaseActivityStateChangeInfo                       = 2,
	EWaitingReportCallback__OnRep_ActivityInventoryStateChangeInfo                   = 3
};

/// Enum /Script/UAGame.EEmergencyTaskType
/// Size: 0x01 (1 bytes)
enum class EEmergencyTaskType : uint8_t
{
	EEmergencyTaskType__Normal                                                       = 0,
	EEmergencyTaskType__Activity                                                     = 1
};

/// Enum /Script/UAGame.EQuestUnLockType
/// Size: 0x01 (1 bytes)
enum class EQuestUnLockType : uint8_t
{
	EQuestUnLockType__QuestUnLock_None                                               = 0,
	EQuestUnLockType__QuestUnLock_TimeToMeet                                         = 1,
	EQuestUnLockType__QuestUnLock_ProgressChange                                     = 2
};

/// Enum /Script/UAGame.EQuestCharacterType
/// Size: 0x01 (1 bytes)
enum class EQuestCharacterType : uint8_t
{
	EQuestCharacterType__QuestCharacterType_None                                     = 0,
	EQuestCharacterType__QuestCharacterType_PMC                                      = 1,
	EQuestCharacterType__QuestCharacterType_SCAV                                     = 2,
	EQuestCharacterType__QuestCharacterType_AI_SCAV                                  = 3
};

/// Enum /Script/UAGame.EClassRepNodeMapping
/// Size: 0x01 (1 bytes)
enum class EClassRepNodeMapping : uint8_t
{
	EClassRepNodeMapping__NotRouted                                                  = 0,
	EClassRepNodeMapping__RelevantAllConnections                                     = 1,
	EClassRepNodeMapping__Spatialize_Static                                          = 2,
	EClassRepNodeMapping__Spatialize_Dynamic                                         = 3,
	EClassRepNodeMapping__Spatialize_Dormancy                                        = 4,
	EClassRepNodeMapping__Spatialize_Static_Dormancy                                 = 5,
	EClassRepNodeMapping__RelevantTeam                                               = 6,
	EClassRepNodeMapping__RelevantFollowOwner                                        = 7,
	EClassRepNodeMapping__RelevantOwnerConnections                                   = 8,
	EClassRepNodeMapping__RelevantConnectionsGroup                                   = 9,
	EClassRepNodeMapping__DynamicPolicy                                              = 10,
	EClassRepNodeMapping__RelvantAI                                                  = 11,
	EClassRepNodeMapping__RelevantFaction                                            = 12,
	EClassRepNodeMapping__SimpleDistanceRelevancy                                    = 13
};

/// Enum /Script/UAGame.EEscapeExploreState
/// Size: 0x01 (1 bytes)
enum class EEscapeExploreState : uint8_t
{
	EEscapeExploreState__EEscapeExploreState_None                                    = 0,
	EEscapeExploreState__EEscapeExploreState_AlwaysOpen                              = 1,
	EEscapeExploreState__EEscapeExploreState_Open                                    = 2,
	EEscapeExploreState__EEscapeExploreState_Close                                   = 3,
	EEscapeExploreState__EEscapeExploreState_Unknown                                 = 4
};

/// Enum /Script/UAGame.ESignType
/// Size: 0x01 (1 bytes)
enum class ESignType : uint8_t
{
	ESignType__EscapeSign                                                            = 0,
	ESignType__QuestSign                                                             = 1,
	ESignType__PlayerSign                                                            = 2,
	ESignType__None                                                                  = 3
};

/// Enum /Script/UAGame.EDetailBoardType
/// Size: 0x01 (1 bytes)
enum class EDetailBoardType : uint8_t
{
	EDetailBoardType__TaskIcon                                                       = 0,
	EDetailBoardType__EscapeIcon                                                     = 1,
	EDetailBoardType__ChaseTargetIcon                                                = 2
};

/// Enum /Script/UAGame.EMoveCheckStyle
/// Size: 0x01 (1 bytes)
enum class EMoveCheckStyle : uint8_t
{
	EMoveCheckStyle__OnlyMove                                                        = 0,
	EMoveCheckStyle__OnlyAdd                                                         = 1
};

/// Enum /Script/UAGame.EBattleIntensityExpectation
/// Size: 0x01 (1 bytes)
enum class EBattleIntensityExpectation : uint8_t
{
	EBattleIntensityExpectation__None                                                = 0,
	EBattleIntensityExpectation__Low                                                 = 1,
	EBattleIntensityExpectation__Normal                                              = 2,
	EBattleIntensityExpectation__High                                                = 3,
	EBattleIntensityExpectation__VeryHigh                                            = 4
};

/// Enum /Script/UAGame.ETraceMarkOperatorType
/// Size: 0x01 (1 bytes)
enum class ETraceMarkOperatorType : uint8_t
{
	ETraceMarkOperatorType__None                                                     = 0,
	ETraceMarkOperatorType__Trace                                                    = 1,
	ETraceMarkOperatorType__Mark                                                     = 2,
	ETraceMarkOperatorType__All                                                      = 3,
	ETraceMarkOperatorType__InfomationTrace                                          = 4
};

/// Enum /Script/UAGame.ETraceableMarkType
/// Size: 0x01 (1 bytes)
enum class ETraceableMarkType : uint8_t
{
	ETraceableMarkType__None                                                         = 0,
	ETraceableMarkType__QuestPoint                                                   = 1,
	ETraceableMarkType__QuestArea                                                    = 2,
	ETraceableMarkType__ChaseActivity                                                = 3,
	ETraceableMarkType__Inventory                                                    = 4,
	ETraceableMarkType__InteractItem                                                 = 5,
	ETraceableMarkType__Area                                                         = 6,
	ETraceableMarkType__EscapePoint                                                  = 7,
	ETraceableMarkType__Character                                                    = 8,
	ETraceableMarkType__AISpawnArea                                                  = 9,
	ETraceableMarkType__SecretQuest                                                  = 10,
	ETraceableMarkType__Point                                                        = 11,
	ETraceableMarkType__DossEscapePoint                                              = 12,
	ETraceableMarkType__All                                                          = 13
};

/// Class /Script/UAGame.QuestDistributerBase
/// Size: 0x0008 (8 bytes) (0x000380 - 0x000388) align 8 pad: 0x0000
class AQuestDistributerBase : public AMFQuestDistributerBase
{ 
public:
	bool                                               bClearProgressWhenFinishGame;                               // 0x0380   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0381   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestDistributerBase.OnPrePlayerFinishGame
	// void OnPrePlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x35fae70] Final|Native|Public  
};

/// Class /Script/UAGame.AchievementBase
/// Size: 0x0008 (8 bytes) (0x000388 - 0x000390) align 8 pad: 0x0000
class AAchievementBase : public AQuestDistributerBase
{ 
public:
	int32_t                                            AchievementID;                                              // 0x0388   (0x0004)  
	bool                                               bSubAchievement;                                            // 0x038C   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x038D   (0x0003)  MISSED


	/// Functions
	// Function /Script/UAGame.AchievementBase.SetSubAchievement
	// void SetSubAchievement(bool bSub);                                                                                       // [0x35e70e0] Final|Native|Public  
	// Function /Script/UAGame.AchievementBase.SetAchievementID
	// void SetAchievementID(int32_t InAchievementID);                                                                          // [0x35e68d0] Final|Native|Public  
	// Function /Script/UAGame.AchievementBase.IsSubAchievement
	// bool IsSubAchievement();                                                                                                 // [0x35e6470] Final|Native|Public  
	// Function /Script/UAGame.AchievementBase.InitAchievement
	// void InitAchievement(int32_t InAchievementID, bool bSubAchieve);                                                         // [0x35e6270] Final|Native|Public  
	// Function /Script/UAGame.AchievementBase.GetAchievementID
	// int32_t GetAchievementID();                                                                                              // [0x35e5960] Final|Native|Public  
};

/// Class /Script/UAGame.AchievementSubsystem
/// Size: 0x00B0 (176 bytes) (0x000030 - 0x0000E0) align 8 pad: 0x0000
class UAchievementSubsystem : public UWorldSubsystem
{ 
public:
	unsigned char                                      UnknownData00_3[0x10];                                      // 0x0030   (0x0010)  MISSED
	SDK_UNDEFINED(80,2354) /* TMap<APlayerController*, FAchievementList> */ __um(Player2JoinInAchievements);       // 0x0040   (0x0050)  
	SDK_UNDEFINED(80,2355) /* TMap<uint32_t, AAchievementBase*> */ __um(AchievementID2Objects);                    // 0x0090   (0x0050)  


	/// Functions
	// Function /Script/UAGame.AchievementSubsystem.OnPlayerFinishGame
	// void OnPlayerFinishGame(class APlayerController* InPlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x35e65e0] Final|Native|Protected 
	// Function /Script/UAGame.AchievementSubsystem.OnBeginGameInit
	// void OnBeginGameInit();                                                                                                  // [0x35e64a0] Final|Native|Protected 
	// Function /Script/UAGame.AchievementSubsystem.InitAchievementProgresses
	// void InitAchievementProgresses(class APlayerController* InPlayerController, FAchievementList InAchievementList);         // [0x35e6340] Final|Native|Public  
	// Function /Script/UAGame.AchievementSubsystem.GetAchievementProgresses
	// TArray<FAchievementData> GetAchievementProgresses(class APlayerController* InPlayerController);                          // [0x35e5990] Final|Native|Public  
	// Function /Script/UAGame.AchievementSubsystem.Get
	// class UAchievementSubsystem* Get(class UObject* WorldContextObject);                                                     // [0x35e58d0] Final|Native|Static|Public 
};

/// Class /Script/UAGame.AssetsProfilingCommandlet
/// Size: 0x00C0 (192 bytes) (0x000080 - 0x000140) align 8 pad: 0x0000
class UAssetsProfilingCommandlet : public UCommandlet
{ 
public:
	unsigned char                                      UnknownData00_1[0xC0];                                      // 0x0080   (0x00C0)  MISSED
};

/// Class /Script/UAGame.AudioPropagateManager
/// Size: 0x0020 (32 bytes) (0x0002E0 - 0x000300) align 8 pad: 0x0000
class AAudioPropagateManager : public AActor
{ 
public:
	int32_t                                            VisibleNearistPortalNum;                                    // 0x02E0   (0x0004)  
	int32_t                                            InVisiblePortalNum;                                         // 0x02E4   (0x0004)  
	float                                              FadeCollisionRadius;                                        // 0x02E8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02EC   (0x0004)  MISSED
	TArray<class AActor*>                              AudioPortals;                                               // 0x02F0   (0x0010)  
};

/// Class /Script/UAGame.AutoTestActor
/// Size: 0x0000 (0 bytes) (0x0002F0 - 0x0002F0) align 8 pad: 0x0000
class AAutoTestActor : public AStaticMeshActor
{ 
public:
};

/// Struct /Script/UAGame.BigMapAreaTextureInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FBigMapAreaTextureInfo
{ 
	int32_t                                            AreaID;                                                     // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	class UTexture2D*                                  MapTexture;                                                 // 0x0008   (0x0008)  
};

/// Class /Script/UAGame.BigMapInfoActor
/// Size: 0x00B8 (184 bytes) (0x0002E0 - 0x000398) align 8 pad: 0x0000
class ABigMapInfoActor : public AActor
{ 
public:
	int32_t                                            MapID;                                                      // 0x02E0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02E4   (0x0004)  MISSED
	FString                                            ScriptLevelName;                                            // 0x02E8   (0x0010)  
	FVector                                            WorldCenter;                                                // 0x02F8   (0x000C)  
	FVector                                            MapTopLeftLocation;                                         // 0x0304   (0x000C)  
	FVector                                            WorldNorthAngleOffset;                                      // 0x0310   (0x000C)  
	FVector                                            WorldExtent;                                                // 0x031C   (0x000C)  
	class UTexture2D*                                  MapTexture;                                                 // 0x0328   (0x0008)  
	class UTexture2D*                                  Map2LTexture;                                               // 0x0330   (0x0008)  
	SDK_UNDEFINED(40,2356) /* TWeakObjectPtr<UTexture2D*> */ __um(CoreAreaTexturePath);                            // 0x0338   (0x0028)  
	int32_t                                            ScaleText;                                                  // 0x0360   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0364   (0x0004)  MISSED
	TArray<FBigMapAreaTextureInfo>                     MapAreaTextureInfos;                                        // 0x0368   (0x0010)  
	int32_t                                            UncompressedSize;                                           // 0x0378   (0x0004)  
	int32_t                                            CompressedSize;                                             // 0x037C   (0x0004)  
	int32_t                                            CoreWidth;                                                  // 0x0380   (0x0004)  
	int32_t                                            CoreHeight;                                                 // 0x0384   (0x0004)  
	TArray<char>                                       CompressedCoreAreaData;                                     // 0x0388   (0x0010)  
};

/// Class /Script/UAGame.CAAICharacter
/// Size: 0x0020 (32 bytes) (0x001990 - 0x0019B0) align 16 pad: 0x0000
class ACAAICharacter : public ASGAICharacter
{ 
public:
	uint32_t                                           AimingRotationOffset;                                       // 0x1990   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x1994   (0x000C)  MISSED
	bool                                               bUseInterpConstant;                                         // 0x19A0   (0x0001)  
	unsigned char                                      UnknownData01_7[0xF];                                       // 0x19A1   (0x000F)  MISSED


	/// Functions
	// Function /Script/UAGame.CAAICharacter.OnRep_AimingRotationOffset
	// void OnRep_AimingRotationOffset();                                                                                       // [0x35e66f0] Final|Native|Protected 
};

/// Class /Script/UAGame.CAAssembleEnvironment
/// Size: 0x0098 (152 bytes) (0x000838 - 0x0008D0) align 16 pad: 0x0000
class ACAAssembleEnvironment : public ASGWeaponAssembleEnvironment
{ 
public:
	float                                              ForceActiveTime;                                            // 0x0838   (0x0004)  
	float                                              RotateSpeed;                                                // 0x083C   (0x0004)  
	float                                              CameraPosXOffset;                                           // 0x0840   (0x0004)  
	float                                              CameraPosXRate;                                             // 0x0844   (0x0004)  
	float                                              WeaponOffsetRate;                                           // 0x0848   (0x0004)  
	float                                              WeaponOffset;                                               // 0x084C   (0x0004)  
	float                                              CamMaxRate;                                                 // 0x0850   (0x0004)  
	float                                              CamMinRate;                                                 // 0x0854   (0x0004)  
	class UDataTable*                                  CameraPosXOverrideConf;                                     // 0x0858   (0x0008)  
	class USceneComponent*                             RotateComp;                                                 // 0x0860   (0x0008)  
	class UMaterialInstanceDynamic*                    AssembleRTMaterial;                                         // 0x0868   (0x0008)  
	unsigned char                                      UnknownData00_6[0x28];                                      // 0x0870   (0x0028)  MISSED
	class UObject*                                     CacheImage;                                                 // 0x0898   (0x0008)  
	class ASGInventory*                                CacheInventory;                                             // 0x08A0   (0x0008)  
	unsigned char                                      UnknownData01_7[0x28];                                      // 0x08A8   (0x0028)  MISSED


	/// Functions
	// Function /Script/UAGame.CAAssembleEnvironment.SetItemWithImage
	// bool SetItemWithImage(class ASGInventory* InInventory, class UObject* Image);                                            // [0x35e6f10] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAAssembleEnvironment.OnScroll
	// void OnScroll(float Rate);                                                                                               // [0x35e6730] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAAssembleEnvironment.OnInputTouchPC
	// void OnInputTouchPC(TEnumAsByte<ETouchIndex> Handle, TEnumAsByte<ETouchType> Type, FVector& Location);                   // [0x35e64c0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/UAGame.CAAssembleEnvironment.ClearCache
	// void ClearCache();                                                                                                       // [0x35e56e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAAssembleEnvironment.CheckOnLoading
	// bool CheckOnLoading();                                                                                                   // [0x35e56b0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/UAGame.CABehaviorTreeComponent
/// Size: 0x0000 (0 bytes) (0x0002D8 - 0x0002D8) align 8 pad: 0x0000
class UCABehaviorTreeComponent : public UBehaviorTreeComponent
{ 
public:


	/// Functions
	// Function /Script/UAGame.CABehaviorTreeComponent.BP_ShouldAddToLog
	// bool BP_ShouldAddToLog(FString& NodeName, bool bPassed);                                                                 // [0x3a75280] Event|Protected|HasOutParms|BlueprintEvent|Const 
};

/// Class /Script/UAGame.CACharacterAIAimingComponent
/// Size: 0x0050 (80 bytes) (0x000230 - 0x000280) align 8 pad: 0x0000
class UCACharacterAIAimingComponent : public USGCharacterAIAimingComponent
{ 
public:
	unsigned char                                      UnknownData00_3[0x10];                                      // 0x0230   (0x0010)  MISSED
	class AActor*                                      TargetActor;                                                // 0x0240   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0248   (0x0018)  MISSED
	float                                              RotationOffsetInterpSpeed;                                  // 0x0260   (0x0004)  
	FVector                                            TargetPoint;                                                // 0x0264   (0x000C)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0270   (0x0004)  MISSED
	float                                              FocalProgressInInterpSpeed;                                 // 0x0274   (0x0004)  
	float                                              FocalProgressOutInterpSpeed;                                // 0x0278   (0x0004)  
	float                                              AOLimit;                                                    // 0x027C   (0x0004)  


	/// Functions
	// Function /Script/UAGame.CACharacterAIAimingComponent.OnRep_AimingTargetData
	// void OnRep_AimingTargetData();                                                                                           // [0x35e6710] Final|Native|Protected 
};

/// Class /Script/UAGame.UACharacterDeathComponent
/// Size: 0x0170 (368 bytes) (0x000720 - 0x000890) align 16 pad: 0x0000
class UUACharacterDeathComponent : public USGCharacterDeathComponent
{ 
public:
	class UClass*                                      RewardBoxClass;                                             // 0x0720   (0x0008)  
	int32_t                                            RewardBoxMaxExpandTimes;                                    // 0x0728   (0x0004)  
	int32_t                                            RewardBoxCurrentExpandTimes;                                // 0x072C   (0x0004)  
	int32_t                                            RewardBoxExpandRowsEveryTime;                               // 0x0730   (0x0004)  
	float                                              DelayDeathNiagaraTime;                                      // 0x0734   (0x0004)  
	class UNiagaraSystem*                              DeathNiagaraSystem;                                         // 0x0738   (0x0008)  
	class UMaterialInterface*                          NewParentMaterial;                                          // 0x0740   (0x0008)  
	SDK_UNDEFINED(80,2357) /* TMap<TWeakObjectPtr<UMaterialInterface*>, UMaterialInterface*> */ __um(OverrideParentMaterial); // 0x0748   (0x0050)  
	SDK_UNDEFINED(80,2358) /* TMap<FName, UTexture*> */ __um(DefaultTextureParameters);                            // 0x0798   (0x0050)  
	SDK_UNDEFINED(80,2359) /* TMap<FName, UCurveFloat*> */ __um(DeathMTCurve);                                     // 0x07E8   (0x0050)  
	float                                              DelaySpawnRewardBoxTime;                                    // 0x0838   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x083C   (0x0004)  MISSED
	TArray<EAttachPosition>                            PrioritySpawnItems;                                         // 0x0840   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            DeathMaterialInstanceDynamic;                               // 0x0850   (0x0010)  
	float                                              DeathEffectProgress;                                        // 0x0860   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0864   (0x0004)  MISSED
	class ASGInventory*                                RewardBox;                                                  // 0x0868   (0x0008)  
	bool                                               bPlayDeathEffect;                                           // 0x0870   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0871   (0x0007)  MISSED
	TArray<class AActor*>                              TemporaryHiddenAdapters;                                    // 0x0878   (0x0010)  
	unsigned char                                      UnknownData03_7[0x8];                                       // 0x0888   (0x0008)  MISSED


	/// Functions
	// Function /Script/UAGame.UACharacterDeathComponent.TestSpawnDeathBox
	// void TestSpawnDeathBox();                                                                                                // [0x3629220] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterDeathComponent.TestDeathEffect
	// void TestDeathEffect();                                                                                                  // [0x3629200] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterDeathComponent.SpawnRewardBox
	// void SpawnRewardBox();                                                                                                   // [0x36290c0] Final|Native|Public  
	// Function /Script/UAGame.UACharacterDeathComponent.SpawnDeathNiagara
	// void SpawnDeathNiagara();                                                                                                // [0x36290a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterDeathComponent.ShouldUseRewardBox
	// bool ShouldUseRewardBox();                                                                                               // [0x3628f40] Final|Native|Public  
	// Function /Script/UAGame.UACharacterDeathComponent.ShouldPlayMeltEffect
	// bool ShouldPlayMeltEffect();                                                                                             // [0x3628f10] Final|Native|Public  
	// Function /Script/UAGame.UACharacterDeathComponent.GetItemTreeAllGids
	// TArray<int64_t> GetItemTreeAllGids(class USGPlayerItemInfoBase* PlayerItemInfo);                                         // [0x36278b0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/UAGame.UACharacterDeathComponent.GetAllNewMaterialInstanceDynamic
	// TArray<UMaterialInstanceDynamic*> GetAllNewMaterialInstanceDynamic();                                                    // [0x3627760] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterDeathComponent.DiscardAIUniqueItems
	// void DiscardAIUniqueItems();                                                                                             // [0x3627680] Final|Native|Public  
	// Function /Script/UAGame.UACharacterDeathComponent.CreateExtraDropInventories
	// TArray<ASGInventory*> CreateExtraDropInventories();                                                                      // [0x3627600] Final|Native|Public  
	// Function /Script/UAGame.UACharacterDeathComponent.CanConvertToMoney
	// bool CanConvertToMoney(class ASGInventory* TargetInventory);                                                             // [0x3627430] Final|Native|Public  
};

/// Class /Script/UAGame.CACharacterAIDeathComponent
/// Size: 0x0000 (0 bytes) (0x000890 - 0x000890) align 16 pad: 0x0000
class UCACharacterAIDeathComponent : public UUACharacterDeathComponent
{ 
public:
};

/// Class /Script/UAGame.CACharacterAISignificanceComponent
/// Size: 0x0000 (0 bytes) (0x000178 - 0x000178) align 8 pad: 0x0000
class UCACharacterAISignificanceComponent : public USGCharacterSignificanceComponent
{ 
public:
};

/// Class /Script/UAGame.UACharacterStatics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UUACharacterStatics : public USGCharacterStatics
{ 
public:


	/// Functions
	// Function /Script/UAGame.UACharacterStatics.UseInventory
	// void UseInventory(class ASGCharacter* Character, class ASGInventory* Inventory);                                         // [0x362e400] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.SetupFesiableGrenadeThrowAngle
	// float SetupFesiableGrenadeThrowAngle(class AActor* AIActor, FVector& Location, float InitSpeed, bool bMustThrow, bool bHigherFirst, float& FlyingTime); // [0x362e190] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.SetShortcutInvBinding
	// void SetShortcutInvBinding(class ASGInventory* TargetShortcutInv, EAttachPosition TargetPos, class ACharacter* Character); // [0x362e000] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.SetItemOnMouseEnterCurrentItem
	// void SetItemOnMouseEnterCurrentItem(class ACharacter* Character, class ASGInventory* Inventory);                         // [0x362df40] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.SavePlayerMinimumEquipInfo
	// void SavePlayerMinimumEquipInfo(class ACharacter* Character);                                                            // [0x362dd20] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.SaveCharacterInventoryData
	// void SaveCharacterInventoryData(class ACharacter* Character);                                                            // [0x362dca0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.KillCharacter
	// void KillCharacter(class ACharacter* Character, class ACharacter* KillerCharacter);                                      // [0x362d8e0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.IsInventoryExist
	// bool IsInventoryExist(class ACharacter* Character, class ASGInventory* Inventory);                                       // [0x362d810] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.HasInventoryCount
	// bool HasInventoryCount(class ACharacter* Character, int64_t InventoryItemID, int32_t Count);                             // [0x362d620] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.HasInventory
	// bool HasInventory(class ACharacter* Character, int64_t InventoryItemID);                                                 // [0x362d550] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetWeaponItemID
	// int64_t GetWeaponItemID(class ASGCharacter* Character, char WeaponSwitchType);                                           // [0x362d440] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetShortCutInventory
	// class ASGInventory* GetShortCutInventory(EAttachPosition TargetPos, class ACharacter* Character);                        // [0x362d2f0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetQuickUseInventory
	// class ASGInventory* GetQuickUseInventory(class ACharacter* Character, int32_t UseIndex);                                 // [0x362d220] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetPlayerCharacterGID
	// int64_t GetPlayerCharacterGID(class ASGCharacter* Character);                                                            // [0x362d160] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetItemOnMouseEnterCurrentItem
	// class ASGInventory* GetItemOnMouseEnterCurrentItem(class ACharacter* Character);                                         // [0x362d030] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetCurrentEquipedArmorLevel
	// int32_t GetCurrentEquipedArmorLevel(class ASGCharacter* Character, ESGArmorType InArmorType);                            // [0x362cf30] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetCharacterID
	// int64_t GetCharacterID(class ASGCharacter* Character);                                                                   // [0x362ce70] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetArmorItemID
	// int64_t GetArmorItemID(class ASGCharacter* Character, char ArmorSlot);                                                   // [0x362cd70] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetAllOtherTeamMemberInventoryValue
	// float GetAllOtherTeamMemberInventoryValue(class ASGCharacter* Character, bool IsDied);                                   // [0x362cca0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.UACharacterStatics.GetAllInventoryValueTradeBringIn
	// float GetAllInventoryValueTradeBringIn(class ASGCharacter* Character, int32_t Precision);                                // [0x362cbd0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.UACharacterStatics.GetAllInventoryValueTrade
	// float GetAllInventoryValueTrade(class ASGCharacter* Character, int32_t Precision);                                       // [0x362cb00] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.UACharacterStatics.GetAllInventoryValueBringIn
	// float GetAllInventoryValueBringIn(class ASGCharacter* Character, int32_t Precision);                                     // [0x362ca30] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.UACharacterStatics.GetAllInventoryValue
	// float GetAllInventoryValue(class ASGCharacter* Character, int32_t Precision);                                            // [0x362c960] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.UACharacterStatics.GetAllInventoriesValue
	// float GetAllInventoriesValue(class ACharacter* Character);                                                               // [0x362c8d0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetAIPathGroupID
	// int64_t GetAIPathGroupID(class ASGCharacter* Character);                                                                 // [0x362c840] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetAIGivenRandomInventoryCountInfo
	// FString GetAIGivenRandomInventoryCountInfo(class ASGAICharacter* Character);                                             // [0x362c770] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.GetAICharacterID
	// int64_t GetAICharacterID(class ASGCharacter* Character);                                                                 // [0x362c6e0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.ForceKillCharacter
	// void ForceKillCharacter(class ACharacter* Character);                                                                    // [0x362c660] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.DiscardAll
	// void DiscardAll(class ASGCharacter* SGCharacter);                                                                        // [0x362c5c0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.DeferKillCharacter
	// void DeferKillCharacter(class ACharacter* Character, float DeferTime);                                                   // [0x362c500] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.CostInventoryComplex
	// bool CostInventoryComplex(class ACharacter* Character, int64_t InventoryItemID, int32_t Count);                          // [0x362c400] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.UACharacterStatics.CostInventory
	// bool CostInventory(class ACharacter* Character, int64_t InventoryItemID, int32_t Count);                                 // [0x362c300] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/UAGame.CACharacterStatics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UCACharacterStatics : public UUACharacterStatics
{ 
public:


	/// Functions
	// Function /Script/UAGame.CACharacterStatics.SetUseCustomRootYawOffsetMode
	// void SetUseCustomRootYawOffsetMode(class ACharacter* Character, bool bUseCustomRootYawOffsetMode, ERootYawOffsetMode CustomRootYawOffsetMode); // [0x35e72a0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CACharacterStatics.GetCurrentSpeedOfAngle0
	// float GetCurrentSpeedOfAngle0(class ACharacter* Character);                                                              // [0x35e5d90] Final|Native|Static|Public 
	// Function /Script/UAGame.CACharacterStatics.GetCurrentMaxSpeedOfAngle0
	// float GetCurrentMaxSpeedOfAngle0(class ACharacter* Character);                                                           // [0x35e5d00] Final|Native|Static|Public 
	// Function /Script/UAGame.CACharacterStatics.FakeHitCharacter
	// void FakeHitCharacter(class AActor* InDamageCauser, class ACharacter* InCharacter, float InDamage, float InMomentum, EHitGroupType InHitGroup, bool bCameraShake); // [0x35e5700] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CACharacterStatics.CheckLootDistance
	// bool CheckLootDistance(class ASGCharacter* Character, class AActor* Target);                                             // [0x35e55e0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CACharacterStatics.CanVault
	// bool CanVault(class ACharacter* Character);                                                                              // [0x35e5550] Final|Native|Static|Public 
};

/// Class /Script/UAGame.CAClimateRain
/// Size: 0x0010 (16 bytes) (0x0004F0 - 0x000500) align 16 pad: 0x0000
class ACAClimateRain : public AUAMFClimateRain
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x04F0   (0x0010)  MISSED
};

/// Class /Script/UAGame.CAGameUserSettings
/// Size: 0x0120 (288 bytes) (0x000260 - 0x000380) align 8 pad: 0x0000
class UCAGameUserSettings : public USGGameUserSettings
{ 
public:
	FString                                            LanguageString;                                             // 0x0260   (0x0010)  
	bool                                               IsAdviseOpen;                                               // 0x0270   (0x0001)  
	bool                                               IsPrivacyOpen;                                              // 0x0271   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0272   (0x0006)  MISSED
	SDK_UNDEFINED(80,2360) /* TMap<FString, int32_t> */ __um(UIShowType);                                          // 0x0278   (0x0050)  
	SDK_UNDEFINED(80,2361) /* TMap<FString, bool> */   __um(BoolValue);                                            // 0x02C8   (0x0050)  
	int32_t                                            VoiceMode;                                                  // 0x0318   (0x0004)  
	int32_t                                            CustomGraphcisMode;                                         // 0x031C   (0x0004)  
	int32_t                                            FocusTaskID;                                                // 0x0320   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0324   (0x0004)  MISSED
	SDK_UNDEFINED(80,2362) /* TMap<int32_t, float> */  __um(FocusTaskTargetProgress);                              // 0x0328   (0x0050)  
	bool                                               bInfiniteAmmo;                                              // 0x0378   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x0379   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.CAGameUserSettings.SetVoiceMode
	// void SetVoiceMode(int32_t Value);                                                                                        // [0x35e73b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetUIShowType
	// void SetUIShowType(FString Key, int32_t Value);                                                                          // [0x35e7170] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetLanguage
	// void SetLanguage(FString Value);                                                                                         // [0x35e6fe0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetIsPrivacyOpen
	// void SetIsPrivacyOpen(bool Value);                                                                                       // [0x35e6e80] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetIsAdviseOpen
	// void SetIsAdviseOpen(bool Value);                                                                                        // [0x35e6df0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetInfiniteAmmo
	// void SetInfiniteAmmo(bool Value);                                                                                        // [0x35e6d60] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetFocusTaskTargetProgress
	// void SetFocusTaskTargetProgress(int32_t TargetId, float Progress);                                                       // [0x35e6c90] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetFocusTaskID
	// void SetFocusTaskID(int32_t Value);                                                                                      // [0x35e6c00] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetCustomGraphcisMode
	// void SetCustomGraphcisMode(int32_t Value);                                                                               // [0x35e6b70] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.SetBoolValue
	// void SetBoolValue(FString Key, bool Value);                                                                              // [0x35e6960] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.GetVoiceMode
	// int32_t GetVoiceMode();                                                                                                  // [0x35e6240] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.CAGameUserSettings.GetUIShowType
	// int32_t GetUIShowType(FString Key);                                                                                      // [0x35e6140] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.CAGameUserSettings.GetLanguage
	// FString GetLanguage();                                                                                                   // [0x35e6030] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.GetIsPrivacyOpen
	// bool GetIsPrivacyOpen();                                                                                                 // [0x35e6000] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.CAGameUserSettings.GetIsAdviseOpen
	// bool GetIsAdviseOpen();                                                                                                  // [0x35e5fd0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.CAGameUserSettings.GetInfiniteAmmo
	// bool GetInfiniteAmmo();                                                                                                  // [0x35e5fa0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.GetFocusTaskTargetProgress
	// float GetFocusTaskTargetProgress(int32_t TargetId);                                                                      // [0x35e5f00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.CAGameUserSettings.GetFocusTaskID
	// int32_t GetFocusTaskID();                                                                                                // [0x35e5ed0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.CAGameUserSettings.GetDefaultLanguage
	// FString GetDefaultLanguage();                                                                                            // [0x35e5e50] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.CAGameUserSettings.GetCustomGraphcisMode
	// int32_t GetCustomGraphcisMode();                                                                                         // [0x35e5e20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.CAGameUserSettings.GetBoolValue
	// bool GetBoolValue(FString Key);                                                                                          // [0x35e5a70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/UAGame.CAHUDStatics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UCAHUDStatics : public USGHUDStatics
{ 
public:


	/// Functions
	// Function /Script/UAGame.CAHUDStatics.SetCAImage
	// void SetCAImage(class UImage* Image, class UObject* icon);                                                               // [0x35e6ab0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CAHUDStatics.ProjectScopePosToScreenPosition
	// void ProjectScopePosToScreenPosition(class APlayerController* PC, FVector2D& ScopeMaterialPos, FVector2D& OutScreenPos); // [0x35e67b0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/UAGame.CAHUDStatics.GetProgressDynamicMaterial
	// class UMaterialInstanceDynamic* GetProgressDynamicMaterial(class UProgressBar* ProgressBar);                             // [0x35e60b0] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/UAGame.CAInputComponent
/// Size: 0x0000 (0 bytes) (0x000180 - 0x000180) align 8 pad: 0x0000
class UCAInputComponent : public UInputComponent
{ 
public:
};

/// Class /Script/UAGame.CALobbyInputHandleComponent
/// Size: 0x0008 (8 bytes) (0x0000F8 - 0x000100) align 8 pad: 0x0000
class UCALobbyInputHandleComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x00F8   (0x0008)  MISSED
};

/// Class /Script/UAGame.CAMessageEvents
/// Size: 0x0088 (136 bytes) (0x000028 - 0x0000B0) align 8 pad: 0x0000
class UCAMessageEvents : public USGGameInstanceComponent
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x0028   (0x0008)  MISSED
	SDK_UNDEFINED(16,2363) /* FMulticastInlineDelegate */ __um(QuickChat);                                         // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2364) /* FMulticastInlineDelegate */ __um(SpeakingRouletteX);                                 // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2365) /* FMulticastInlineDelegate */ __um(SpeakingRouletteY);                                 // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2366) /* FMulticastInlineDelegate */ __um(OnAwardExp);                                        // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2367) /* FMulticastInlineDelegate */ __um(ThrowGrenadeInventory);                             // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2368) /* FMulticastInlineDelegate */ __um(JumpInputActionEvent);                              // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2369) /* FMulticastInlineDelegate */ __um(CloseRouletteActionEvent);                          // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2370) /* FMulticastInlineDelegate */ __um(OpenRouletteActionEvent);                           // 0x00A0   (0x0010)  


	/// Functions
	// Function /Script/UAGame.CAMessageEvents.GetCAMessageEvents
	// class UCAMessageEvents* GetCAMessageEvents(class UObject* InWorldContextObject);                                         // [0x35e5b70] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/UAGame.CANPCAIBehaviorHistoryDebugComponent
/// Size: 0x0080 (128 bytes) (0x000108 - 0x000188) align 8 pad: 0x0000
class UCANPCAIBehaviorHistoryDebugComponent : public UNPCAISubSystemComponent
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x0108   (0x0008)  MISSED
	SDK_UNDEFINED(80,2371) /* TMap<char, int32_t> */   __um(DecisionCounter);                                      // 0x0110   (0x0050)  
	FName                                              BBKey_Dec_CrossFireDecision;                                // 0x0160   (0x0008)  
	TArray<class APlayerController*>                   MarkedPlayerController;                                     // 0x0168   (0x0010)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0178   (0x0004)  MISSED
	int32_t                                            MaxHistorySize;                                             // 0x017C   (0x0004)  
	class UCABehaviorTreeComponent*                    BehaviorComp;                                               // 0x0180   (0x0008)  


	/// Functions
	// Function /Script/UAGame.CANPCAIBehaviorHistoryDebugComponent.OnKilledHandle
	// void OnKilledHandle(class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, FDamageEvent& DamageEvent, class AActor* KillerWeapon, float KillDistance, ECharacterEnduranceType EnduranceType, class UDamageEventObject* DamageEventObject); // [0x35ec740] Final|Native|Protected|HasOutParms 
	// Function /Script/UAGame.CANPCAIBehaviorHistoryDebugComponent.BP_LogMakeDecision
	// FString BP_LogMakeDecision(class ASGAIController* AIController, class ACAAICharacter* AICharacter, class UBlackboardComponent* BlackboardComponent); // [0x3a75280] Event|Public|BlueprintEvent 
	// Function /Script/UAGame.CANPCAIBehaviorHistoryDebugComponent.BP_LogInitialization
	// FString BP_LogInitialization(class ASGAIController* AIController, class ACAAICharacter* AICharacter);                    // [0x3a75280] Event|Public|BlueprintEvent 
};

/// Class /Script/UAGame.CAPCAimingComponent
/// Size: 0x0018 (24 bytes) (0x0001C8 - 0x0001E0) align 8 pad: 0x0000
class UCAPCAimingComponent : public USGPCAimingComponent
{ 
public:
	float                                              AimingProritySwitchDesire;                                  // 0x01C8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x01CC   (0x0004)  MISSED
	class AActor*                                      CurrentAimingActor;                                         // 0x01D0   (0x0008)  
	class AActor*                                      CachedInteractableItem;                                     // 0x01D8   (0x0008)  


	/// Functions
	// Function /Script/UAGame.CAPCAimingComponent.GetCurrentAimingActor
	// class AActor* GetCurrentAimingActor();                                                                                   // [0x35ebde0] Final|Native|Public|Const 
};

/// Struct /Script/UAGame.ActionContext
/// Size: 0x0002 (2 bytes) (0x000000 - 0x000002) align 1 pad: 0x0000
struct FActionContext
{ 
	unsigned char                                      UnknownData00_2[0x2];                                       // 0x0000   (0x0002)  MISSED
};

/// Class /Script/UAGame.CAPCInputHandleComponent
/// Size: 0x0178 (376 bytes) (0x000158 - 0x0002D0) align 8 pad: 0x0000
class UCAPCInputHandleComponent : public USGPCInputHandleComponent
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x0158   (0x0008)  MISSED
	FString                                            LocalizationKey_CannotProne_UsingItem;                      // 0x0160   (0x0010)  
	SDK_UNDEFINED(80,2372) /* TMap<FString, FMessageIDInfo> */ __um(OperationBlockMessages);                       // 0x0170   (0x0050)  
	SDK_UNDEFINED(80,2373) /* TMap<FName, FActionDefine> */ __um(ActionContextMapping);                            // 0x01C0   (0x0050)  
	SDK_UNDEFINED(80,2374) /* TMap<EActionContext, FSubContextGroup> */ __um(SubContextDefine);                    // 0x0210   (0x0050)  
	TArray<FActionContext>                             InpuContextStack;                                           // 0x0260   (0x0010)  
	unsigned char                                      UnknownData01_6[0x58];                                      // 0x0270   (0x0058)  MISSED
	float                                              HoldTime;                                                   // 0x02C8   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x02CC   (0x0004)  MISSED


	/// Functions
	// Function /Script/UAGame.CAPCInputHandleComponent.SetActionType
	// void SetActionType(FName ActionName, EOperationKeyStyle Type);                                                           // [0x35eda70] Final|Native|Public  
	// Function /Script/UAGame.CAPCInputHandleComponent.RouletteCancle
	// void RouletteCancle();                                                                                                   // [0x35eda50] Final|Native|Public  
	// Function /Script/UAGame.CAPCInputHandleComponent.RemoveBind
	// void RemoveBind(FName ActionName);                                                                                       // [0x35ed4b0] Final|Native|Public  
	// Function /Script/UAGame.CAPCInputHandleComponent.QuickHealActionReleased
	// void QuickHealActionReleased();                                                                                          // [0x35ed490] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.QuickHealActionHeld
	// void QuickHealActionHeld();                                                                                              // [0x35ed470] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.OnThrowWeaponFireCanBeHold
	// void OnThrowWeaponFireCanBeHold(class ASGCharacter* Character, bool bIsStart, class ASGInventory* ThrowWeapon);          // [0x35ed360] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.OnThrowWeaponFire
	// void OnThrowWeaponFire(class ASGCharacter* Character, bool bIsStart, class ASGInventory* ThrowWeapon);                   // [0x35ed250] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.OnRepPawn
	// void OnRepPawn(class APlayerController* PlayerController, class APawn* Pawn);                                            // [0x35eca60] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.OnLookAroundChanged
	// void OnLookAroundChanged(bool bEnabled);                                                                                 // [0x35ec9d0] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.OnCurrentWeaponChanged
	// void OnCurrentWeaponChanged(class ASGWeapon* Weapon, FString WeaponName, class ASGWeapon* OldWeapon);                    // [0x35ec4b0] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.OnCharacterZoomChanged
	// void OnCharacterZoomChanged(bool bIsZooming);                                                                            // [0x35ec420] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.OnBagOpenEvent
	// void OnBagOpenEvent();                                                                                                   // [0x35ec2e0] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.OnBagCloseEvent
	// void OnBagCloseEvent();                                                                                                  // [0x35ec2c0] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.GrenadeActionReleased
	// void GrenadeActionReleased();                                                                                            // [0x35ec020] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.GrenadeActionHeld
	// void GrenadeActionHeld();                                                                                                // [0x35ec000] Final|Native|Protected 
	// Function /Script/UAGame.CAPCInputHandleComponent.ChangeBindType_ToggleLeanRight
	// void ChangeBindType_ToggleLeanRight(EOperationKeyStyle ActionType);                                                      // [0x35eb490] Final|Native|Public  
	// Function /Script/UAGame.CAPCInputHandleComponent.ChangeBindType_ToggleLeanLeft
	// void ChangeBindType_ToggleLeanLeft(EOperationKeyStyle ActionType);                                                       // [0x35eb410] Final|Native|Public  
	// Function /Script/UAGame.CAPCInputHandleComponent.ChangeBindType_ToggleCrouch
	// void ChangeBindType_ToggleCrouch(EOperationKeyStyle ActionType);                                                         // [0x35eb390] Final|Native|Public  
	// Function /Script/UAGame.CAPCInputHandleComponent.ChangeBindType_ToggleAim
	// void ChangeBindType_ToggleAim(EOperationKeyStyle ActionType);                                                            // [0x35eb310] Final|Native|Public  
	// Function /Script/UAGame.CAPCInputHandleComponent.ChangeBindType_Sprint
	// void ChangeBindType_Sprint(EOperationKeyStyle ActionType);                                                               // [0x35eb290] Final|Native|Public  
	// Function /Script/UAGame.CAPCInputHandleComponent.ChangeBindType_SilentWalk
	// void ChangeBindType_SilentWalk(EOperationKeyStyle ActionType);                                                           // [0x35eb210] Final|Native|Public  
};

/// Class /Script/UAGame.CAPlayerInput
/// Size: 0x0000 (0 bytes) (0x000698 - 0x000698) align 8 pad: 0x0000
class UCAPlayerInput : public UMFPCPlayerInput
{ 
public:
};

/// Class /Script/UAGame.CAPlayerInputStatics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UCAPlayerInputStatics : public USGPlayerInputStatics
{ 
public:


	/// Functions
	// Function /Script/UAGame.CAPlayerInputStatics.RemoveInputContext
	// void RemoveInputContext(class APlayerController* PC, EActionContext Context);                                            // [0x35ed540] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.IsHoldShift
	// bool IsHoldShift(class APlayerController* PC);                                                                           // [0x35ec230] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.IsHoldCtrl
	// bool IsHoldCtrl(class APlayerController* PC);                                                                            // [0x35ec1a0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.IsHoldAlt
	// bool IsHoldAlt(class APlayerController* PC);                                                                             // [0x35ec110] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.IsAxisAction
	// bool IsAxisAction(FName InActionName, float AxisScale);                                                                  // [0x35ec040] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.GetKeyModifierText
	// FText GetKeyModifierText(FInputActionKeyMapping& InputKeyMapping);                                                       // [0x35ebe40] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.GetActionKeyName
	// FText GetActionKeyName(FName InActionName, bool bGetFName);                                                              // [0x35eb820] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.GetActionKeyMapping
	// FInputActionKeyMapping GetActionKeyMapping(FName InActionName, float AxisScale);                                         // [0x35eb680] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.EnableInputAction
	// void EnableInputAction(class APlayerController* PC, FName& ActionName, bool bEnable);                                    // [0x35eb560] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/UAGame.CAPlayerInputStatics.AddInputContext
	// void AddInputContext(class APlayerController* PC, EActionContext Context);                                               // [0x35eafd0] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/UAGame.CAQuestHUD
/// Size: 0x0050 (80 bytes) (0x000288 - 0x0002D8) align 8 pad: 0x0000
class UCAQuestHUD : public UUserWidget
{ 
public:
	SDK_UNDEFINED(80,2375) /* TMap<int32_t, UUserWidget*> */ __um(QuestWidget);                                    // 0x0288   (0x0050)  


	/// Functions
	// Function /Script/UAGame.CAQuestHUD.RemoveQuestWidget
	// void RemoveQuestWidget(int32_t Messageid, bool IsRemoveWidget);                                                          // [0x35ed820] Native|Event|Public|BlueprintEvent 
	// Function /Script/UAGame.CAQuestHUD.ClearQuestWidget
	// void ClearQuestWidget();                                                                                                 // [0x28617c0] Native|Event|Public|BlueprintEvent 
	// Function /Script/UAGame.CAQuestHUD.AddQuestWidget
	// void AddQuestWidget(class UUserWidget* Widget, int32_t Messageid);                                                       // [0x35eb090] Native|Event|Public|BlueprintEvent 
};

/// Class /Script/UAGame.CATargetMonitorComponent
/// Size: 0x0030 (48 bytes) (0x000600 - 0x000630) align 16 pad: 0x0000
class UCATargetMonitorComponent : public UBoxComponent
{ 
public:
	SDK_UNDEFINED(8,2376) /* TWeakObjectPtr<AActor*> */ __um(MonitorActor);                                        // 0x0600   (0x0008)  
	SDK_UNDEFINED(8,2377) /* TWeakObjectPtr<UCATargetMonitorWidget*> */ __um(MonitorWidget);                       // 0x0608   (0x0008)  
	TArray<FVector>                                    HitHistory;                                                 // 0x0610   (0x0010)  
	bool                                               bValidHit;                                                  // 0x0620   (0x0001)  
	unsigned char                                      UnknownData00_7[0xF];                                       // 0x0621   (0x000F)  MISSED


	/// Functions
	// Function /Script/UAGame.CATargetMonitorComponent.OnSilhouetteTargetTakeDamage
	// void OnSilhouetteTargetTakeDamage(class AController* Causer, float AttemptedDamage, float ActuralDamage, FVector Momentum, class AActor* HitArmor, FSGPointDamageEvent& DamageEvent, class AActor* DamageCauser, class UDamageEventObject* DamageEventObject, bool bHitPenetrateArmor); // [0x35ecf30] Final|Native|Private|HasOutParms|HasDefaults 
	// Function /Script/UAGame.CATargetMonitorComponent.OnSilhouetteTargetPostTakeDamage
	// void OnSilhouetteTargetPostTakeDamage(class AController* Causer, float AttemptedDamage, float Damage, FVector Momentum, class AActor* HitArmor, FDamageEvent& DamageEvent, class AActor* DamageCauser, EHitGroupType HitGroup); // [0x35ecc90] Final|Native|Private|HasOutParms|HasDefaults 
	// Function /Script/UAGame.CATargetMonitorComponent.OnRingTargetTakeDamage
	// void OnRingTargetTakeDamage(class ASGRangeTargetBase* TargetActor, int32_t Score, int32_t DamageType, FVector& HitLocation); // [0x35ecb30] Final|Native|Private|HasOutParms|HasDefaults 
	// Function /Script/UAGame.CATargetMonitorComponent.OnCharacterPreDie
	// void OnCharacterPreDie(class AController* Killer, class UDamageEventObject* DamageEventObject, bool& bWantToDie);        // [0x35ec300] Final|Native|Private|HasOutParms 
	// Function /Script/UAGame.CATargetMonitorComponent.GetHitHistory
	// TArray<FVector> GetHitHistory();                                                                                         // [0x35ebe10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.CATargetMonitorComponent.ClearHitHistory
	// void ClearHitHistory();                                                                                                  // [0x35eb510] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/UAGame.CATargetMonitorWidget
/// Size: 0x0018 (24 bytes) (0x0002D0 - 0x0002E8) align 8 pad: 0x0000
class UCATargetMonitorWidget : public USGUserWidget
{ 
public:
	TArray<class UCATargetMonitorComponent*>           TargetMonitorComponentList;                                 // 0x02D0   (0x0010)  
	class UWidgetComponent*                            OwnerWidgetComponent;                                       // 0x02E0   (0x0008)  


	/// Functions
	// Function /Script/UAGame.CATargetMonitorWidget.OnTargetTakeDamage
	// void OnTargetTakeDamage(class UCATargetMonitorComponent* TargetComponent);                                               // [0x3a75280] Event|Public|BlueprintEvent 
	// Function /Script/UAGame.CATargetMonitorWidget.NotifyPostHitInfo
	// void NotifyPostHitInfo(class UCATargetMonitorComponent* TargetComponent, class AActor* TargetActor, class AController* Causer, float AttemptedDamage, float ActuralDamage, FVector Momentum, class AActor* HitArmor, FDamageEvent& DamageEvent, class AActor* DamageCauser, EHitGroupType HitGroup); // [0x3a75280] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/UAGame.CATargetMonitorWidget.NotifyHitInfo
	// void NotifyHitInfo(class UCATargetMonitorComponent* TargetComponent, class AActor* TargetActor, class AController* Causer, float AttemptedDamage, float ActuralDamage, FVector Momentum, class AActor* HitArmor, FSGPointDamageEvent& DamageEvent, class AActor* DamageCauser, class UDamageEventObject* DamageEventObject, bool bHitPenetrateArmor, class UObject* DefaultAmmoObject); // [0x3a75280] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/UAGame.CATargetMonitorWidget.NotifyCharacterPreDie
	// void NotifyCharacterPreDie(class UCATargetMonitorComponent* TargetComponent, class AController* Killer, class UDamageEventObject* DamageEventObject, bool& bWantToDie); // [0x3a75280] Event|Public|HasOutParms|BlueprintEvent 
};

/// Class /Script/UAGame.CAUserWidget_Decorator
/// Size: 0x0000 (0 bytes) (0x000288 - 0x000288) align 8 pad: 0x0000
class UCAUserWidget_Decorator : public UUserWidget
{ 
public:


	/// Functions
	// Function /Script/UAGame.CAUserWidget_Decorator.SetTextContent
	// void SetTextContent(FString Text);                                                                                       // [0x3a75280] Event|Public|BlueprintEvent 
};

/// Class /Script/UAGame.CAUserWidget_DebugTeammateInfo
/// Size: 0x0098 (152 bytes) (0x0002D0 - 0x000368) align 8 pad: 0x0000
class UCAUserWidget_DebugTeammateInfo : public USGUserWidget
{ 
public:
	bool                                               bStartDebug;                                                // 0x02D0   (0x0001)  
	bool                                               bUsingSceneCapture;                                         // 0x02D1   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x02D2   (0x0002)  MISSED
	FScopeRangeForTeammateIcon                         ScopeRange;                                                 // 0x02D4   (0x002C)  
	FVector2D                                          MaterialPoint;                                              // 0x0300   (0x0008)  
	FVector2D                                          ScreenPointInside;                                          // 0x0308   (0x0008)  
	FVector2D                                          ScreenPointOutside;                                         // 0x0310   (0x0008)  
	FBox2D                                             ShowRange;                                                  // 0x0318   (0x0014)  
	FBox2D                                             HideRange;                                                  // 0x032C   (0x0014)  
	FBox2D                                             MaterialRange;                                              // 0x0340   (0x0014)  
	bool                                               bInsideScope;                                               // 0x0354   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0355   (0x0003)  MISSED
	float                                              ScopeRadius;                                                // 0x0358   (0x0004)  
	float                                              LocationZ;                                                  // 0x035C   (0x0004)  
	float                                              DebugLocationZ;                                             // 0x0360   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x0364   (0x0004)  MISSED
};

/// Class /Script/UAGame.CAUserWidget_TeammateInfo
/// Size: 0x0018 (24 bytes) (0x0002D0 - 0x0002E8) align 8 pad: 0x0000
class UCAUserWidget_TeammateInfo : public USGUserWidget
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x02D0   (0x0008)  MISSED
	class UClass*                                      DebugWidgetClass;                                           // 0x02D8   (0x0008)  
	float                                              ZoomingThreshold;                                           // 0x02E0   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x02E4   (0x0004)  MISSED


	/// Functions
	// Function /Script/UAGame.CAUserWidget_TeammateInfo.UpdateTeammateIconPos
	// void UpdateTeammateIconPos(class APlayerController* PC, class APlayerState* LocalPS, class ACharacter* SpectCharacter, class UWidgetSwitcher* HealthBarSwitcher, class UCanvasPanel* InfoCanvas, class UTextBlock* PlayerNameText, class UImage* Image, int32_t Index, class UPanelSlot* PanelSlot, bool bDBNO, float WorldOffsetZDBNO, float InfoOffsetX, float InfoOffsetYDBNO, float WorldOffsetZ, float InfoOffsetY, float Opac, class UWidgetSwitcher* ValuablesSwitcher, float EffectDistance, float OpacRadius, float MinOpac, class UImage* MentorImage, class UImage* PupilImage, FRuntimeFloatCurve& DistanceOpacityCurve); // [0x35ee260] Final|Native|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/UAGame.CAWeaponRenderView
/// Size: 0x0090 (144 bytes) (0x0007A0 - 0x000830) align 8 pad: 0x0000
class ACAWeaponRenderView : public ASGWeaponRenderView
{ 
public:
	float                                              RotateSpeed;                                                // 0x07A0   (0x0004)  
	float                                              CamBasePosX;                                                // 0x07A4   (0x0004)  
	float                                              CamBasePosY;                                                // 0x07A8   (0x0004)  
	float                                              CamOffsetScale;                                             // 0x07AC   (0x0004)  
	float                                              CamDistanceScale;                                           // 0x07B0   (0x0004)  
	float                                              CamChangeSpeedX;                                            // 0x07B4   (0x0004)  
	float                                              AutoRotateSpeed;                                            // 0x07B8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x07BC   (0x0004)  MISSED
	class UDataTable*                                  RotatorConf;                                                // 0x07C0   (0x0008)  
	unsigned char                                      UnknownData01_7[0x68];                                      // 0x07C8   (0x0068)  MISSED


	/// Functions
	// Function /Script/UAGame.CAWeaponRenderView.UpdateSocketPC
	// void UpdateSocketPC(FName SocketName, TArray<FAdapterInfo> SocketPath, class ASGInventory* InInventory);                 // [0x35ee090] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.StopRenderPC
	// bool StopRenderPC(bool bResetMesh, bool KeepRotation);                                                                   // [0x35edfb0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.CAWeaponRenderView.SetResetRotator
	// void SetResetRotator(bool bReset);                                                                                       // [0x35edf20] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.SetOutlineSocket
	// void SetOutlineSocket(FName SocketName, TArray<FAdapterInfo> SocketPath);                                                // [0x35edd80] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.SetIsInOverview
	// void SetIsInOverview(bool bInOverview);                                                                                  // [0x35edcf0] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.SetIsFullScreen
	// void SetIsFullScreen(bool isFullScreen);                                                                                 // [0x35edc60] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.SetCamLoc
	// void SetCamLoc(FVector Loc);                                                                                             // [0x35edbd0] Final|Native|Public|HasDefaults 
	// Function /Script/UAGame.CAWeaponRenderView.SetCamActor
	// void SetCamActor(class ACameraActor* Cam);                                                                               // [0x35edb40] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.RenderWeaponPC
	// void RenderWeaponPC(class ASGInventory* InInventory);                                                                    // [0x35ed9c0] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.RenderNewWeaponPC
	// void RenderNewWeaponPC(class ASGInventory* InInventory, bool KeepTrans);                                                 // [0x35ed8f0] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.RemoveItemPC
	// void RemoveItemPC(FName SocketName, TArray<FAdapterInfo> SocketPath, bool bRemoveAll, bool bShouldRemoveSocket);         // [0x35ed600] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.OnInputTouchPC
	// void OnInputTouchPC(TEnumAsByte<ETouchIndex> Handle, TEnumAsByte<ETouchType> Type, FVector& Location);                   // [0x35ec620] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/UAGame.CAWeaponRenderView.GetBaseMeshLoc
	// FVector GetBaseMeshLoc();                                                                                                // [0x35ebda0] Final|Native|Public|HasDefaults 
	// Function /Script/UAGame.CAWeaponRenderView.GetAssembleInfo
	// FWeaponAssembleEnvironmentInfo GetAssembleInfo(FName SocketName, TArray<FAdapterInfo> SocketPath);                       // [0x35eb950] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.ClearSocketOutline
	// void ClearSocketOutline();                                                                                               // [0x35eb540] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.CalSocketInfo
	// void CalSocketInfo();                                                                                                    // [0x35eb1f0] Final|Native|Public  
	// Function /Script/UAGame.CAWeaponRenderView.AutoMoveCam
	// void AutoMoveCam(bool automove);                                                                                         // [0x35eb160] Final|Native|Public  
};

/// Class /Script/UAGame.CAWeaponStatics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UCAWeaponStatics : public USGWeaponStatics
{ 
public:


	/// Functions
	// Function /Script/UAGame.CAWeaponStatics.StopRenderModelPC
	// bool StopRenderModelPC(class ACAWeaponRenderView* Env);                                                                  // [0x35f3340] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.CAWeaponStatics.RemoveItemPC
	// bool RemoveItemPC(class ACAWeaponRenderView* Env, FName SocketName, TArray<FAdapterInfo> SocketPath, bool bRemoveAll, bool bShouleRemoveSocket); // [0x35f2f80] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/UAGame.CompetitionHUD
/// Size: 0x0028 (40 bytes) (0x0004E0 - 0x000508) align 8 pad: 0x0000
class ACompetitionHUD : public ASGHUD
{ 
public:
	SDK_UNDEFINED(16,2378) /* TArray<TWeakObjectPtr<UClass*>> */ __um(CompetitionPlayerComponentClasses);          // 0x04E0   (0x0010)  
	SDK_UNDEFINED(16,2379) /* TArray<TWeakObjectPtr<UClass*>> */ __um(OBPlayerComponentClasses);                   // 0x04F0   (0x0010)  
	bool                                               bCreate;                                                    // 0x0500   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0501   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.CompetitionHUD.RequestAsyncLoadWidgets
	// void RequestAsyncLoadWidgets(TArray<TWeakObjectPtr<UClass*>>& TempComponentClasses);                                     // [0x35f31e0] Final|Native|Public|HasOutParms 
	// Function /Script/UAGame.CompetitionHUD.OnPlayerIdentityTypeChange
	// void OnPlayerIdentityTypeChange(class ASGPlayerState* PS);                                                               // [0x35f2af0] Final|Native|Public  
};

/// Class /Script/UAGame.DSTestGameMode
/// Size: 0x0030 (48 bytes) (0x000448 - 0x000478) align 8 pad: 0x0000
class ADSTestGameMode : public ASGGameMode
{ 
public:
	class UClass*                                      AICharacterClass;                                           // 0x0448   (0x0008)  
	class UClass*                                      AIControllerClass;                                          // 0x0450   (0x0008)  
	class UBehaviorTree*                               BehaviorTreeTemplate;                                       // 0x0458   (0x0008)  
	int32_t                                            AIMaxCount;                                                 // 0x0460   (0x0004)  
	int32_t                                            SpawnAIRadius;                                              // 0x0464   (0x0004)  
	FVector                                            CenterPoint;                                                // 0x0468   (0x000C)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0474   (0x0004)  MISSED
};

/// Class /Script/UAGame.DZPCInputHandleComponent
/// Size: 0x0000 (0 bytes) (0x000158 - 0x000158) align 8 pad: 0x0000
class UDZPCInputHandleComponent : public USGPCInputHandleComponent
{ 
public:
};

/// Class /Script/UAGame.UAPCUIModeComponent
/// Size: 0x0018 (24 bytes) (0x000108 - 0x000120) align 8 pad: 0x0000
class UUAPCUIModeComponent : public USGPCUIModeComponent
{ 
public:
	bool                                               bOperationResultOpened;                                     // 0x0108   (0x0001)  
	bool                                               bShowMessageBox;                                            // 0x0109   (0x0001)  
	bool                                               bModalBoxOpen;                                              // 0x010A   (0x0001)  
	bool                                               bLoadingPanel;                                              // 0x010B   (0x0001)  
	bool                                               ForceDisableBagStateChange;                                 // 0x010C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x010D   (0x0001)  MISSED
	bool                                               bPreparationsOpened;                                        // 0x010E   (0x0001)  
	bool                                               bMainMenuOpened;                                            // 0x010F   (0x0001)  
	bool                                               bBagOpened;                                                 // 0x0110   (0x0001)  
	bool                                               bBagOpened_Real;                                            // 0x0111   (0x0001)  
	bool                                               bMapOpened;                                                 // 0x0112   (0x0001)  
	bool                                               bSettlement;                                                // 0x0113   (0x0001)  
	bool                                               bGameOver;                                                  // 0x0114   (0x0001)  
	bool                                               bAIDebugInfoOpen;                                           // 0x0115   (0x0001)  
	bool                                               bCombatStatsOpened;                                         // 0x0116   (0x0001)  
	bool                                               bGameSetttingOpened;                                        // 0x0117   (0x0001)  
	bool                                               bIsBagTemporarilyHidden;                                    // 0x0118   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0119   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.UAPCUIModeComponent.TryWorldRebase
	// void TryWorldRebase();                                                                                                   // [0x368fef0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SwitchMapOpen
	// void SwitchMapOpen();                                                                                                    // [0x368fed0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SwitchMainMenu
	// void SwitchMainMenu();                                                                                                   // [0x368feb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SwitchBagOpen
	// void SwitchBagOpen();                                                                                                    // [0x368fe90] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SwitchAIDebugInfo
	// void SwitchAIDebugInfo();                                                                                                // [0x368fe70] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetPreparationsOpened
	// void SetPreparationsOpened(bool bOpen);                                                                                  // [0x368fd30] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetPreparationsOpen
	// void SetPreparationsOpen(bool bOpen);                                                                                    // [0x368fca0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetOperationResultOpen
	// void SetOperationResultOpen(bool bOpen);                                                                                 // [0x368fc10] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetModalBoxOpen
	// void SetModalBoxOpen(bool bOpen);                                                                                        // [0x368faf0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetMessageBoxOpen
	// void SetMessageBoxOpen(bool bOpen);                                                                                      // [0x2a38b40] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetMapOpen
	// void SetMapOpen(bool bOpen);                                                                                             // [0x368fa60] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetMainMenuOpen
	// void SetMainMenuOpen(bool bOpen);                                                                                        // [0x368f9d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetLoadingPanel
	// void SetLoadingPanel(bool bOpen);                                                                                        // [0x368f940] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetGameSettingOpen
	// void SetGameSettingOpen(bool bOpen);                                                                                     // [0x368f8b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetCombatStatsOpen
	// void SetCombatStatsOpen(bool bOpen);                                                                                     // [0x368f6c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetBagOpen
	// void SetBagOpen(bool bOpen, class AActor* InteractTarget, EUABagOperation Operation);                                    // [0x368f3f0] Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.SetAIDebugInfoOpen
	// void SetAIDebugInfoOpen(bool bOpen);                                                                                     // [0x368f360] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.OnPlayerBeginGame
	// void OnPlayerBeginGame(class APlayerController* PC);                                                                     // [0x19a6d00] Final|Native|Public  
	// Function /Script/UAGame.UAPCUIModeComponent.OnEnterDBNOMessageReceived
	// void OnEnterDBNOMessageReceived(class ACharacter* Character);                                                            // [0x368ec60] Final|Native|Public  
	// Function /Script/UAGame.UAPCUIModeComponent.IsCombatStatsOpenned
	// bool IsCombatStatsOpenned();                                                                                             // [0x368ea80] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.IsAIDebugInfoOpened
	// bool IsAIDebugInfoOpened();                                                                                              // [0x368ea50] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.UAPCUIModeComponent.CheckBagStateChange
	// void CheckBagStateChange();                                                                                              // [0x368e4d0] Final|Native|Public  
};

/// Class /Script/UAGame.DZPCUIModeComponent
/// Size: 0x0008 (8 bytes) (0x000120 - 0x000128) align 8 pad: 0x0000
class UDZPCUIModeComponent : public UUAPCUIModeComponent
{ 
public:
	bool                                               bEscapeInfoOpen;                                            // 0x0120   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0121   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.DZPCUIModeComponent.SwitchEscapeInfoOpen
	// void SwitchEscapeInfoOpen();                                                                                             // [0x35f33d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.DZPCUIModeComponent.SetEscapeInfoOpen
	// void SetEscapeInfoOpen(bool bOpen);                                                                                      // [0x35f32b0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/UAGame.GameModeAutoTest
/// Size: 0x0020 (32 bytes) (0x0003C8 - 0x0003E8) align 8 pad: 0x0000
class AGameModeAutoTest : public AGameMode
{ 
public:
	TArray<class UParticleSystemComponent*>            ParticleSystemComponentArray;                               // 0x03C8   (0x0010)  
	TArray<class AActor*>                              ActorArray;                                                 // 0x03D8   (0x0010)  


	/// Functions
	// Function /Script/UAGame.GameModeAutoTest.TestSpawnActorWithMaterial
	// void TestSpawnActorWithMaterial(FString ClassName, FString MaterialName, FString position);                              // [0x35f3500] Final|Exec|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.GameModeAutoTest.TestSpawnActor
	// void TestSpawnActor(FString ClassName, FString position);                                                                // [0x35f33f0] Final|Exec|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.GameModeAutoTest.TestDestroyActor
	// void TestDestroyActor();                                                                                                 // [0xd906a0] Final|Exec|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.GameModeAutoTest.EnableLightShadow
	// void EnableLightShadow(bool bEnable);                                                                                    // [0x197b510] Final|Exec|Native|Public|BlueprintCallable 
};

/// Class /Script/UAGame.InteractiveActorCollector
/// Size: 0x0000 (0 bytes) (0x0002E0 - 0x0002E0) align 8 pad: 0x0000
class AInteractiveActorCollector : public AActor
{ 
public:
};

/// Class /Script/UAGame.MediaPlayerController
/// Size: 0x0038 (56 bytes) (0x0002E0 - 0x000318) align 8 pad: 0x0000
class AMediaPlayerController : public AActor
{ 
public:
	class UMediaPlayer*                                MediaPlayer;                                                // 0x02E0   (0x0008)  
	unsigned char                                      UnknownData00_7[0x30];                                      // 0x02E8   (0x0030)  MISSED


	/// Functions
	// Function /Script/UAGame.MediaPlayerController.OpenVideo
	// void OpenVideo(FString URL, bool& Loop);                                                                                 // [0x35f2e80] Final|Native|Public|HasOutParms 
};

/// Class /Script/UAGame.MFMissionVariableWrite_ActorReference
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UMFMissionVariableWrite_ActorReference : public UMFMissionVariableWriteBase
{ 
public:
	FMissionActorReference                             Value;                                                      // 0x0050   (0x0018)  
};

/// Class /Script/UAGame.MFMobileGamePadViewEffect
/// Size: 0x0008 (8 bytes) (0x000300 - 0x000308) align 8 pad: 0x0000
class UMFMobileGamePadViewEffect : public UMFMobileGamePadView
{ 
public:
	class USoundIndicatorWidget*                       SoundIndicatorHUD;                                          // 0x0300   (0x0008)  
};

/// Class /Script/UAGame.MFVoiceInputComponent
/// Size: 0x0000 (0 bytes) (0x000180 - 0x000180) align 8 pad: 0x0000
class UMFVoiceInputComponent : public UInputComponent
{ 
public:
};

/// Class /Script/UAGame.NewTraceableActorInfo_StructLib
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UNewTraceableActorInfo_StructLib : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.TryGetEscapePointID
	// int32_t TryGetEscapePointID(FNewTraceableActorInfo& TempTraceInfo);                                                      // [0x35f3870] Final|Native|Static|Public|HasOutParms 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.ToString
	// FString ToString(FNewTraceableActorInfo& TempTraceInfo);                                                                 // [0x35f3660] Final|Native|Static|Public|HasOutParms 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.IsSame
	// bool IsSame(FNewTraceableActorInfo& LeftTraceInfo, FNewTraceableActorInfo& RightTraceInfo);                              // [0x35f28a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.IsNeedDisplay
	// bool IsNeedDisplay(FNewTraceableActorInfo& TempTraceInfo, class UObject* WorldContextObject, ENewTraceDisplayPlatform PlatformType); // [0x35f2750] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.IsDefault
	// bool IsDefault(FNewTraceableActorInfo& TempTraceInfo);                                                                   // [0x35f2670] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.GetTraceSyncRule
	// ENewTraceSyncRule GetTraceSyncRule(FNewTraceableActorInfo& TempTraceInfo, class UObject* WorldContextObject);            // [0x35f2560] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.GetTraceStyleTable
	// FUANewTraceStyleTable GetTraceStyleTable(FNewTraceableActorInfo& TempTraceInfo, class UObject* WorldContextObject);      // [0x35f2430] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.GetTraceMarkType
	// ENewTraceableMarkType GetTraceMarkType(FNewTraceableActorInfo& TempTraceInfo, class UObject* WorldContextObject);        // [0x35f2320] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.GetTraceHash
	// uint32_t GetTraceHash(FNewTraceableActorInfo& TempTraceInfo);                                                            // [0x35f2270] Final|Native|Static|Public|HasOutParms 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.GetScanningInterval
	// float GetScanningInterval(FNewTraceableActorInfo& TempTraceInfo, class UObject* WorldContextObject);                     // [0x35f2160] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.GetOwner
	// class AActor* GetOwner(FNewTraceableActorInfo& TempTraceInfo);                                                           // [0x35f1fc0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.NewTraceableActorInfo_StructLib.EqualFunc
	// bool EqualFunc(FNewTraceableActorInfo& LeftTraceInfo, FNewTraceableActorInfo& RightTraceInfo);                           // [0x35f1dd0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
};

/// Class /Script/UAGame.PylonPoint
/// Size: 0x0008 (8 bytes) (0x000308 - 0x000310) align 8 pad: 0x0000
class APylonPoint : public ANavigationObjectBase
{ 
public:
	int32_t                                            PylonID;                                                    // 0x0308   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x030C   (0x0004)  MISSED


	/// Functions
	// Function /Script/UAGame.PylonPoint.ResetAllPylonPointID
	// void ResetAllPylonPointID();                                                                                             // [0xd906a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.PylonPoint.PrintAllNearByLootPoint
	// void PrintAllNearByLootPoint(float Distance);                                                                            // [0x1e16e10] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.PylonPoint.GetPositionKey
	// FIntPoint GetPositionKey(FVector WorldLocation, float GridSize);                                                         // [0x35f2070] Final|Native|Public|HasDefaults 
};

/// Class /Script/UAGame.QuestAction_CompleteEvent_G
/// Size: 0x0000 (0 bytes) (0x000100 - 0x000100) align 8 pad: 0x0000
class UQuestAction_CompleteEvent_G : public UMFQuestActionComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestAction_CompleteEvent_G.OnQuestStateChange
	// void OnQuestStateChange(EQuestStatus NewState, EQuestStatus OldState);                                                   // [0x35f2b80] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestAction_Damage_T
/// Size: 0x0008 (8 bytes) (0x000100 - 0x000108) align 8 pad: 0x0000
class UQuestAction_Damage_T : public UMFQuestActionComponentBase
{ 
public:
	ECharacterEnduranceType                            EnduranceType;                                              // 0x0100   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0101   (0x0007)  MISSED
};

/// Class /Script/UAGame.QuestAction_Debuff_T
/// Size: 0x0018 (24 bytes) (0x000100 - 0x000118) align 8 pad: 0x0000
class UQuestAction_Debuff_T : public UMFQuestActionComponentBase
{ 
public:
	ECharacterEnduranceType                            EnduranceType;                                              // 0x0100   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0101   (0x0007)  MISSED
	FString                                            BuffName;                                                   // 0x0108   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestAction_Debuff_T.AddDebuff
	// void AddDebuff();                                                                                                        // [0x35f1d50] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestAction_FinishQuest
/// Size: 0x0000 (0 bytes) (0x000100 - 0x000100) align 8 pad: 0x0000
class UQuestAction_FinishQuest : public UMFQuestActionComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestAction_FinishQuest.OnQuestStateChange
	// void OnQuestStateChange(class AActor* Owner, class AActor* QuestActor, int32_t NewState, int32_t OldState);              // [0x35f2c50] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestAction_FollowBar_T
/// Size: 0x0038 (56 bytes) (0x000100 - 0x000138) align 8 pad: 0x0000
class UQuestAction_FollowBar_T : public UMFQuestActionComponentBase
{ 
public:
	ETutorialFlowBarType                               FlowBarType;                                                // 0x0100   (0x0001)  
	bool                                               bShow;                                                      // 0x0101   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0102   (0x0006)  MISSED
	class AActor*                                      TargetActor;                                                // 0x0108   (0x0008)  
	FVector                                            Offset;                                                     // 0x0110   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x011C   (0x0004)  MISSED
	FString                                            TextStrKey;                                                 // 0x0120   (0x0010)  
	bool                                               IsLocalOffset;                                              // 0x0130   (0x0001)  
	bool                                               IsDetiveAction;                                             // 0x0131   (0x0001)  
	unsigned char                                      UnknownData02_7[0x6];                                       // 0x0132   (0x0006)  MISSED
};

/// Class /Script/UAGame.QuestAction_HUDMask_T
/// Size: 0x0010 (16 bytes) (0x000100 - 0x000110) align 8 pad: 0x0000
class UQuestAction_HUDMask_T : public UMFQuestActionComponentBase
{ 
public:
	int32_t                                            Maskid;                                                     // 0x0100   (0x0004)  
	bool                                               bShow;                                                      // 0x0104   (0x0001)  
	bool                                               IsDeactiveAction;                                           // 0x0105   (0x0001)  
	bool                                               bShowMaskVisual;                                            // 0x0106   (0x0001)  
	unsigned char                                      UnknownData00_7[0x9];                                       // 0x0107   (0x0009)  MISSED
};

/// Class /Script/UAGame.QuestAction_HudMessage_T
/// Size: 0x0028 (40 bytes) (0x000100 - 0x000128) align 8 pad: 0x0000
class UQuestAction_HudMessage_T : public UMFQuestActionComponentBase
{ 
public:
	TArray<int64_t>                                    MessageArray;                                               // 0x0100   (0x0010)  
	TArray<int64_t>                                    ClearMessageArray;                                          // 0x0110   (0x0010)  
	bool                                               IsDetiveAction;                                             // 0x0120   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0121   (0x0007)  MISSED
};

/// Class /Script/UAGame.QuestAction_InputChange_T
/// Size: 0x0008 (8 bytes) (0x000100 - 0x000108) align 8 pad: 0x0000
class UQuestAction_InputChange_T : public UMFQuestActionComponentBase
{ 
public:
	EUAGamePadTable                                    PadButtonType;                                              // 0x0100   (0x0001)  
	bool                                               bShow;                                                      // 0x0101   (0x0001)  
	bool                                               IsDetiveAction;                                             // 0x0102   (0x0001)  
	bool                                               bLimitInput;                                                // 0x0103   (0x0001)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0104   (0x0004)  MISSED
};

/// Class /Script/UAGame.QuestAction_InventoryDestroyed
/// Size: 0x0018 (24 bytes) (0x000100 - 0x000118) align 8 pad: 0x0000
class UQuestAction_InventoryDestroyed : public UMFQuestActionComponentBase
{ 
public:
	TArray<int32_t>                                    InventoryIDs;                                               // 0x0100   (0x0010)  
	InventoryDestroyedEffectType                       EffectType;                                                 // 0x0110   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0111   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestAction_InventoryDestroyed.OnActorSpawned
	// void OnActorSpawned(class AActor* InActor);                                                                              // [0x35f2a60] Final|Native|Protected 
	// Function /Script/UAGame.QuestAction_InventoryDestroyed.OnActorDestroyed
	// void OnActorDestroyed(class AActor* DestroyedActor);                                                                     // [0x35f29d0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestAction_ItemMenu_T
/// Size: 0x0008 (8 bytes) (0x000100 - 0x000108) align 8 pad: 0x0000
class UQuestAction_ItemMenu_T : public UMFQuestActionComponentBase
{ 
public:
	bool                                               bEnable;                                                    // 0x0100   (0x0001)  
	bool                                               IsDeactiveAction;                                           // 0x0101   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x0102   (0x0006)  MISSED
};

/// Class /Script/UAGame.QuestAction_LetVolumeInteractable
/// Size: 0x00B8 (184 bytes) (0x000100 - 0x0001B8) align 8 pad: 0x0000
class UQuestAction_LetVolumeInteractable : public UMFQuestActionComponentBase
{ 
public:
	TArray<int32_t>                                    MapIDs;                                                     // 0x0100   (0x0010)  
	FString                                            VolumeName;                                                 // 0x0110   (0x0010)  
	bool                                               bForceUsePointMark;                                         // 0x0120   (0x0001)  
	bool                                               bEnterVolumeAutoComplete;                                   // 0x0121   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0122   (0x0006)  MISSED
	FUserWidgetPopInfo                                 UserWidgetPopInfo;                                          // 0x0128   (0x0058)  
	bool                                               bCheckCostBeforePopWidget;                                  // 0x0180   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0181   (0x0007)  MISSED
	TArray<FInteractInventoryInfo>                     CostInventoryInfos;                                         // 0x0188   (0x0010)  
	TArray<FInteractInventoryInfo>                     ObtainInventoryInfos;                                       // 0x0198   (0x0010)  
	class ASGVolume*                                   ValidVolume;                                                // 0x01A8   (0x0008)  
	bool                                               bAlreadyGathered;                                           // 0x01B0   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x01B1   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestAction_LetVolumeInteractable.OnQuestStateChange
	// void OnQuestStateChange(EQuestStatus NewState, EQuestStatus OldState);                                                   // [0x35f2db0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestAction_LockInput_T
/// Size: 0x0008 (8 bytes) (0x000100 - 0x000108) align 8 pad: 0x0000
class UQuestAction_LockInput_T : public UMFQuestActionComponentBase
{ 
public:
	bool                                               bLock;                                                      // 0x0100   (0x0001)  
	bool                                               IsDeactiveAction;                                           // 0x0101   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x0102   (0x0006)  MISSED
};

/// Class /Script/UAGame.QuestAction_MessageInState_T
/// Size: 0x0080 (128 bytes) (0x000100 - 0x000180) align 8 pad: 0x0000
class UQuestAction_MessageInState_T : public UMFQuestActionComponentBase
{ 
public:
	unsigned char                                      UnknownData00_3[0x18];                                      // 0x0100   (0x0018)  MISSED
	ETutorialCharacterState                            characterState;                                             // 0x0118   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0119   (0x0007)  MISSED
	TArray<int64_t>                                    InStateMessageArray;                                        // 0x0120   (0x0010)  
	TArray<int64_t>                                    InStateClearMessageArray;                                   // 0x0130   (0x0010)  
	EGamePadEffectTable                                InStateEffect;                                              // 0x0140   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0141   (0x0007)  MISSED
	TArray<int64_t>                                    NotInStateMessageArray;                                     // 0x0148   (0x0010)  
	TArray<int64_t>                                    NotInStateClearMessageArray;                                // 0x0158   (0x0010)  
	EGamePadEffectTable                                NotInStateEffect;                                           // 0x0168   (0x0001)  
	EUAGamePadTable                                    InStatePadButtonType;                                       // 0x0169   (0x0001)  
	EUAGamePadHightWidgetTable                         InStateHightWidget;                                         // 0x016A   (0x0001)  
	unsigned char                                      UnknownData03_6[0x1];                                       // 0x016B   (0x0001)  MISSED
	FVector2D                                          InStateOffSet;                                              // 0x016C   (0x0008)  
	EUAGamePadTable                                    NotInStatePadButtonType;                                    // 0x0174   (0x0001)  
	EUAGamePadHightWidgetTable                         NotInStateHightWidget;                                      // 0x0175   (0x0001)  
	unsigned char                                      UnknownData04_6[0x2];                                       // 0x0176   (0x0002)  MISSED
	FVector2D                                          NotInStateOffSet;                                           // 0x0178   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestAction_MessageInState_T.IsInState
	// bool IsInState();                                                                                                        // [0x35f2720] Final|Native|Protected 
	// Function /Script/UAGame.QuestAction_MessageInState_T.BroadCastNoInstateHighEffect
	// void BroadCastNoInstateHighEffect();                                                                                     // [0x35f1db0] Final|Native|Protected 
	// Function /Script/UAGame.QuestAction_MessageInState_T.BroadCastInstateHighEffect
	// void BroadCastInstateHighEffect();                                                                                       // [0x35f1d90] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestAction_MoveVolumeParticle_T
/// Size: 0x0010 (16 bytes) (0x000100 - 0x000110) align 8 pad: 0x0000
class UQuestAction_MoveVolumeParticle_T : public UMFQuestActionComponentBase
{ 
public:
	class AUAMTutorialMoveToVolume*                    MoveVolume;                                                 // 0x0100   (0x0008)  
	bool                                               bShow;                                                      // 0x0108   (0x0001)  
	bool                                               IsDetiveAction;                                             // 0x0109   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x010A   (0x0006)  MISSED
};

/// Class /Script/UAGame.QuestAction_PadHightEffect_T
/// Size: 0x0010 (16 bytes) (0x000100 - 0x000110) align 8 pad: 0x0000
class UQuestAction_PadHightEffect_T : public UMFQuestActionComponentBase
{ 
public:
	EUAGamePadTable                                    PadButtonType;                                              // 0x0100   (0x0001)  
	EUAGamePadHightWidgetTable                         HightWidget;                                                // 0x0101   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0102   (0x0002)  MISSED
	FVector2D                                          Offset;                                                     // 0x0104   (0x0008)  
	bool                                               bShow;                                                      // 0x010C   (0x0001)  
	bool                                               IsDetiveAction;                                             // 0x010D   (0x0001)  
	unsigned char                                      UnknownData01_7[0x2];                                       // 0x010E   (0x0002)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestAction_PadHightEffect_T.BroadCastHighEffect
	// void BroadCastHighEffect();                                                                                              // [0x35f1d70] Final|Native|Public  
};

/// Class /Script/UAGame.QuestAction_QuestReport
/// Size: 0x0030 (48 bytes) (0x000100 - 0x000130) align 8 pad: 0x0000
class UQuestAction_QuestReport : public UMFQuestActionComponentBase
{ 
public:
	TArray<int32_t>                                    AcitveReportIDList;                                         // 0x0100   (0x0010)  
	TArray<int32_t>                                    SuccessReportIDList;                                        // 0x0110   (0x0010)  
	TArray<int32_t>                                    FaildReportIDList;                                          // 0x0120   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestAction_QuestReport.OnQuestStateChange
	// void OnQuestStateChange(EQuestStatus NewState, EQuestStatus OldState);                                                   // [0x35f6d20] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestAction_RelevantToActors
/// Size: 0x0060 (96 bytes) (0x000100 - 0x000160) align 8 pad: 0x0000
class UQuestAction_RelevantToActors : public UMFQuestActionComponentBase
{ 
public:
	TArray<class AActor*>                              TargetActors;                                               // 0x0100   (0x0010)  
	TArray<int32_t>                                    InteractItemIDs;                                            // 0x0110   (0x0010)  
	TArray<int32_t>                                    VolumeItemIDs;                                              // 0x0120   (0x0010)  
	TArray<int32_t>                                    InventoryItemIDs;                                           // 0x0130   (0x0010)  
	TArray<int32_t>                                    AIIDs;                                                      // 0x0140   (0x0010)  
	bool                                               bForceUsePointMark;                                         // 0x0150   (0x0001)  
	ETraceMarkOperatorType                             OperatorType;                                               // 0x0151   (0x0001)  
	ETraceableMarkType                                 MarkType;                                                   // 0x0152   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0153   (0x0001)  MISSED
	float                                              ScanningInterval;                                           // 0x0154   (0x0004)  
	int32_t                                            ConfigID;                                                   // 0x0158   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x015C   (0x0004)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestAction_RelevantToActors.OnKilledEvent
	// void OnKilledEvent(class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, FDamageEvent& DamageEvent, class AActor* KillerWeapon, float KillDistance, ECharacterEnduranceType EnduranceType, class UDamageEventObject* DamageEventObject); // [0x35f6830] Final|Native|Public|HasOutParms 
};

/// Class /Script/UAGame.QuestAction_SoundUI_T
/// Size: 0x0008 (8 bytes) (0x000100 - 0x000108) align 8 pad: 0x0000
class UQuestAction_SoundUI_T : public UMFQuestActionComponentBase
{ 
public:
	bool                                               bShow;                                                      // 0x0100   (0x0001)  
	bool                                               IsDetiveAction;                                             // 0x0101   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x0102   (0x0006)  MISSED
};

/// Class /Script/UAGame.QuestInteractItemSpawnInfo
/// Size: 0x0018 (24 bytes) (0x000028 - 0x000040) align 8 pad: 0x0000
class UQuestInteractItemSpawnInfo : public UObject
{ 
public:
	class AQuestItemSpawnPoint*                        InventorySpawnPoint;                                        // 0x0028   (0x0008)  
	class UClass*                                      InteractItemClass;                                          // 0x0030   (0x0008)  
	bool                                               bCheckPlacement;                                            // 0x0038   (0x0001)  
	ETraceMarkOperatorType                             OperatorType;                                               // 0x0039   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x003A   (0x0002)  MISSED
	int32_t                                            ConfigID;                                                   // 0x003C   (0x0004)  
};

/// Class /Script/UAGame.QuestAction_SpawnInteractItem
/// Size: 0x0028 (40 bytes) (0x000100 - 0x000128) align 8 pad: 0x0000
class UQuestAction_SpawnInteractItem : public UMFQuestActionComponentBase
{ 
public:
	TArray<class UQuestInteractItemSpawnInfo*>         QuestInteractItemSpawnInfos;                                // 0x0100   (0x0010)  
	TArray<class ASGNetRelevantConfigurableActor*>     SpawnedInteractItem;                                        // 0x0110   (0x0010)  
	bool                                               bDontDestroyOnDeactive;                                     // 0x0120   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0121   (0x0007)  MISSED
};

/// Class /Script/UAGame.QuestAction_SpawnQuestDistributer
/// Size: 0x0010 (16 bytes) (0x000100 - 0x000110) align 8 pad: 0x0000
class UQuestAction_SpawnQuestDistributer : public UMFQuestActionComponentBase
{ 
public:
	int32_t                                            MapID;                                                      // 0x0100   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0104   (0x0004)  MISSED
	class UClass*                                      DistributerClass;                                           // 0x0108   (0x0008)  
};

/// Class /Script/UAGame.QuestInventorySpawnInfo
/// Size: 0x0020 (32 bytes) (0x000028 - 0x000048) align 8 pad: 0x0000
class UQuestInventorySpawnInfo : public UObject
{ 
public:
	class AQuestItemSpawnPoint*                        InventorySpawnPoint;                                        // 0x0028   (0x0008)  
	uint64_t                                           ItemID;                                                     // 0x0030   (0x0008)  
	int32_t                                            ItemStackCount;                                             // 0x0038   (0x0004)  
	bool                                               bCheckPlacement;                                            // 0x003C   (0x0001)  
	ETraceMarkOperatorType                             OperatorType;                                               // 0x003D   (0x0001)  
	ETraceableMarkType                                 MarkType;                                                   // 0x003E   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x003F   (0x0001)  MISSED
	float                                              ScanningInterval;                                           // 0x0040   (0x0004)  
	int32_t                                            ConfigID;                                                   // 0x0044   (0x0004)  
};

/// Struct /Script/UAGame.QuestActionSpawnInventoryInfo
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FQuestActionSpawnInventoryInfo
{ 
	int64_t                                            SpawnPointID;                                               // 0x0000   (0x0008)  
	int64_t                                            ItemID;                                                     // 0x0008   (0x0008)  
	int32_t                                            Weight;                                                     // 0x0010   (0x0004)  
	int32_t                                            ItemStackCount;                                             // 0x0014   (0x0004)  
	bool                                               bCheckPlacement;                                            // 0x0018   (0x0001)  
	ETraceMarkOperatorType                             OperatorType;                                               // 0x0019   (0x0001)  
	ETraceableMarkType                                 MarkType;                                                   // 0x001A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x001B   (0x0001)  MISSED
	float                                              ScanningInterval;                                           // 0x001C   (0x0004)  
	int32_t                                            ConfigID;                                                   // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Class /Script/UAGame.QuestAction_SpawnQuestInventory
/// Size: 0x0038 (56 bytes) (0x000100 - 0x000138) align 8 pad: 0x0000
class UQuestAction_SpawnQuestInventory : public UMFQuestActionComponentBase
{ 
public:
	TArray<class UQuestInventorySpawnInfo*>            QuestInventorySpawnInfos;                                   // 0x0100   (0x0010)  
	int32_t                                            SpawnInventoryNum;                                          // 0x0110   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0114   (0x0004)  MISSED
	TArray<FQuestActionSpawnInventoryInfo>             SpawnInventoryInfos;                                        // 0x0118   (0x0010)  
	TArray<class ASGInventory*>                        SpawnedQuestInventorys;                                     // 0x0128   (0x0010)  
};

/// Class /Script/UAGame.QuestAction_TimeLimitCountDown
/// Size: 0x0068 (104 bytes) (0x000100 - 0x000168) align 8 pad: 0x0000
class UQuestAction_TimeLimitCountDown : public UMFQuestActionComponentBase
{ 
public:
	float                                              CountDownStartSecond;                                       // 0x0100   (0x0004)  
	float                                              RemainTime;                                                 // 0x0104   (0x0004)  
	float                                              RemainTimeUpdateServerTime;                                 // 0x0108   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x010C   (0x0004)  MISSED
	FTimerHandle                                       CountDownTimerHandle;                                       // 0x0110   (0x0008)  
	TArray<class AActor*>                              TargetActors;                                               // 0x0118   (0x0010)  
	TArray<int32_t>                                    InteractItemIDs;                                            // 0x0128   (0x0010)  
	TArray<int32_t>                                    VolumeItemIDs;                                              // 0x0138   (0x0010)  
	TArray<int32_t>                                    InventoryItemIDs;                                           // 0x0148   (0x0010)  
	TArray<int32_t>                                    AIIDs;                                                      // 0x0158   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.SetMissionRemainTime
	// void SetMissionRemainTime();                                                                                             // [0x35f6f20] Final|Native|Protected 
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.RemoveQuestTraceInfo
	// void RemoveQuestTraceInfo();                                                                                             // [0x35f6f00] Final|Native|Protected 
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.OnRep_RemainTime
	// void OnRep_RemainTime();                                                                                                 // [0x35f6ec0] Final|Native|Protected 
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.OnQuestStateChange
	// void OnQuestStateChange(EQuestStatus NewState, EQuestStatus OldState);                                                   // [0x35f6df0] Final|Native|Protected 
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.OnFinishCountDown
	// void OnFinishCountDown();                                                                                                // [0x35f6810] Final|Native|Protected 
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.GetServerWorldTime
	// float GetServerWorldTime();                                                                                              // [0x35f67b0] Final|Native|Public|Const 
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.GetRemainTime
	// float GetRemainTime();                                                                                                   // [0x35f6780] Final|Native|Public  
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.GetQuestRemainTimeUpdateServerTime
	// float GetQuestRemainTimeUpdateServerTime();                                                                              // [0x29c4b30] Final|Native|Public  
	// Function /Script/UAGame.QuestAction_TimeLimitCountDown.GetQuestRemainTime
	// float GetQuestRemainTime();                                                                                              // [0x35f6730] Final|Native|Public  
};

/// Class /Script/UAGame.QuestAction_WidgetEffect_T
/// Size: 0x0008 (8 bytes) (0x000100 - 0x000108) align 8 pad: 0x0000
class UQuestAction_WidgetEffect_T : public UMFQuestActionComponentBase
{ 
public:
	EGamePadEffectTable                                PadEffectType;                                              // 0x0100   (0x0001)  
	bool                                               bShow;                                                      // 0x0101   (0x0001)  
	bool                                               IsDetiveAction;                                             // 0x0102   (0x0001)  
	unsigned char                                      UnknownData00_7[0x5];                                       // 0x0103   (0x0005)  MISSED
};

/// Class /Script/UAGame.QuestActionComp_SendNPCRequest
/// Size: 0x0020 (32 bytes) (0x000100 - 0x000120) align 8 pad: 0x0000
class UQuestActionComp_SendNPCRequest : public UMFQuestActionComponentBase
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x0100   (0x0008)  MISSED
	class AActor*                                      DestinationActor;                                           // 0x0108   (0x0008)  
	float                                              Timeout;                                                    // 0x0110   (0x0004)  
	unsigned char                                      UnknownData01_7[0xC];                                       // 0x0114   (0x000C)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestActionComp_SendNPCRequest.RequestStep
	// void RequestStep(int32_t Step);                                                                                          // [0x3a75280] Event|Public|BlueprintEvent 
	// Function /Script/UAGame.QuestActionComp_SendNPCRequest.OnRequestTimeout
	// void OnRequestTimeout();                                                                                                 // [0x35f6ee0] Final|Native|Protected 
	// Function /Script/UAGame.QuestActionComp_SendNPCRequest.OnQuestProgressed
	// void OnQuestProgressed(int32_t ProgressToAdd, int32_t CurrentProgress);                                                  // [0x35f6c50] Final|Native|Protected 
	// Function /Script/UAGame.QuestActionComp_SendNPCRequest.OnQuestDeactived
	// void OnQuestDeactived(EQuestStatus InResult);                                                                            // [0x35f6bd0] Final|Native|Protected 
	// Function /Script/UAGame.QuestActionComp_SendNPCRequest.GetOwnerQuest
	// class AMFQuestBase* GetOwnerQuest();                                                                                     // [0x11276b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.QuestActionComp_SendNPCRequest.GetActionOwner
	// class ASGCharacter* GetActionOwner();                                                                                    // [0x35f66a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.QuestActionComp_SendNPCRequest.FinishQuest
	// void FinishQuest();                                                                                                      // [0x35f6680] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestActionComp_SendNPCRequest.EndQuestAction
	// void EndQuestAction();                                                                                                   // [0x3a75280] Event|Public|BlueprintEvent 
};

/// Class /Script/UAGame.QuestBase
/// Size: 0x0018 (24 bytes) (0x0003C0 - 0x0003D8) align 8 pad: 0x0000
class AQuestBase : public AMFQuestBase
{ 
public:
	bool                                               bClearProgressWhenFinishGame;                               // 0x03C0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x03C1   (0x0007)  MISSED
	class UQuestTraceInfoComponent*                    QuestTraceInfoComponent;                                    // 0x03C8   (0x0008)  
	unsigned char                                      UnknownData01_7[0x8];                                       // 0x03D0   (0x0008)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestBase.OnPlayerFinishGame
	// void OnPlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x35f6ac0] Final|Native|Public  
	// Function /Script/UAGame.QuestBase.GetQuestTraceInfoComponent
	// class UQuestTraceInfoComponent* GetQuestTraceInfoComponent();                                                            // [0x35f6750] Final|Native|Public|Const 
	// Function /Script/UAGame.QuestBase.GetMaxProgress
	// int32_t GetMaxProgress();                                                                                                // [0x35f6700] Final|Native|Public  
	// Function /Script/UAGame.QuestBase.GetCurrProgress
	// int32_t GetCurrProgress();                                                                                               // [0x35f66d0] Final|Native|Public  
};

/// Class /Script/UAGame.QuestConditionComp_ArmorType
/// Size: 0x0008 (8 bytes) (0x000050 - 0x000058) align 8 pad: 0x0000
class UQuestConditionComp_ArmorType : public UMFQuestConditionComponentBase
{ 
public:
	bool                                               bEqualType;                                                 // 0x0050   (0x0001)  
	ESGArmorType                                       ArmorType;                                                  // 0x0051   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x0052   (0x0006)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_CharacterEnduranceType
/// Size: 0x0020 (32 bytes) (0x000050 - 0x000070) align 8 pad: 0x0000
class UQuestConditionComp_CharacterEnduranceType : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	ECharacterEnduranceType                            CharacterEnduranceType;                                     // 0x0058   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0059   (0x0007)  MISSED
	TArray<ECharacterEnduranceType>                    CharacterEnduranceTypes;                                    // 0x0060   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_CharacterGameEffectType
/// Size: 0x0010 (16 bytes) (0x000050 - 0x000060) align 8 pad: 0x0000
class UQuestConditionComp_CharacterGameEffectType : public UMFQuestConditionComponentBase
{ 
public:
	TArray<ECharacterGameEffectType>                   CharacterGameEffectTypes;                                   // 0x0050   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_CharacterState_T
/// Size: 0x0010 (16 bytes) (0x000050 - 0x000060) align 8 pad: 0x0000
class UQuestConditionComp_CharacterState_T : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      SourceActorContextConfig;                                   // 0x0050   (0x0008)  
	ETutorialCharacterState                            characterState;                                             // 0x0058   (0x0001)  
	ETutorialCharacterStateCheckType                   CharacterStateCheckType;                                    // 0x0059   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x005A   (0x0006)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestConditionComp_CharacterState_T.IsInState
	// bool IsInState();                                                                                                        // [0x35f67e0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestConditionComp_CharacterStatus
/// Size: 0x0030 (48 bytes) (0x000050 - 0x000080) align 8 pad: 0x0000
class UQuestConditionComp_CharacterStatus : public UMFQuestConditionComponentBase
{ 
public:
	EQuestConditionCharacterType                       CharacterType;                                              // 0x0050   (0x0001)  
	EQuestConditionCharacterStatus                     CharacterStatus;                                            // 0x0051   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0052   (0x0006)  MISSED
	class UClass*                                      CheckTargetContextSource;                                   // 0x0058   (0x0008)  
	TArray<int32_t>                                    AIIDs;                                                      // 0x0060   (0x0010)  
	TArray<FString>                                    AreaIDs;                                                    // 0x0070   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestConditionComp_CharacterStatus.CheckTeammate
	// bool CheckTeammate(TArray<FQuestContextPair>& QuestContextList);                                                         // [0x35f65c0] Final|Native|Protected|HasOutParms 
	// Function /Script/UAGame.QuestConditionComp_CharacterStatus.CheckAreaIDs
	// bool CheckAreaIDs();                                                                                                     // [0x35f6590] Final|Native|Protected 
	// Function /Script/UAGame.QuestConditionComp_CharacterStatus.CheckAIIDs
	// bool CheckAIIDs();                                                                                                       // [0x35f6560] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestConditionComp_CharacterType
/// Size: 0x0020 (32 bytes) (0x000050 - 0x000070) align 8 pad: 0x0000
class UQuestConditionComp_CharacterType : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<ECharacterType>                             SpecifiedTypes;                                             // 0x0058   (0x0010)  
	int64_t                                            BossGroupID;                                                // 0x0068   (0x0008)  
};

/// Class /Script/UAGame.QuestConditionComp_ChaseActivityState
/// Size: 0x0008 (8 bytes) (0x000050 - 0x000058) align 8 pad: 0x0000
class UQuestConditionComp_ChaseActivityState : public UMFQuestConditionComponentBase
{ 
public:
	EChaseActivityState                                ChaseActivityState;                                         // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0051   (0x0007)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_CheckAchievement
/// Size: 0x0010 (16 bytes) (0x000050 - 0x000060) align 8 pad: 0x0000
class UQuestConditionComp_CheckAchievement : public UMFQuestConditionComponentBase
{ 
public:
	int32_t                                            AchievementValue;                                           // 0x0050   (0x0004)  
	unsigned char                                      UnknownData00_7[0xC];                                       // 0x0054   (0x000C)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_CheckAIID
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UQuestConditionComp_CheckAIID : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<int64_t>                                    ValidAIIDPrefix;                                            // 0x0058   (0x0010)  
};

/// Class /Script/UAGame.CharacterAttributeCheckInfo
/// Size: 0x0050 (80 bytes) (0x000028 - 0x000078) align 8 pad: 0x0000
class UCharacterAttributeCheckInfo : public UObject
{ 
public:
	bool                                               bUseCustomAttribute;                                        // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	FGameplayAttribute                                 Attribute;                                                  // 0x0030   (0x0038)  
	EQuestCheckCustomAttribute                         CustomAttribute;                                            // 0x0068   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0069   (0x0003)  MISSED
	float                                              MinValue;                                                   // 0x006C   (0x0004)  
	float                                              MaxValue;                                                   // 0x0070   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x0074   (0x0004)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_CheckAttribute
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UQuestConditionComp_CheckAttribute : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<class UCharacterAttributeCheckInfo*>        AttributeCheckInfoList;                                     // 0x0058   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_CheckCharacterEquipItem
/// Size: 0x0020 (32 bytes) (0x000050 - 0x000070) align 8 pad: 0x0000
class UQuestConditionComp_CheckCharacterEquipItem : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	bool                                               bCheckTeammate;                                             // 0x0058   (0x0001)  
	ECheckItemType                                     CheckItemType;                                              // 0x0059   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x005A   (0x0006)  MISSED
	TArray<class UCheckItemParamBase*>                 CheckParams;                                                // 0x0060   (0x0010)  
};

/// Class /Script/UAGame.CheckDamageInfoParamBase
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UCheckDamageInfoParamBase : public UObject
{ 
public:
};

/// Class /Script/UAGame.CheckCaptureWeaponZoomType
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckCaptureWeaponZoomType : public UCheckDamageInfoParamBase
{ 
public:
	ESGZoomType                                        ZoomType;                                                   // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Class /Script/UAGame.CheckDamageTypeClass
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckDamageTypeClass : public UCheckDamageInfoParamBase
{ 
public:
	class UClass*                                      DamageTypeClass;                                            // 0x0028   (0x0008)  
};

/// Class /Script/UAGame.CheckBulletItemId
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UCheckBulletItemId : public UCheckDamageInfoParamBase
{ 
public:
	TArray<uint64_t>                                   ValidBulletIds;                                             // 0x0028   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_CheckDamageInfo
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UQuestConditionComp_CheckDamageInfo : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<class UCheckDamageInfoParamBase*>           CheckParams;                                                // 0x0058   (0x0010)  
};

/// Class /Script/UAGame.CharacterGameplayTagCheckInfo
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000050) align 8 pad: 0x0000
class UCharacterGameplayTagCheckInfo : public UObject
{ 
public:
	FGameplayTagContainer                              TagContainer;                                               // 0x0028   (0x0020)  
	EGameplayTagCheckType                              CheckType;                                                  // 0x0048   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0049   (0x0007)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_CheckGameplayEffect
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UQuestConditionComp_CheckGameplayEffect : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<class UCharacterGameplayTagCheckInfo*>      GameplayTagCheckInfoList;                                   // 0x0058   (0x0010)  
};

/// Class /Script/UAGame.CheckItemParamBase
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UCheckItemParamBase : public UObject
{ 
public:
};

/// Class /Script/UAGame.CheckItemTypeID
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UCheckItemTypeID : public UCheckItemParamBase
{ 
public:
	TArray<uint64_t>                                   ItemTypeIDs;                                                // 0x0028   (0x0010)  
};

/// Class /Script/UAGame.CheckIsTakeInItem
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckIsTakeInItem : public UCheckItemParamBase
{ 
public:
	bool                                               bIsTakeIn;                                                  // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Class /Script/UAGame.CheckOccupiedGridCount
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckOccupiedGridCount : public UCheckItemParamBase
{ 
public:
	int32_t                                            OccupiedGridCountMin;                                       // 0x0028   (0x0004)  
	int32_t                                            OccupiedGridCountMax;                                       // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckDurability
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckDurability : public UCheckItemParamBase
{ 
public:
	float                                              MinDurability;                                              // 0x0028   (0x0004)  
	float                                              MaxDurability;                                              // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckWeight
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckWeight : public UCheckItemParamBase
{ 
public:
	float                                              MinWeight;                                                  // 0x0028   (0x0004)  
	float                                              MaxWeight;                                                  // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckEngonomics
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckEngonomics : public UCheckItemParamBase
{ 
public:
	float                                              MinEngonomics;                                              // 0x0028   (0x0004)  
	float                                              MaxEngonomics;                                              // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckAccuracy
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckAccuracy : public UCheckItemParamBase
{ 
public:
	float                                              MinAccuracy;                                                // 0x0028   (0x0004)  
	float                                              MaxAccuracy;                                                // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckHorizontalRecoil
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckHorizontalRecoil : public UCheckItemParamBase
{ 
public:
	float                                              MinHorizontalRecoil;                                        // 0x0028   (0x0004)  
	float                                              MaxHorizontalRecoil;                                        // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckVerticalRecoil
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckVerticalRecoil : public UCheckItemParamBase
{ 
public:
	float                                              MinVerticalRecoil;                                          // 0x0028   (0x0004)  
	float                                              MaxVerticalRecoil;                                          // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckRequireAdapters
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UCheckRequireAdapters : public UCheckItemParamBase
{ 
public:
	TArray<uint64_t>                                   RequireAdapters;                                            // 0x0028   (0x0010)  
};

/// Class /Script/UAGame.CheckExclusionAdapters
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UCheckExclusionAdapters : public UCheckItemParamBase
{ 
public:
	TArray<uint64_t>                                   ExclusionAdapters;                                          // 0x0028   (0x0010)  
};

/// Class /Script/UAGame.CheckFireMode
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckFireMode : public UCheckItemParamBase
{ 
public:
	ESGWeaponShootingMode                              FireMode;                                                   // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Class /Script/UAGame.CheckRuntimeFireRate
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckRuntimeFireRate : public UCheckItemParamBase
{ 
public:
	int32_t                                            MinFireRatePerMinute;                                       // 0x0028   (0x0004)  
	int32_t                                            MaxFireRatePerMinute;                                       // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckSightRange
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckSightRange : public UCheckItemParamBase
{ 
public:
	float                                              MinSightRange;                                              // 0x0028   (0x0004)  
	float                                              MaxSightRange;                                              // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckCurrentBulletCount
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckCurrentBulletCount : public UCheckItemParamBase
{ 
public:
	int32_t                                            MinBulletCount;                                             // 0x0028   (0x0004)  
	int32_t                                            MaxBulletCount;                                             // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckMaxBulletCount
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckMaxBulletCount : public UCheckItemParamBase
{ 
public:
	int32_t                                            MinBulletCount;                                             // 0x0028   (0x0004)  
	int32_t                                            MaxBulletCount;                                             // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckMuzzleVelocity
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckMuzzleVelocity : public UCheckItemParamBase
{ 
public:
	float                                              MinMuzzleVelocity;                                          // 0x0028   (0x0004)  
	float                                              MaxMuzzleVelocity;                                          // 0x002C   (0x0004)  
};

/// Class /Script/UAGame.CheckAdsMoa
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UCheckAdsMoa : public UCheckItemParamBase
{ 
public:
	float                                              AdsMoaXMin;                                                 // 0x0028   (0x0004)  
	float                                              AdsMoaXMax;                                                 // 0x002C   (0x0004)  
	float                                              AdsMoaYMin;                                                 // 0x0030   (0x0004)  
	float                                              AdsMoaYMax;                                                 // 0x0034   (0x0004)  
};

/// Class /Script/UAGame.CheckLootPointType
/// Size: 0x0010 (16 bytes) (0x000028 - 0x000038) align 8 pad: 0x0000
class UCheckLootPointType : public UCheckItemParamBase
{ 
public:
	TArray<int32_t>                                    LootPointTypes;                                             // 0x0028   (0x0010)  
};

/// Class /Script/UAGame.CheckWeaponCanFire
/// Size: 0x0008 (8 bytes) (0x000028 - 0x000030) align 8 pad: 0x0000
class UCheckWeaponCanFire : public UCheckItemParamBase
{ 
public:
	bool                                               IsCanFire;                                                  // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_CheckItem
/// Size: 0x0020 (32 bytes) (0x000050 - 0x000070) align 8 pad: 0x0000
class UQuestConditionComp_CheckItem : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckCharacterContextSource;                                // 0x0050   (0x0008)  
	class UClass*                                      CheckTargetContextSource;                                   // 0x0058   (0x0008)  
	TArray<class UCheckItemParamBase*>                 CheckParams;                                                // 0x0060   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_CheckItemID
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UQuestConditionComp_CheckItemID : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<uint64_t>                                   CheckItemIDs;                                               // 0x0058   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_CheckNumber
/// Size: 0x0020 (32 bytes) (0x000050 - 0x000070) align 8 pad: 0x0000
class UQuestConditionComp_CheckNumber : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	bool                                               bIntNumber;                                                 // 0x0058   (0x0001)  
	ENumberCompareType                                 CompareType;                                                // 0x0059   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x005A   (0x0002)  MISSED
	int32_t                                            MinIntValue;                                                // 0x005C   (0x0004)  
	int32_t                                            MaxIntValue;                                                // 0x0060   (0x0004)  
	float                                              MinFloatValue;                                              // 0x0064   (0x0004)  
	float                                              MaxFloatValue;                                              // 0x0068   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x006C   (0x0004)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_CheckPlayerLevel
/// Size: 0x0010 (16 bytes) (0x000050 - 0x000060) align 8 pad: 0x0000
class UQuestConditionComp_CheckPlayerLevel : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	int32_t                                            MinLevel;                                                   // 0x0058   (0x0004)  
	int32_t                                            MaxLevel;                                                   // 0x005C   (0x0004)  
};

/// Class /Script/UAGame.QuestConditionComp_CheckUseInventoryPhase
/// Size: 0x0010 (16 bytes) (0x000050 - 0x000060) align 8 pad: 0x0000
class UQuestConditionComp_CheckUseInventoryPhase : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	EUseInventoryPhase                                 UseInventoryPhase;                                          // 0x0058   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0059   (0x0007)  MISSED
};

/// Struct /Script/UAGame.TimeOfDay
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 pad: 0x0000
struct FTimeOfDay
{ 
	int32_t                                            Hour;                                                       // 0x0000   (0x0004)  
	int32_t                                            Minute;                                                     // 0x0004   (0x0004)  
	int32_t                                            Second;                                                     // 0x0008   (0x0004)  
};

/// Class /Script/UAGame.QuestConditionComp_CurrentTODTime
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UQuestConditionComp_CurrentTODTime : public UMFQuestConditionComponentBase
{ 
public:
	FTimeOfDay                                         StartTime;                                                  // 0x0050   (0x000C)  
	FTimeOfDay                                         EndTime;                                                    // 0x005C   (0x000C)  
};

/// Class /Script/UAGame.QuestConditionComp_EscapeVolume
/// Size: 0x0020 (32 bytes) (0x000050 - 0x000070) align 8 pad: 0x0000
class UQuestConditionComp_EscapeVolume : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<int32_t>                                    EscapePointIDs;                                             // 0x0058   (0x0010)  
	ETraceMarkOperatorType                             OperatorType;                                               // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0069   (0x0003)  MISSED
	int32_t                                            ConfigID;                                                   // 0x006C   (0x0004)  
};

/// Class /Script/UAGame.QuestConditionComp_MapName
/// Size: 0x0010 (16 bytes) (0x000050 - 0x000060) align 8 pad: 0x0000
class UQuestConditionComp_MapName : public UMFQuestConditionComponentBase
{ 
public:
	FString                                            MapName;                                                    // 0x0050   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_MvItemFail_T
/// Size: 0x0008 (8 bytes) (0x000050 - 0x000058) align 8 pad: 0x0000
class UQuestConditionComp_MvItemFail_T : public UMFQuestConditionComponentBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0050   (0x0008)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestConditionComp_MvItemFail_T.OnMoveResult
	// void OnMoveResult();                                                                                                     // [0x35fae50] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestConditionComp_PlayerEndGameType
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UQuestConditionComp_PlayerEndGameType : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<EPlayerEndGameType>                         PlayerEndGameTypes;                                         // 0x0058   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_PlayModeId
/// Size: 0x0050 (80 bytes) (0x000050 - 0x0000A0) align 8 pad: 0x0000
class UQuestConditionComp_PlayModeId : public UMFQuestConditionComponentBase
{ 
public:
	TArray<int32_t>                                    ModeIDArray;                                                // 0x0050   (0x0010)  
	TArray<int32_t>                                    SubModeIDArray;                                             // 0x0060   (0x0010)  
	TArray<int32_t>                                    MapIDArray;                                                 // 0x0070   (0x0010)  
	TArray<int32_t>                                    RuleIdArray;                                                // 0x0080   (0x0010)  
	TArray<int32_t>                                    DifficultyArray;                                            // 0x0090   (0x0010)  
};

/// Class /Script/UAGame.QuestConditionComp_RecoveryAttributeType
/// Size: 0x0008 (8 bytes) (0x000050 - 0x000058) align 8 pad: 0x0000
class UQuestConditionComp_RecoveryAttributeType : public UMFQuestConditionComponentBase
{ 
public:
	ESGRecoveryAttributeType                           RecoveryAttributeType;                                      // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0051   (0x0007)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_StayVolume
/// Size: 0x0050 (80 bytes) (0x000050 - 0x0000A0) align 8 pad: 0x0000
class UQuestConditionComp_StayVolume : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	TArray<int32_t>                                    ValidVolumeIDs;                                             // 0x0058   (0x0010)  
	TArray<FString>                                    ValidVolumeNames;                                           // 0x0068   (0x0010)  
	bool                                               bForceUsePointMark;                                         // 0x0078   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0079   (0x0007)  MISSED
	TArray<class ASGVolume*>                           ValidVolumes;                                               // 0x0080   (0x0010)  
	ETraceMarkOperatorType                             OperatorType;                                               // 0x0090   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0091   (0x0003)  MISSED
	int32_t                                            ConfigID;                                                   // 0x0094   (0x0004)  
	unsigned char                                      UnknownData02_7[0x8];                                       // 0x0098   (0x0008)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_TakeLimit
/// Size: 0x0018 (24 bytes) (0x000050 - 0x000068) align 8 pad: 0x0000
class UQuestConditionComp_TakeLimit : public UMFQuestConditionComponentBase
{ 
public:
	TArray<uint64_t>                                   ItemTypeIDs;                                                // 0x0050   (0x0010)  
	EQuestTakeLimitLogicType                           LogicType;                                                  // 0x0060   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0061   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestConditionComp_TakeLimit.RefreshTakeLimitResult
	// void RefreshTakeLimitResult();                                                                                           // [0x35fb0a0] Final|Native|Protected 
	// Function /Script/UAGame.QuestConditionComp_TakeLimit.RefreshProgressWhenReadyToPlay
	// void RefreshProgressWhenReadyToPlay(class ASGCharacter* SGCharacter);                                                    // [0x35fb010] Final|Native|Protected 
	// Function /Script/UAGame.QuestConditionComp_TakeLimit.OnProcessPawn
	// void OnProcessPawn(class APawn* Pawn);                                                                                   // [0x35faf80] Final|Native|Protected 
	// Function /Script/UAGame.QuestConditionComp_TakeLimit.OnCharacterReadyToPlay
	// void OnCharacterReadyToPlay(class ASGCharacter* Character);                                                              // [0x35fadc0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestConditionComp_TeamInfo
/// Size: 0x0030 (48 bytes) (0x000050 - 0x000080) align 8 pad: 0x0000
class UQuestConditionComp_TeamInfo : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	ETeamInfoCheckType                                 TeamInfoCheckType;                                          // 0x0058   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0059   (0x0007)  MISSED
	FString                                            StringValue1;                                               // 0x0060   (0x0010)  
	FString                                            StringValue2;                                               // 0x0070   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestConditionComp_TeamInfo.IsPassCheck
	// bool IsPassCheck(class AActor* Actor);                                                                                   // [0x2897200] Native|Public        
};

/// Class /Script/UAGame.QuestConditionComp_TimeAfterActivation
/// Size: 0x0010 (16 bytes) (0x000050 - 0x000060) align 8 pad: 0x0000
class UQuestConditionComp_TimeAfterActivation : public UMFQuestConditionComponentBase
{ 
public:
	ENumCompareType                                    CompareType;                                                // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0051   (0x0003)  MISSED
	int32_t                                            Value1;                                                     // 0x0054   (0x0004)  
	int32_t                                            Value2;                                                     // 0x0058   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x005C   (0x0004)  MISSED
};

/// Class /Script/UAGame.QuestConditionComp_TimeLimit
/// Size: 0x0020 (32 bytes) (0x000050 - 0x000070) align 8 pad: 0x0000
class UQuestConditionComp_TimeLimit : public UMFQuestConditionComponentBase
{ 
public:
	class UClass*                                      CheckTargetContextSource;                                   // 0x0050   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0058   (0x0008)  MISSED
	ETimeLimitType                                     TimeLimitType;                                              // 0x0060   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0061   (0x0003)  MISSED
	int32_t                                            TimeLimitSeconds;                                           // 0x0064   (0x0004)  
	int32_t                                            TimeRecordCount;                                            // 0x0068   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x006C   (0x0004)  MISSED
};

/// Class /Script/UAGame.QuestContextSource_ArmorType
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_ArmorType : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_BodyParts
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_BodyParts : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_CharacterEnduranceType
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_CharacterEnduranceType : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_CharacterGameEffectType
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_CharacterGameEffectType : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_DamageInfo
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_DamageInfo : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_PlayerEndGameType
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_PlayerEndGameType : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_RecoveryAttributeType
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_RecoveryAttributeType : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_Teammate
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_Teammate : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_UseInventoryPhase
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_UseInventoryPhase : public UMFQuestContextSourceBase
{ 
public:
};

/// Class /Script/UAGame.QuestContextSource_Weapon
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UQuestContextSource_Weapon : public UMFQuestContextSourceBase
{ 
public:
};

/// Struct /Script/UAGame.DistributeQuestHistory
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FDistributeQuestHistory
{ 
	class AMFQuestDistributerBase*                     QuestDistributer;                                           // 0x0000   (0x0008)  
	ECharacterType                                     TriggerCharacterType;                                       // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            TriggerCharacterLevel;                                      // 0x000C   (0x0004)  
	int32_t                                            GraphID;                                                    // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Class /Script/UAGame.QuestDistributerSubsystem
/// Size: 0x0048 (72 bytes) (0x000030 - 0x000078) align 8 pad: 0x0000
class UQuestDistributerSubsystem : public UWorldSubsystem
{ 
public:
	TArray<FString>                                    QuestDistPathList;                                          // 0x0030   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0040   (0x0008)  MISSED
	TArray<class UBlueprintGeneratedClass*>            BlueprintGeneratedClasses;                                  // 0x0048   (0x0010)  
	TArray<class AMFQuestDistributerBase*>             SpawnedQuestDistributers;                                   // 0x0058   (0x0010)  
	TArray<FDistributeQuestHistory>                    DistributeQuestHistories;                                   // 0x0068   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestDistributerSubsystem.OnBeginGameInit
	// void OnBeginGameInit();                                                                                                  // [0x35fada0] Final|Native|Protected 
	// Function /Script/UAGame.QuestDistributerSubsystem.GetSpawnedQuestDistributers
	// TArray<AMFQuestDistributerBase*> GetSpawnedQuestDistributers();                                                          // [0x35fad20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.QuestDistributerSubsystem.GetDistributeQuestHistories
	// TArray<FDistributeQuestHistory> GetDistributeQuestHistories();                                                           // [0x35faca0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/UAGame.QuestEffect_ActivateLootPoint
/// Size: 0x0050 (80 bytes) (0x000038 - 0x000088) align 8 pad: 0x0000
class UQuestEffect_ActivateLootPoint : public UMFQuestEffectBase
{ 
public:
	SDK_UNDEFINED(80,2380) /* TMap<int64_t, FActivateLootPointConfigs> */ __um(ActivateLootPointConfigs);          // 0x0038   (0x0050)  
};

/// Class /Script/UAGame.QuestEffect_Broadcast
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000080) align 8 pad: 0x0000
class UQuestEffect_Broadcast : public UMFQuestEffectBase
{ 
public:
	class UClass*                                      RelatedTargetContextSource;                                 // 0x0038   (0x0008)  
	TArray<ERelatedTargetType>                         RelatedTargetTypes;                                         // 0x0040   (0x0010)  
	FBroadcastOnGameHUDConfig                          GameHUDConfig;                                              // 0x0050   (0x0030)  
};

/// Class /Script/UAGame.QuestEffect_BroadcastAchievement
/// Size: 0x0000 (0 bytes) (0x000038 - 0x000038) align 8 pad: 0x0000
class UQuestEffect_BroadcastAchievement : public UMFQuestEffectBase
{ 
public:
};

/// Class /Script/UAGame.QuestEffect_DistributeQuest
/// Size: 0x0028 (40 bytes) (0x000038 - 0x000060) align 8 pad: 0x0000
class UQuestEffect_DistributeQuest : public UMFQuestEffectBase
{ 
public:
	class UClass*                                      TargetContextSource;                                        // 0x0038   (0x0008)  
	TArray<ERelatedTargetType>                         RelatedTargetTypes;                                         // 0x0040   (0x0010)  
	bool                                               bUseRandomQuestTable;                                       // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0051   (0x0003)  MISSED
	int32_t                                            GraphID;                                                    // 0x0054   (0x0004)  
	class UDataTable*                                  RandomQuestTable;                                           // 0x0058   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestEffect_DistributeQuest.DistributeQuest
	// void DistributeQuest(class ACharacter* Character, int32_t DistributeQuestID, EQuestType QuestType);                      // [0x35ff6a0] Final|Native|Public  
};

/// Struct /Script/UAGame.GiveItemInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FGiveItemInfo
{ 
	int32_t                                            ItemID;                                                     // 0x0000   (0x0004)  
	int32_t                                            MinStackCount;                                              // 0x0004   (0x0004)  
	int32_t                                            MaxStackCount;                                              // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	class UClass*                                      InventoryClass;                                             // 0x0010   (0x0008)  
};

/// Class /Script/UAGame.QuestEffect_GiveItem
/// Size: 0x0028 (40 bytes) (0x000038 - 0x000060) align 8 pad: 0x0000
class UQuestEffect_GiveItem : public UMFQuestEffectBase
{ 
public:
	class UClass*                                      TargetContextSource;                                        // 0x0038   (0x0008)  
	TArray<ERelatedTargetType>                         RelatedTargetTypes;                                         // 0x0040   (0x0010)  
	TArray<FGiveItemInfo>                              GiveItemInfos;                                              // 0x0050   (0x0010)  
};

/// Class /Script/UAGame.QuestEffect_ModifyAchievement
/// Size: 0x0010 (16 bytes) (0x000038 - 0x000048) align 8 pad: 0x0000
class UQuestEffect_ModifyAchievement : public UMFQuestEffectBase
{ 
public:
	class UClass*                                      ModifyTarget;                                               // 0x0038   (0x0008)  
	class UClass*                                      ModifyValueSource;                                          // 0x0040   (0x0008)  
};

/// Struct /Script/UAGame.RandomEscapePoint
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FRandomEscapePoint
{ 
	int32_t                                            EscapePointID;                                              // 0x0000   (0x0004)  
	int32_t                                            Weight;                                                     // 0x0004   (0x0004)  
};

/// Class /Script/UAGame.QuestEffect_ModifyEscapePoint
/// Size: 0x0050 (80 bytes) (0x000038 - 0x000088) align 8 pad: 0x0000
class UQuestEffect_ModifyEscapePoint : public UMFQuestEffectBase
{ 
public:
	FTimerHandle                                       TickTimerHandle;                                            // 0x0038   (0x0008)  
	bool                                               bOpenEscapePoint;                                           // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0041   (0x0003)  MISSED
	int32_t                                            RandomEscapePoint;                                          // 0x0044   (0x0004)  
	TArray<FRandomEscapePoint>                         RandomEscapePointIDs;                                       // 0x0048   (0x0010)  
	TArray<int32_t>                                    EscapePointIDs;                                             // 0x0058   (0x0010)  
	ECharacterType                                     CharacterType;                                              // 0x0068   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0069   (0x0007)  MISSED
	TArray<FString>                                    EscapePresetNames;                                          // 0x0070   (0x0010)  
	bool                                               bUseCharacterType;                                          // 0x0080   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0081   (0x0003)  MISSED
	float                                              DelayTime;                                                  // 0x0084   (0x0004)  


	/// Functions
	// Function /Script/UAGame.QuestEffect_ModifyEscapePoint.OnTimer
	// void OnTimer();                                                                                                          // [0x3600c70] Final|Native|Protected 
};

/// Struct /Script/UAGame.AICharacterMarkableInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FAICharacterMarkableInfo
{ 
	int64_t                                            AIID;                                                       // 0x0000   (0x0008)  
	ESpawnReason                                       SpawnReason;                                                // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            ConfigID;                                                   // 0x000C   (0x0004)  
};

/// Struct /Script/UAGame.InventoryMarkableInfo
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FInventoryMarkableInfo
{ 
	int32_t                                            ItemID;                                                     // 0x0000   (0x0004)  
	int32_t                                            ConfigID;                                                   // 0x0004   (0x0004)  
};

/// Struct /Script/UAGame.VolumeMarkableInfo
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FVolumeMarkableInfo
{ 
	int32_t                                            VolumeID;                                                   // 0x0000   (0x0004)  
	int32_t                                            ConfigID;                                                   // 0x0004   (0x0004)  
};

/// Class /Script/UAGame.QuestEffect_ModifyMarkable
/// Size: 0x0058 (88 bytes) (0x000038 - 0x000090) align 8 pad: 0x0000
class UQuestEffect_ModifyMarkable : public UMFQuestEffectBase
{ 
public:
	class UClass*                                      RelatedTargetContextSource;                                 // 0x0038   (0x0008)  
	TArray<ERelatedTargetType>                         RelatedTargetTypes;                                         // 0x0040   (0x0010)  
	bool                                               bMarkable;                                                  // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0051   (0x0007)  MISSED
	class UClass*                                      AICharacterMarkContextSource;                               // 0x0058   (0x0008)  
	TArray<FAICharacterMarkableInfo>                   AICharacterMarkables;                                       // 0x0060   (0x0010)  
	TArray<FInventoryMarkableInfo>                     InventoryMarkables;                                         // 0x0070   (0x0010)  
	TArray<FVolumeMarkableInfo>                        VolumeMarkables;                                            // 0x0080   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestEffect_ModifyMarkable.ModifyVolumeMarkable
	// void ModifyVolumeMarkable(class UUAPlayerStateTraceComponent* InPlayerStateTraceComponent, TArray<AActor*> InVolumeActors); // [0x3600a30] Final|Native|Protected 
	// Function /Script/UAGame.QuestEffect_ModifyMarkable.ModifyInventoryMarkable
	// void ModifyInventoryMarkable(class UUAPlayerStateTraceComponent* InPlayerStateTraceComponent, TArray<AActor*> InInventoryActors); // [0x36008c0] Final|Native|Protected 
	// Function /Script/UAGame.QuestEffect_ModifyMarkable.ModifyAICharacterMarkable
	// void ModifyAICharacterMarkable(class UUAPlayerStateTraceComponent* InPlayerStateTraceComponent, class ASGAICharacter* InMarkAICharacter); // [0x36007f0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestEffect_ResetAchievement
/// Size: 0x0008 (8 bytes) (0x000038 - 0x000040) align 8 pad: 0x0000
class UQuestEffect_ResetAchievement : public UMFQuestEffectBase
{ 
public:
	class UClass*                                      ModifyTarget;                                               // 0x0038   (0x0008)  
};

/// Class /Script/UAGame.QuestEffect_SpawnActorAtPylon
/// Size: 0x0030 (48 bytes) (0x000038 - 0x000068) align 8 pad: 0x0000
class UQuestEffect_SpawnActorAtPylon : public UMFQuestEffectBase
{ 
public:
	class UClass*                                      SpawnActorClass;                                            // 0x0038   (0x0008)  
	bool                                               bUsePylonIDMapTable;                                        // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0041   (0x0007)  MISSED
	class UClass*                                      TargetContextSource;                                        // 0x0048   (0x0008)  
	class UDataTable*                                  PylonIDTable;                                               // 0x0050   (0x0008)  
	TArray<int32_t>                                    PylonIDs;                                                   // 0x0058   (0x0010)  
};

/// Struct /Script/UAGame.TriggerSpawnByAreaParams
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FTriggerSpawnByAreaParams
{ 
	int32_t                                            SquadID;                                                    // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FString>                                    SpawnAreas;                                                 // 0x0008   (0x0010)  
	int32_t                                            Weight;                                                     // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/UAGame.TriggerSpawnByAreaConfig
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FTriggerSpawnByAreaConfig
{ 
	int32_t                                            SpawnNum;                                                   // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FTriggerSpawnByAreaParams>                  AreaParams;                                                 // 0x0008   (0x0010)  
};

/// Struct /Script/UAGame.TriggerSpawnByVolumeParams
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FTriggerSpawnByVolumeParams
{ 
	TArray<int32_t>                                    VolumeIDs;                                                  // 0x0000   (0x0010)  
	int32_t                                            Weight;                                                     // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UAGame.TriggerSpawnByVolumeConfig
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FTriggerSpawnByVolumeConfig
{ 
	int32_t                                            SpawnNum;                                                   // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FTriggerSpawnByVolumeParams>                VolumeParams;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/UAGame.TriggerSpawnByEventParams
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FTriggerSpawnByEventParams
{ 
	TArray<FString>                                    EventStrs;                                                  // 0x0000   (0x0010)  
	int32_t                                            Weight;                                                     // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/UAGame.TriggerSpawnByEventConfig
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FTriggerSpawnByEventConfig
{ 
	int32_t                                            SpawnNum;                                                   // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FTriggerSpawnByEventParams>                 EventParams;                                                // 0x0008   (0x0010)  
};

/// Class /Script/UAGame.QuestEffect_SpawnAI
/// Size: 0x0058 (88 bytes) (0x000038 - 0x000090) align 8 pad: 0x0000
class UQuestEffect_SpawnAI : public UMFQuestEffectBase
{ 
public:
	FTriggerSpawnByAreaConfig                          TriggerSpawnByAreaConfig;                                   // 0x0038   (0x0018)  
	FTriggerSpawnByVolumeConfig                        TriggerSpawnByVolumeConfig;                                 // 0x0050   (0x0018)  
	FTriggerSpawnByEventConfig                         TriggerSpawnByEventConfig;                                  // 0x0068   (0x0018)  
	TArray<FString>                                    EventStrs;                                                  // 0x0080   (0x0010)  
};

/// Struct /Script/UAGame.QuestEffectSpawnInteractItemInfo
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 pad: 0x0000
struct FQuestEffectSpawnInteractItemInfo
{ 
	int64_t                                            SpawnPointID;                                               // 0x0000   (0x0008)  
	class UClass*                                      InteractItemClass;                                          // 0x0008   (0x0008)  
	int32_t                                            Weight;                                                     // 0x0010   (0x0004)  
	bool                                               bQuestActionRelevantToActors;                               // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0015   (0x0003)  MISSED
	class UClass*                                      TargetContextSource;                                        // 0x0018   (0x0008)  
	TArray<ERelatedTargetType>                         RelatedTargetTypes;                                         // 0x0020   (0x0010)  
};

/// Class /Script/UAGame.QuestEffect_SpawnInteractItem
/// Size: 0x0028 (40 bytes) (0x000038 - 0x000060) align 8 pad: 0x0000
class UQuestEffect_SpawnInteractItem : public UMFQuestEffectBase
{ 
public:
	int32_t                                            SpawnInteractItemNum;                                       // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	TArray<FQuestEffectSpawnInteractItemInfo>          SpawnInteractItemInfos;                                     // 0x0040   (0x0010)  
	TArray<class ASGNetRelevantConfigurableActor*>     SpawnedInteractItem;                                        // 0x0050   (0x0010)  
};

/// Struct /Script/UAGame.QuestEffectSpawnInventoryInfo
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FQuestEffectSpawnInventoryInfo
{ 
	int64_t                                            SpawnPointID;                                               // 0x0000   (0x0008)  
	class UClass*                                      ContainerClass;                                             // 0x0008   (0x0008)  
	TArray<int64_t>                                    ItemIDs;                                                    // 0x0010   (0x0010)  
	int32_t                                            Weight;                                                     // 0x0020   (0x0004)  
	int32_t                                            ConfigID;                                                   // 0x0024   (0x0004)  
	class UClass*                                      TargetContextSource;                                        // 0x0028   (0x0008)  
	TArray<ERelatedTargetType>                         RelatedTargetTypes;                                         // 0x0030   (0x0010)  
};

/// Class /Script/UAGame.QuestEffect_SpawnInventory
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000080) align 8 pad: 0x0000
class UQuestEffect_SpawnInventory : public UMFQuestEffectBase
{ 
public:
	FVector                                            SpawnLocation;                                              // 0x0038   (0x000C)  
	FRotator                                           SpawnRotation;                                              // 0x0044   (0x000C)  
	class UClass*                                      ContainerClass;                                             // 0x0050   (0x0008)  
	TArray<int64_t>                                    ItemIDs;                                                    // 0x0058   (0x0010)  
	int32_t                                            SpawnInventoryNum;                                          // 0x0068   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x006C   (0x0004)  MISSED
	TArray<FQuestEffectSpawnInventoryInfo>             SpawnInventoryInfos;                                        // 0x0070   (0x0010)  
};

/// Struct /Script/UAGame.QuestEffectSpawnPickupInfo
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 pad: 0x0000
struct FQuestEffectSpawnPickupInfo
{ 
	int64_t                                            SpawnPointID;                                               // 0x0000   (0x0008)  
	class UClass*                                      PickupClass;                                                // 0x0008   (0x0008)  
	int32_t                                            Weight;                                                     // 0x0010   (0x0004)  
	int32_t                                            ConfigID;                                                   // 0x0014   (0x0004)  
	class UClass*                                      TargetContextSource;                                        // 0x0018   (0x0008)  
	TArray<ERelatedTargetType>                         RelatedTargetTypes;                                         // 0x0020   (0x0010)  
};

/// Class /Script/UAGame.QuestEffect_SpawnPickup
/// Size: 0x0018 (24 bytes) (0x000038 - 0x000050) align 8 pad: 0x0000
class UQuestEffect_SpawnPickup : public UMFQuestEffectBase
{ 
public:
	int32_t                                            SpawnPickupNum;                                             // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	TArray<FQuestEffectSpawnPickupInfo>                SpawnPickupInfos;                                           // 0x0040   (0x0010)  
};

/// Class /Script/UAGame.QuestItemSpawnPoint
/// Size: 0x0020 (32 bytes) (0x000308 - 0x000328) align 8 pad: 0x0000
class AQuestItemSpawnPoint : public ANavigationObjectBase
{ 
public:
	int32_t                                            SpawnPointID;                                               // 0x0308   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x030C   (0x0004)  MISSED
	class ACharacter*                                  CurrentInstigator;                                          // 0x0310   (0x0008)  
	TArray<class UClass*>                              AdditionComponents;                                         // 0x0318   (0x0010)  
};

/// Class /Script/UAGame.QuestManagerActor
/// Size: 0x0070 (112 bytes) (0x0002F0 - 0x000360) align 8 pad: 0x0000
class AQuestManagerActor : public AMFQuestManagerActor
{ 
public:
	class UDataTable*                                  QuestTable;                                                 // 0x02F0   (0x0008)  
	class UDataTable*                                  ActQuestTemplateTable;                                      // 0x02F8   (0x0008)  
	TArray<int32_t>                                    TraceTasks;                                                 // 0x0300   (0x0010)  
	int32_t                                            MaxTraceNum;                                                // 0x0310   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0314   (0x0004)  MISSED
	class UClass*                                      DummyQuestClass;                                            // 0x0318   (0x0008)  
	TArray<int32_t>                                    TutorialHintItemIDs;                                        // 0x0320   (0x0010)  
	TArray<EUAHUDNewBagWidgetIdentification>           TutorialHintSelfBagWidgetIDs;                               // 0x0330   (0x0010)  
	TArray<EUAHUDNewBagWidgetIdentification>           TutorialHintCorpseBagWidgetIDs;                             // 0x0340   (0x0010)  
	TArray<FString>                                    TutorialHintWidgetPaths;                                    // 0x0350   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestManagerActor.SetTutorialHintWidgets
	// void SetTutorialHintWidgets(TArray<FString>& InWidgetPaths);                                                             // [0x3601090] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.SetTutorialHintItemIDs
	// void SetTutorialHintItemIDs(TArray<int32_t>& InItemIDs);                                                                 // [0x3600fe0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.SetTutorialHintBagWidgetIDs
	// void SetTutorialHintBagWidgetIDs(bool bIsCorpse, TArray<EUAHUDNewBagWidgetIdentification>& InWidgetIDs);                 // [0x3600ee0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.SaveTraceQuest
	// void SaveTraceQuest();                                                                                                   // [0x3600ec0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.ResetTraceTask
	// void ResetTraceTask(int32_t TaskId);                                                                                     // [0x3600e30] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.RemoveTraceTask
	// void RemoveTraceTask(int32_t TaskId);                                                                                    // [0x3600da0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.RemoveCompleteTraceTask
	// void RemoveCompleteTraceTask();                                                                                          // [0x3600d80] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.RefreshQuestBeforeState
	// void RefreshQuestBeforeState(int32_t InQuestID, class APlayerController* InPC);                                          // [0x3600cb0] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.PrintReplicateData
	// void PrintReplicateData();                                                                                               // [0x3600c90] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.OnQuestGraphStatusChange
	// void OnQuestGraphStatusChange(class UMFQuestNodeGraph* NodeGraph, EQuestStatus NewStatus);                               // [0x3600ba0] Final|Native|Protected 
	// Function /Script/UAGame.QuestManagerActor.LoadTraceQuest
	// void LoadTraceQuest();                                                                                                   // [0x36007d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.IsSeasonQuest
	// bool IsSeasonQuest(int32_t InGraphID);                                                                                   // [0x3600730] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.GetTutorialHintWidgets
	// TArray<FString> GetTutorialHintWidgets();                                                                                // [0x3600700] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.QuestManagerActor.GetTutorialHintItemIDs
	// TArray<int32_t> GetTutorialHintItemIDs();                                                                                // [0x295eb70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.QuestManagerActor.GetTutorialHintBagWidgetIDs
	// TArray<EUAHUDNewBagWidgetIdentification> GetTutorialHintBagWidgetIDs(bool bIsCorpse);                                    // [0x3600620] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/UAGame.QuestManagerActor.GetTraceTasks
	// TArray<int32_t> GetTraceTasks();                                                                                         // [0x36005a0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.QuestManagerActor.GetQuestIDFromQuest
	// int32_t GetQuestIDFromQuest(class AMFQuestBase* InQuest);                                                                // [0x3600500] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.GetQuestGraphIDFromQuestGraph
	// int32_t GetQuestGraphIDFromQuestGraph(class UMFQuestNodeGraph* InGraph);                                                 // [0x3600460] Native|Public        
	// Function /Script/UAGame.QuestManagerActor.GetQuestGraphByID
	// class UMFQuestNodeGraph* GetQuestGraphByID(int32_t InGraphID, class APlayerController* InPlayerController);              // [0x3600390] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.GetQuestDataWithID
	// FQuestReplicateData GetQuestDataWithID(int32_t InGraphID, class APlayerController* InPC);                                // [0x3600230] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.QuestManagerActor.GetPlayerSeasonQuestsPartByState
	// void GetPlayerSeasonQuestsPartByState(class APlayerController* InPC, TArray<FQuestReplicateData>& InProgress, TArray<FQuestReplicateData>& Success, TArray<FQuestReplicateData>& Fail); // [0x35ffff0] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.QuestManagerActor.GetPlayerQuestTraceInfos
	// TArray<FTraceableActorInfo> GetPlayerQuestTraceInfos(class APlayerController* InPC);                                     // [0x35ffba0] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.GetPlayerQuestTraceInfoByTargetID
	// FTraceableActorInfo GetPlayerQuestTraceInfoByTargetID(class APlayerController* InPC, int32_t TargetId);                  // [0x35ffa80] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.GetPlayerQuestsPartByState
	// void GetPlayerQuestsPartByState(class APlayerController* InPC, TArray<FQuestReplicateData>& InProgress, TArray<FQuestReplicateData>& Success, TArray<FQuestReplicateData>& Fail); // [0x35ffdb0] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.QuestManagerActor.GetPlayerQuests
	// TArray<FQuestReplicateData> GetPlayerQuests(class APlayerController* InPC);                                              // [0x35ffc80] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.QuestManagerActor.GetMaxTraceNum
	// int32_t GetMaxTraceNum();                                                                                                // [0x35ffa50] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.QuestManagerActor.GetGraphQuestFromQuestID
	// class AMFQuestBase* GetGraphQuestFromQuestID(class UMFQuestNodeGraph* InGraph, int32_t InQuestID);                       // [0x35ff980] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.GetGraphIDFromQuest
	// int32_t GetGraphIDFromQuest(class AMFQuestBase* InQuest);                                                                // [0x35ff8e0] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.GetAllQuestInventoryData
	// TArray<FQuestInventory> GetAllQuestInventoryData(class APlayerController* PC);                                           // [0x35ff7b0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/UAGame.QuestManagerActor.CreateNewQuestGraphWithID
	// class UMFQuestNodeGraph* CreateNewQuestGraphWithID(int32_t InGraphID, class AController* InController, bool bAct);       // [0x35ff580] Native|Public        
	// Function /Script/UAGame.QuestManagerActor.CreateNewQuestFromID
	// class AMFQuestBase* CreateNewQuestFromID(int32_t InGraphID, int32_t InQuestID, class AController* InController);         // [0x35ff470] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerActor.CreateNewQuestFromCreateData
	// class AMFQuestBase* CreateNewQuestFromCreateData(FTaskCreateData& InTaskCreateData, FQuestCreateData& InQuestCreateData); // [0x35ff2e0] Final|Native|Public|HasOutParms 
	// Function /Script/UAGame.QuestManagerActor.ClearTutorialHint
	// void ClearTutorialHint();                                                                                                // [0x35ff2c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.ClearTraceTask
	// void ClearTraceTask();                                                                                                   // [0x35ff2a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.AutoTraceOneQuest
	// void AutoTraceOneQuest();                                                                                                // [0x35ff280] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestManagerActor.AddTraceTask
	// void AddTraceTask(int32_t TaskId);                                                                                       // [0x35ff1f0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/UAGame.QuestManagerComponent
/// Size: 0x0038 (56 bytes) (0x000108 - 0x000140) align 16 pad: 0x0000
class UQuestManagerComponent : public UMFQuestManagerComponent
{ 
public:
	float                                              MaxSecondInOneFrame;                                        // 0x0108   (0x0004)  
	unsigned char                                      UnknownData00_6[0x14];                                      // 0x010C   (0x0014)  MISSED
	TArray<class UMFQuestNodeGraph*>                   WaitDestroyGraph;                                           // 0x0120   (0x0010)  
	TArray<class APlayerController*>                   HasFinishPC;                                                // 0x0130   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestManagerComponent.OnGameModePlayerFinishGame
	// void OnGameModePlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x36048f0] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerComponent.DoDestroyGraph
	// void DoDestroyGraph();                                                                                                   // [0x3604230] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerComponent.DoCreateTask
	// void DoCreateTask();                                                                                                     // [0x3604210] Final|Native|Public  
	// Function /Script/UAGame.QuestManagerComponent.AddTaskData
	// void AddTaskData(FTaskCreateData TaskCreateData, class APlayerController* PC);                                           // [0x3603e70] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjCom_TakeOutItemType
/// Size: 0x0058 (88 bytes) (0x000168 - 0x0001C0) align 8 pad: 0x0000
class UQuestObjCom_TakeOutItemType : public UMFQuestObjectiveComponentBase
{ 
public:
	int32_t                                            LimitItemMainMidTypePreix;                                  // 0x0168   (0x0004)  
	unsigned char                                      UnknownData00_7[0x54];                                      // 0x016C   (0x0054)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjCom_TakeOutItemType.OnPlayerFinishGame
	// void OnPlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x3605600] Final|Native|Public  
	// Function /Script/UAGame.QuestObjCom_TakeOutItemType.OnPlayerDied
	// void OnPlayerDied(class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, FDamageEvent& DamageEvent, class AActor* KillerWeapon, float KillDistance, ECharacterEnduranceType EnduranceType, class UDamageEventObject* DamageEventObject); // [0x36050e0] Final|Native|Public|HasOutParms 
};

/// Class /Script/UAGame.QuestObjectiveComp_AIMove_T
/// Size: 0x0030 (48 bytes) (0x000168 - 0x000198) align 8 pad: 0x0000
class UQuestObjectiveComp_AIMove_T : public UMFQuestObjectiveComponentBase
{ 
public:
	TArray<class ASGCharacter*>                        AllCharacter;                                               // 0x0168   (0x0010)  
	TArray<class ASGAISpawnPoint*>                     AllAISpawnPoint;                                            // 0x0178   (0x0010)  
	TArray<class ASGCharacter*>                        ArriveCharacter;                                            // 0x0188   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_AIMove_T.CharacterArrive
	// void CharacterArrive(class ASGCharacter* Character);                                                                     // [0x36040f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/UAGame.QuestObjectiveComp_AIMove_T.BP_DeactivateQuestComponent
	// void BP_DeactivateQuestComponent();                                                                                      // [0x3a75280] Event|Public|BlueprintEvent 
	// Function /Script/UAGame.QuestObjectiveComp_AIMove_T.BP_ActivateQuestComponent
	// void BP_ActivateQuestComponent();                                                                                        // [0x3a75280] Event|Public|BlueprintEvent 
};

/// Class /Script/UAGame.QuestObjectiveComp_Assemble_T
/// Size: 0x0010 (16 bytes) (0x000168 - 0x000178) align 8 pad: 0x0000
class UQuestObjectiveComp_Assemble_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class UClass*                                      ItemClass;                                                  // 0x0168   (0x0008)  
	class UClass*                                      WeaponClass;                                                // 0x0170   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Assemble_T.OnWeaponAssemble
	// void OnWeaponAssemble(class ACharacter* Character, class ASGInventory* Weapon, class ASGInventory* ChildInventory);      // [0x3605e40] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_AttractAI
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_AttractAI : public UMFQuestObjectiveComponentBase
{ 
public:
	bool                                               bEnableTeamMemberHelp;                                      // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_AttractAI.OnInventoryAttractAI
	// void OnInventoryAttractAI(class AActor* Actor, class ACharacter* AICharacter);                                           // [0x3604cb0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_Bag_T
/// Size: 0x0018 (24 bytes) (0x000168 - 0x000180) align 8 pad: 0x0000
class UQuestObjectiveComp_Bag_T : public UMFQuestObjectiveComponentBase
{ 
public:
	ETutorialBagState                                  BagState;                                                   // 0x0168   (0x0001)  
	ETutorialBagType                                   BagType;                                                    // 0x0169   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x016A   (0x0006)  MISSED
	class ASGAISpawnPoint*                             SpawnPoint;                                                 // 0x0170   (0x0008)  
	class UClass*                                      ContainerClass;                                             // 0x0178   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Bag_T.OnBagOpenStateChange
	// void OnBagOpenStateChange(bool bShow, ETutorialBagType InBagType, class AActor* Container);                              // [0x36042d0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_BagTabSign_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_BagTabSign_T : public UMFQuestObjectiveComponentBase
{ 
public:
	ETutorialBagType                                   BagType;                                                    // 0x0168   (0x0001)  
	ETutorialBagTabType                                BagTabType;                                                 // 0x0169   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x016A   (0x0006)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_BagTabSign_T.OnBagTabClick
	// void OnBagTabClick(ETutorialBagType TutorialBagType, int32_t TabType);                                                   // [0x36043e0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_BgnUseItem_T
/// Size: 0x0010 (16 bytes) (0x000168 - 0x000178) align 8 pad: 0x0000
class UQuestObjectiveComp_BgnUseItem_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class UClass*                                      ItemClass;                                                  // 0x0168   (0x0008)  
	ECharacterEnduranceType                            CharacterEnduranceType;                                     // 0x0170   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0171   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_BgnUseItem_T.BeginUseItem
	// void BeginUseItem(class AActor* Character, class ASGInventory* Inventory, ECharacterEnduranceType UseInBodyType);        // [0x3603fe0] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_BigMap_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_BigMap_T : public UMFQuestObjectiveComponentBase
{ 
public:
	EBigMapState                                       BigMapState;                                                // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_BigMap_T.OnBigMapOpenStateChange
	// void OnBigMapOpenStateChange(bool bShow);                                                                                // [0x36044d0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_ChangeState_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_ChangeState_T : public UMFQuestObjectiveComponentBase
{ 
public:
	ETutorialCharacterState                            characterState;                                             // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_ChangeState_T.IsInState
	// bool IsInState();                                                                                                        // [0x36042a0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_CharacterMove
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_CharacterMove : public UMFQuestObjectiveComponentBase
{ 
public:
	int32_t                                            MinUpdateDistance;                                          // 0x0168   (0x0004)  
	int32_t                                            CacheDistance;                                              // 0x016C   (0x0004)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_CharacterMove.OnCharacterMoveEvent
	// void OnCharacterMoveEvent(int64_t Distance);                                                                             // [0x3604560] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_CheckPoint_T
/// Size: 0x0000 (0 bytes) (0x000168 - 0x000168) align 8 pad: 0x0000
class UQuestObjectiveComp_CheckPoint_T : public UMFQuestObjectiveComponentBase
{ 
public:
};

/// Class /Script/UAGame.QuestObjectiveComp_CheckWeapon_T
/// Size: 0x0000 (0 bytes) (0x000168 - 0x000168) align 8 pad: 0x0000
class UQuestObjectiveComp_CheckWeapon_T : public UMFQuestObjectiveComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_CheckWeapon_T.OnCheckWeaponBtnClick
	// void OnCheckWeaponBtnClick();                                                                                            // [0x3604680] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_ClearArea
/// Size: 0x0030 (48 bytes) (0x000168 - 0x000198) align 8 pad: 0x0000
class UQuestObjectiveComp_ClearArea : public UMFQuestObjectiveComponentBase
{ 
public:
	TArray<ECharacterType>                             SpecifiedTypes;                                             // 0x0168   (0x0010)  
	int64_t                                            VolumeID;                                                   // 0x0178   (0x0008)  
	class UUAVolumeStatisComponent*                    VolumeStatisComponent;                                      // 0x0180   (0x0008)  
	uint32_t                                           TargetNum;                                                  // 0x0188   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x018C   (0x0004)  MISSED
	FTimerHandle                                       TickTimerHandle;                                            // 0x0190   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_ClearArea.OnVolumeActorChanged
	// void OnVolumeActorChanged(int64_t InVolumeID);                                                                           // [0x3605db0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_ClearArea.OnTimerTick
	// void OnTimerTick();                                                                                                      // [0x3605d90] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_ClearArea.OnKilledEvent
	// void OnKilledEvent(class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, FDamageEvent& DamageEvent, class AActor* KillerWeapon, float KillDistance, ECharacterEnduranceType EnduranceType, class UDamageEventObject* DamageEventObject); // [0x3604e50] Final|Native|Protected|HasOutParms 
	// Function /Script/UAGame.QuestObjectiveComp_ClearArea.GetTargetNum
	// uint32_t GetTargetNum();                                                                                                 // [0x3604250] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_ClickFakeMap
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_ClickFakeMap : public UMFQuestObjectiveComponentBase
{ 
public:
	float                                              DelayTime;                                                  // 0x0168   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x016C   (0x0004)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_ClickFakeMap.OnFakeMapUIClick
	// void OnFakeMapUIClick();                                                                                                 // [0x36048d0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_ClickItem_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_ClickItem_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class UClass*                                      ItemClass;                                                  // 0x0168   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_ClickItem_T.OnClickItem
	// void OnClickItem(class ASGInventory* Inventory);                                                                         // [0x36046a0] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_CollectItem
/// Size: 0x0030 (48 bytes) (0x000168 - 0x000198) align 8 pad: 0x0000
class UQuestObjectiveComp_CollectItem : public UMFQuestObjectiveComponentBase
{ 
public:
	TArray<class ASGInventory*>                        CollectedItems;                                             // 0x0168   (0x0010)  
	unsigned char                                      UnknownData00_6[0x18];                                      // 0x0178   (0x0018)  MISSED
	bool                                               bEnableTeamMemberHelp;                                      // 0x0190   (0x0001)  
	bool                                               bAddProgressWhenActivate;                                   // 0x0191   (0x0001)  
	bool                                               bChangeCountsToValue;                                       // 0x0192   (0x0001)  
	unsigned char                                      UnknownData01_7[0x5];                                       // 0x0193   (0x0005)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.UnRegistedEvent
	// void UnRegistedEvent();                                                                                                  // [0x3606090] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.RegistedEvent
	// void RegistedEvent(class ASGCharacter* SGCharacter);                                                                     // [0x3606000] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.RefreshProgressWhenReadyToPlay
	// void RefreshProgressWhenReadyToPlay(class ASGCharacter* SGCharacter);                                                    // [0x3605f70] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.RefreshProgress
	// void RefreshProgress();                                                                                                  // [0x3605f50] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.OnTeamMemberAddInventory
	// void OnTeamMemberAddInventory(class ASGTeamInfo* TeamInfo, class ACharacter* Character, class ASGInventory* Inventory);  // [0x3605c80] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.OnProcessPawn
	// void OnProcessPawn(class APawn* Pawn);                                                                                   // [0x3605a40] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.OnPlayerFinishGame
	// void OnPlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x3605710] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.OnPlayerDied
	// void OnPlayerDied(class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, FDamageEvent& DamageEvent, class AActor* KillerWeapon, float KillDistance, ECharacterEnduranceType EnduranceType, class UDamageEventObject* DamageEventObject); // [0x3605370] Final|Native|Public|HasOutParms 
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.OnInventoryRemoved
	// void OnInventoryRemoved(class ACharacter* Character, class ASGInventory* Inventory);                                     // [0x3604d80] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.OnInventoryAdded
	// void OnInventoryAdded(class ACharacter* Character, class ASGInventory* Inventory);                                       // [0x3604be0] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.OnCharacterReadyToPlay
	// void OnCharacterReadyToPlay(class ASGCharacter* Character);                                                              // [0x36045f0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.IsCollectingQuestInventory
	// bool IsCollectingQuestInventory();                                                                                       // [0x3604270] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_CollectItem.CheckLoseQuestInventory
	// void CheckLoseQuestInventory(class ASGCharacter* Character);                                                             // [0x3604180] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_CompleteRequest
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_CompleteRequest : public UMFQuestObjectiveComponentBase
{ 
public:
	bool                                               bIncreaseQuestPrgress;                                      // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_CompleteRequest.OnRequestGiveUp
	// void OnRequestGiveUp(class UNPCAIGroupBaseRequest* GiveUpRequest);                                                       // [0x3605bf0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_CompleteRequest.OnRequestCompleted
	// void OnRequestCompleted(class UNPCAIGroupBaseRequest* CompletedRequest);                                                 // [0x3605b60] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_CompleteRequest.OnInstigatorDied
	// void OnInstigatorDied(class ACharacter* DeadCharacter, class AController* Killer, class UDamageEventObject* DamageEventObject); // [0x3604ad0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_DestroyActor
/// Size: 0x0000 (0 bytes) (0x000168 - 0x000168) align 8 pad: 0x0000
class UQuestObjectiveComp_DestroyActor : public UMFQuestObjectiveComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_DestroyActor.OnProcessPawn
	// void OnProcessPawn(class APawn* Pawn);                                                                                   // [0x3605ad0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_DestroyActor.OnInstigatorDestroyActor
	// void OnInstigatorDestroyActor(class ACharacter* Character, class AActor* Actor);                                         // [0x3604a00] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_Door_T
/// Size: 0x0010 (16 bytes) (0x000168 - 0x000178) align 8 pad: 0x0000
class UQuestObjectiveComp_Door_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class ASGDoorBase*                                 Door;                                                       // 0x0168   (0x0008)  
	ETutorialDoorState                                 DoorState;                                                  // 0x0170   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0171   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Door_T.OnDoorStateChange
	// void OnDoorStateChange(class ASGDoorBase* InDoor, ESGDoorState InDoorState);                                             // [0x3604730] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_EscapeMap
/// Size: 0x0000 (0 bytes) (0x000168 - 0x000168) align 8 pad: 0x0000
class UQuestObjectiveComp_EscapeMap : public UMFQuestObjectiveComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_EscapeMap.OnPlayerFinishGame
	// void OnPlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x3605820] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_Escort
/// Size: 0x0000 (0 bytes) (0x000168 - 0x000168) align 8 pad: 0x0000
class UQuestObjectiveComp_Escort : public UMFQuestObjectiveComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Escort.OnPlayerFinishGame
	// void OnPlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x3605930] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_FacePanel_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_FacePanel_T : public UMFQuestObjectiveComponentBase
{ 
public:
	EFacePanelState                                    FacePanelState;                                             // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_FacePanel_T.OnFacePanelOpenStateChange
	// void OnFacePanelOpenStateChange(bool bShow, int32_t WidgetID);                                                           // [0x3604800] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_Fire_T
/// Size: 0x0000 (0 bytes) (0x000168 - 0x000168) align 8 pad: 0x0000
class UQuestObjectiveComp_Fire_T : public UMFQuestObjectiveComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Fire_T.OnBeginFire
	// void OnBeginFire();                                                                                                      // [0x36044b0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_HealthUI_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_HealthUI_T : public UMFQuestObjectiveComponentBase
{ 
public:
	ECharacterEnduranceType                            BodyType;                                                   // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_HealthUI_T.OnHealthUIClick
	// void OnHealthUIClick(ECharacterEnduranceType InEnduranceType);                                                           // [0x3609320] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_HitTarget
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_HitTarget : public UMFQuestObjectiveComponentBase
{ 
public:
	bool                                               bEnableTeamMemberHelp;                                      // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_HitTarget.OnTeamMemberCauseDamage
	// void OnTeamMemberCauseDamage(class ASGTeamInfo* TeamInfo, FTakeDamageInfo& TakeDamageInfo);                              // [0x360b050] Final|Native|Protected|HasOutParms 
	// Function /Script/UAGame.QuestObjectiveComp_HitTarget.OnTakeDamage
	// void OnTakeDamage(class ASGCharacter* Taker, class ASGCharacter* Causer, float AttemptedDamage, float ActuralDamage, FVector Momentum, class AActor* HitArmor, FSGPointDamageEvent& DamageEvent, class AActor* DamageCauser, class UDamageEventObject* DamageEventObject); // [0x360ad30] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/UAGame.QuestObjectiveComp_HitTarget.OnProcessPawn
	// void OnProcessPawn(class APawn* Pawn);                                                                                   // [0x360a5d0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_HitTarget.OnInstigatorCauseDamage
	// void OnInstigatorCauseDamage(FTakeDamageInfo& TakeDamageInfo);                                                           // [0x36093a0] Final|Native|Protected|HasOutParms 
	// Function /Script/UAGame.QuestObjectiveComp_HitTarget.OnCauseDamageEvent
	// void OnCauseDamageEvent(FTakeDamageInfo& TakeDamageInfo);                                                                // [0x36088e0] Final|Native|Protected|HasOutParms 
};

/// Class /Script/UAGame.QuestObjectiveComp_Interaction
/// Size: 0x0018 (24 bytes) (0x000168 - 0x000180) align 8 pad: 0x0000
class UQuestObjectiveComp_Interaction : public UMFQuestObjectiveComponentBase
{ 
public:
	TArray<class AActor*>                              InteractTargets;                                            // 0x0168   (0x0010)  
	bool                                               bHasTryInteract;                                            // 0x0178   (0x0001)  
	EQuestInteractEnableType                           InteractEnableType;                                         // 0x0179   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x017A   (0x0006)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Interaction.OnNotifyInteractEvent
	// void OnNotifyInteractEvent(class ASGCharacter* Character, class AActor* Target, EInteractEventType EventType, class USGInteractComponentBase* SGInteractComponentBase); // [0x3609d30] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_KillAI_T
/// Size: 0x0010 (16 bytes) (0x000168 - 0x000178) align 8 pad: 0x0000
class UQuestObjectiveComp_KillAI_T : public UMFQuestObjectiveComponentBase
{ 
public:
	TArray<class ASGAISpawnPoint*>                     AISpawnPointArr;                                            // 0x0168   (0x0010)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_KillAI_T.OnDied
	// void OnDied(class AController* Killer, class UDamageEventObject* DamageEventObject, bool& bWantToDie);                   // [0x3608f40] Final|Native|Protected|HasOutParms 
};

/// Class /Script/UAGame.QuestObjectiveComp_KillTarget
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_KillTarget : public UMFQuestObjectiveComponentBase
{ 
public:
	bool                                               bEnableTeamMemberHelp;                                      // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_KillTarget.OnTeamMemberKillOther
	// void OnTeamMemberKillOther(class ASGTeamInfo* TeamInfo, FKillInfo& TeamKillInfo);                                        // [0x360b150] Final|Native|Protected|HasOutParms 
	// Function /Script/UAGame.QuestObjectiveComp_KillTarget.OnProcessPawn
	// void OnProcessPawn(class APawn* Pawn);                                                                                   // [0x360a660] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_KillTarget.OnKilledEvent
	// void OnKilledEvent(FKillInfo& KillInfo);                                                                                 // [0x36097e0] Final|Native|Protected|HasOutParms 
	// Function /Script/UAGame.QuestObjectiveComp_KillTarget.OnInstigatorKillOther
	// void OnInstigatorKillOther(FKillInfo& KillInfo, FKillOtherStatis& KillOtherStatics);                                     // [0x3609450] Final|Native|Protected|HasOutParms 
};

/// Class /Script/UAGame.QuestObjectiveComp_LootContainer
/// Size: 0x0000 (0 bytes) (0x000168 - 0x000168) align 8 pad: 0x0000
class UQuestObjectiveComp_LootContainer : public UMFQuestObjectiveComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_LootContainer.OnLootContainerEvent
	// void OnLootContainerEvent(int64_t ContainerType, class ACharacter* Looter, class ASGInventory* LootContainer);           // [0x36098a0] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_MoveItem_T
/// Size: 0x0010 (16 bytes) (0x000168 - 0x000178) align 8 pad: 0x0000
class UQuestObjectiveComp_MoveItem_T : public UMFQuestObjectiveComponentBase
{ 
public:
	EAttachPosition                                    NewPositionType;                                            // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0169   (0x0007)  MISSED
	class UClass*                                      ItemClass;                                                  // 0x0170   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_MoveItem_T.OnMoveItem
	// void OnMoveItem(class ACharacter* Character, class ASGInventory* Inventory, EAttachPosition AttachPosition);             // [0x3609c20] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_MoveItem_T.OnAddInventory
	// void OnAddInventory(class ACharacter* Character, class ASGInventory* Inventory);                                         // [0x3608810] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_MoveTo_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_MoveTo_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class ASGVolume*                                   Volume;                                                     // 0x0168   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_MoveTo_T.OnCharacterBeginOverlap
	// void OnCharacterBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x3608990] Final|Native|Public|HasOutParms 
};

/// Class /Script/UAGame.QuestObjectiveComp_PickUpItem_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_PickUpItem_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class UClass*                                      ItemClass;                                                  // 0x0168   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_PickUpItem_T.OnInventoryAdded
	// void OnInventoryAdded(class ACharacter* Character, class ASGInventory* Inventory);                                       // [0x3609570] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_PushBullet_T
/// Size: 0x0000 (0 bytes) (0x000168 - 0x000168) align 8 pad: 0x0000
class UQuestObjectiveComp_PushBullet_T : public UMFQuestObjectiveComponentBase
{ 
public:


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_PushBullet_T.OnPushBullet
	// void OnPushBullet(class ACharacter* Character, class ASGInventory* Bullet, class ASGInventory* Mag, int32_t BulletCount); // [0x360a780] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_Search_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_Search_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class UClass*                                      ItemClass;                                                  // 0x0168   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Search_T.OnLootContainerEvent
	// void OnLootContainerEvent(int64_t ContainerType, class ACharacter* Looter, class ASGInventory* LootContainer);           // [0x36099b0] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_Setting_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_Setting_T : public UMFQuestObjectiveComponentBase
{ 
public:
	ETutorialSettingState                              SettingPannalState;                                         // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Setting_T.OnSettingPannalChange
	// void OnSettingPannalChange(int32_t State);                                                                               // [0x360aa40] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_Sound_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_Sound_T : public UMFQuestObjectiveComponentBase
{ 
public:
	float                                              DelayTime;                                                  // 0x0168   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x016C   (0x0004)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Sound_T.OnSoundUIClick
	// void OnSoundUIClick();                                                                                                   // [0x360aad0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_Survival
/// Size: 0x0010 (16 bytes) (0x000168 - 0x000178) align 8 pad: 0x0000
class UQuestObjectiveComp_Survival : public UMFQuestObjectiveComponentBase
{ 
public:
	bool                                               bResetOnCheckFailed;                                        // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0169   (0x0007)  MISSED
	FTimerHandle                                       TickTimerHandle;                                            // 0x0170   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Survival.StopTimer
	// void StopTimer();                                                                                                        // [0x360b740] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_Survival.StartTimer
	// void StartTimer();                                                                                                       // [0x360b700] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_Survival.OnTimerTick
	// void OnTimerTick();                                                                                                      // [0x360b380] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_SwitchWeapon_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_SwitchWeapon_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class UClass*                                      WeaponClass;                                                // 0x0168   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_SwitchWeapon_T.OnSwitchWeapon
	// void OnSwitchWeapon(class ASGWeapon* Weapon, FString WeaponName);                                                        // [0x360ac00] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_TakeInItemValue
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_TakeInItemValue : public UMFQuestObjectiveComponentBase
{ 
public:
	bool                                               bChangeValueToCounts;                                       // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_TakeInItemValue.RefreshProgress
	// void RefreshProgress();                                                                                                  // [0x360b5a0] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_TakeInItemValue.OnFlowStateChange
	// void OnFlowStateChange(class APlayerController* PlayerController, FName NewState, FName OldState);                       // [0x3609210] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_TakeOutItemValue
/// Size: 0x0058 (88 bytes) (0x000168 - 0x0001C0) align 8 pad: 0x0000
class UQuestObjectiveComp_TakeOutItemValue : public UMFQuestObjectiveComponentBase
{ 
public:
	unsigned char                                      UnknownData00_3[0x4];                                       // 0x0168   (0x0004)  MISSED
	bool                                               bEscapeFailedIngnoreSafeBox;                                // 0x016C   (0x0001)  
	bool                                               bChangeValueToCounts;                                       // 0x016D   (0x0001)  
	unsigned char                                      UnknownData01_7[0x52];                                      // 0x016E   (0x0052)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_TakeOutItemValue.RefreshProgress
	// void RefreshProgress();                                                                                                  // [0x360b5c0] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_TakeOutItemValue.OnPushBullet
	// void OnPushBullet(class ACharacter* Character, class ASGInventory* Bullet, class ASGInventory* Mag, int32_t BulletCount); // [0x360a8e0] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_TakeOutItemValue.OnPrePlayerFinishGame
	// void OnPrePlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x360a4c0] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_TakeOutItemValue.OnPlayerDied
	// void OnPlayerDied(class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, FDamageEvent& DamageEvent, class AActor* KillerWeapon, float KillDistance, ECharacterEnduranceType EnduranceType, class UDamageEventObject* DamageEventObject); // [0x3609e90] Final|Native|Public|HasOutParms 
	// Function /Script/UAGame.QuestObjectiveComp_TakeOutItemValue.OnModifyInventoryTotalCount
	// void OnModifyInventoryTotalCount(class ACharacter* Character, class ASGInventory* Inventory, int32_t OldCount, int32_t NewCount); // [0x3609ac0] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_TakeOutItemValue.OnInventoryRemoved
	// void OnInventoryRemoved(class ACharacter* Character, class ASGInventory* Inventory);                                     // [0x3609710] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_TakeOutItemValue.OnInventoryAdded
	// void OnInventoryAdded(class ACharacter* Character, class ASGInventory* Inventory);                                       // [0x3609640] Final|Native|Public  
	// Function /Script/UAGame.QuestObjectiveComp_TakeOutItemValue.OnCharacterCostBullet
	// void OnCharacterCostBullet(class ACharacter* Character, class ASGInventory* Inventory, TArray<uint64_t>& BulletItemIDs, TArray<FStackableItemSourceInfo>& OutFromPlayerInfos); // [0x3608bb0] Final|Native|Public|HasOutParms 
};

/// Class /Script/UAGame.QuestObjectiveComp_Target_T
/// Size: 0x0018 (24 bytes) (0x000168 - 0x000180) align 8 pad: 0x0000
class UQuestObjectiveComp_Target_T : public UMFQuestObjectiveComponentBase
{ 
public:
	TArray<class ASGRangeTargetBase*>                  Targets;                                                    // 0x0168   (0x0010)  
	ETutorialDamageType                                DamageType;                                                 // 0x0178   (0x0001)  
	bool                                               bAccumulate;                                                // 0x0179   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x017A   (0x0006)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_Target_T.OnDamageTarget
	// void OnDamageTarget(class ASGRangeTargetBase* Target, int32_t Score, int32_t InDamageType, FVector& HitLocation);        // [0x3608de0] Final|Native|Protected|HasOutParms|HasDefaults 
};

/// Class /Script/UAGame.QuestObjectiveComp_UseInventory
/// Size: 0x0010 (16 bytes) (0x000168 - 0x000178) align 8 pad: 0x0000
class UQuestObjectiveComp_UseInventory : public UMFQuestObjectiveComponentBase
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x0168   (0x0008)  MISSED
	FTimerHandle                                       TickTimerHandle;                                            // 0x0170   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_UseInventory.StopTimer
	// void StopTimer();                                                                                                        // [0x360b740] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_UseInventory.StartTimer
	// void StartTimer();                                                                                                       // [0x360b720] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_UseInventory.OnTimerTick
	// void OnTimerTick();                                                                                                      // [0x360b3a0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_UseInventory.OnStartUsingRecoveryItem
	// void OnStartUsingRecoveryItem(class ACharacter* Character, class ASGInventory* Inventory, uint32_t RumtimeID);           // [0x360aaf0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_UseInventory.OnEndUsingRecoveryItem
	// void OnEndUsingRecoveryItem(class ACharacter* Character, class ASGInventory* Inventory, uint32_t RumtimeID, bool bWasCancelled, char bUsedUp); // [0x3609060] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_UseInventory.ListenCharacterAbilityEvent
	// void ListenCharacterAbilityEvent();                                                                                      // [0x36087f0] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestObjectiveComp_UseItem_T
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_UseItem_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class UClass*                                      ItemClass;                                                  // 0x0168   (0x0008)  


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_UseItem_T.OnUseItem
	// void OnUseItem(class ACharacter* Character, class ASGInventory* Inventory);                                              // [0x360b3c0] Final|Native|Public  
};

/// Class /Script/UAGame.QuestObjectiveComp_UseThrowable
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_UseThrowable : public UMFQuestObjectiveComponentBase
{ 
public:
	bool                                               bEnableTeamMemberHelp;                                      // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0169   (0x0007)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_UseThrowable.OnThrowableProjectileSpawn
	// void OnThrowableProjectileSpawn(class ASGThrowableProjectile* InProjectile, FVector SpawnLocation, float PlayEffectTime); // [0x360b260] Final|Native|Protected|HasDefaults 
};

/// Class /Script/UAGame.QuestObjectiveComp_ViewTrace_T
/// Size: 0x0020 (32 bytes) (0x000168 - 0x000188) align 8 pad: 0x0000
class UQuestObjectiveComp_ViewTrace_T : public UMFQuestObjectiveComponentBase
{ 
public:
	class AActor*                                      ViewTargetActor;                                            // 0x0168   (0x0008)  
	int32_t                                            TraceLength;                                                // 0x0170   (0x0004)  
	float                                              Duration;                                                   // 0x0174   (0x0004)  
	TEnumAsByte<ECollisionChannel>                     CheckChannal;                                               // 0x0178   (0x0001)  
	unsigned char                                      UnknownData00_7[0xF];                                       // 0x0179   (0x000F)  MISSED
};

/// Class /Script/UAGame.QuestObjectiveComp_WalkDistance
/// Size: 0x0008 (8 bytes) (0x000168 - 0x000170) align 8 pad: 0x0000
class UQuestObjectiveComp_WalkDistance : public UMFQuestObjectiveComponentBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0168   (0x0008)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestObjectiveComp_WalkDistance.UnRegistedEvent
	// void UnRegistedEvent(class ASGCharacter* Character);                                                                     // [0x360b760] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_WalkDistance.RegistedEvent
	// void RegistedEvent(class ASGCharacter* Character);                                                                       // [0x360b670] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_WalkDistance.RefreshProgressWhenReadyToPlay
	// void RefreshProgressWhenReadyToPlay(class ASGCharacter* SGCharacter);                                                    // [0x360b5e0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_WalkDistance.OnWalkDistanceChanged
	// void OnWalkDistanceChanged(class ACharacter* Character, bool bIsMoving, float MovDist);                                  // [0x360b490] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_WalkDistance.OnProcessPawn
	// void OnProcessPawn(class APawn* Pawn);                                                                                   // [0x360a6f0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_WalkDistance.OnPlayerFinishGame
	// void OnPlayerFinishGame(class APlayerController* PlayerController, EPlayerEndGameType FinishType, class AActor* EscapeVolume); // [0x360a3b0] Final|Native|Protected 
	// Function /Script/UAGame.QuestObjectiveComp_WalkDistance.OnPlayerDied
	// void OnPlayerDied(class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, FDamageEvent& DamageEvent, class AActor* KillerWeapon, float KillDistance, ECharacterEnduranceType EnduranceType, class UDamageEventObject* DamageEventObject); // [0x360a120] Final|Native|Protected|HasOutParms 
	// Function /Script/UAGame.QuestObjectiveComp_WalkDistance.OnCharacterReadyToPlay
	// void OnCharacterReadyToPlay(class ASGCharacter* Character);                                                              // [0x3608d50] Final|Native|Protected 
};

/// Class /Script/UAGame.QuestPrimaryCondition_AchievementChanged
/// Size: 0x0008 (8 bytes) (0x000078 - 0x000080) align 8 pad: 0x0000
class UQuestPrimaryCondition_AchievementChanged : public UMFQuestPrimaryConditionBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0078   (0x0008)  MISSED


	/// Functions
	// Function /Script/UAGame.QuestPrimaryCondition_AchievementChanged.OnBlackboardIntMapChanged
	// void OnBlackboardIntMapChanged(class AActor* ObjectiveInstigator, class AActor* TargetActor, FGameplayTag& Key, int32_t CurrentValue, int32_t PreviousValue); // [0x360e3a0] Final|Native|Public|HasOutParms 
};

/// Class /Script/UAGame.QuestPrimaryCondition_AddInventory
